const availableCourses = [
    {
        "id": 1,
        "code": "أساسيات قواعد البيانات/ش1",
        "name": "أساسيات قواعد البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-01",
        "color": "#4bb656"
    },
    {
        "id": 2,
        "code": "أساسيات قواعد البيانات/ش2",
        "name": "أساسيات قواعد البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-01",
        "color": "#d2868f"
    },
    {
        "id": 3,
        "code": "أساسيات قواعد البيانات/ش3",
        "name": "أساسيات قواعد البيانات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-01",
        "color": "#63d9ff"
    },
    {
        "id": 4,
        "code": "أساسيات قواعد البيانات/ش4",
        "name": "أساسيات قواعد البيانات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-01",
        "color": "#6ed863"
    },
    {
        "id": 5,
        "code": "بنيان البرمجيات",
        "name": "بنيان البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-02",
        "color": "#9290fc"
    },
    {
        "id": 6,
        "code": "تصميم نظم البرمجيات",
        "name": "تصميم نظم البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#936b84"
    },
    {
        "id": 7,
        "code": "الذكاء الصنعي العملي",
        "name": "الذكاء الصنعي العملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#9ee73d"
    },
    {
        "id": 8,
        "code": "مدخل إلى التعلم العميق",
        "name": "مدخل إلى التعلم العميق",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#8853b2"
    },
    {
        "id": 9,
        "code": "مدخل إلى الرؤية الحاسوبية/ش1",
        "name": "مدخل إلى الرؤية الحاسوبية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-03",
        "color": "#4044a9"
    },
    {
        "id": 10,
        "code": "مدخل إلى الرؤية الحاسوبية/ش2",
        "name": "مدخل إلى الرؤية الحاسوبية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-03",
        "color": "#90908a"
    },
    {
        "id": 11,
        "code": "معالجة الصور وتحليلها/ش1",
        "name": "معالجة الصور وتحليلها/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-03",
        "color": "#989f83"
    },
    {
        "id": 12,
        "code": "معالجة الصور وتحليلها/ش2",
        "name": "معالجة الصور وتحليلها/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-03",
        "color": "#68c19b"
    },
    {
        "id": 13,
        "code": "الخوارزميات وبنى المعطيات/ش1",
        "name": "الخوارزميات وبنى المعطيات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد / م.سعيد دياب",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-04",
        "color": "#be132a"
    },
    {
        "id": 14,
        "code": "إدارة المشاريع البرمجية",
        "name": "إدارة المشاريع البرمجية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-04",
        "color": "#559af9"
    },
    {
        "id": 15,
        "code": "الخوارزميات وبنى المعطيات/ش2",
        "name": "الخوارزميات وبنى المعطيات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد / م.سعيد دياب",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-04",
        "color": "#5d3650"
    },
    {
        "id": 16,
        "code": "البرمجة بلغة إن/",
        "name": "البرمجة بلغة إن/",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-05",
        "color": "#41cef4"
    },
    {
        "id": 17,
        "code": "البرمجة بلغة بايثون/ش2",
        "name": "البرمجة بلغة بايثون/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-05",
        "color": "#b18d44"
    },
    {
        "id": 18,
        "code": "البرمجة بلغة بايثون/ش3",
        "name": "البرمجة بلغة بايثون/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#b2ed20"
    },
    {
        "id": 19,
        "code": "الكيمياء الحيوية",
        "name": "الكيمياء الحيوية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. يمن الأتاسي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-05",
        "color": "#5761f9"
    },
    {
        "id": 20,
        "code": "أمن الاتصالات",
        "name": "أمن الاتصالات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نادر خضر",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-07",
        "color": "#9affb8"
    },
    {
        "id": 21,
        "code": "أساسيات أمن الحواسيب/ش3",
        "name": "أساسيات أمن الحواسيب/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نادر خضر",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-07",
        "color": "#b0ee22"
    },
    {
        "id": 22,
        "code": "نمذجة شبكات الاتصالات",
        "name": "نمذجة شبكات الاتصالات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نادر خضر",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-07",
        "color": "#a1374e"
    },
    {
        "id": 23,
        "code": "إدارة تشكيلة البرمجيات/عملي",
        "name": "إدارة تشكيلة البرمجيات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. أنس عبد العزيز",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-08",
        "color": "#52c418"
    },
    {
        "id": 24,
        "code": "بنيان البرمجيات/عملي",
        "name": "بنيان البرمجيات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. أنس عبد العزيز",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-08",
        "color": "#753d8b"
    },
    {
        "id": 25,
        "code": "تصميم نظم البرمجيات/عملي",
        "name": "تصميم نظم البرمجيات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. أنس عبد العزيز",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-08",
        "color": "#486494"
    },
    {
        "id": 26,
        "code": "اختبار البرمجيات",
        "name": "اختبار البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مهيب النقري / م.أنس عبد العزيز",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#833bfd"
    },
    {
        "id": 27,
        "code": "التحليل العددي/ش1",
        "name": "التحليل العددي/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. معاذ عبد المجيد",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-09",
        "color": "#926e2a"
    },
    {
        "id": 28,
        "code": "التحليل العددي/ش2",
        "name": "التحليل العددي/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. معاذ عبد المجيد",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-09",
        "color": "#b9febf"
    },
    {
        "id": 29,
        "code": "التحليل العددي/ش3",
        "name": "التحليل العددي/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. معاذ عبد المجيد",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#69d3a0"
    },
    {
        "id": 30,
        "code": "الإحصاء والإحتمالات/ش1",
        "name": "الإحصاء والإحتمالات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عزات قاسم",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-10",
        "color": "#a8a369"
    },
    {
        "id": 31,
        "code": "الإحصاء والاحتمالات/ش2",
        "name": "الإحصاء والاحتمالات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عزات قاسم",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#68f2ec"
    },
    {
        "id": 32,
        "code": "الإحصاء والإحتمالات/ش3",
        "name": "الإحصاء والإحتمالات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عزات قاسم",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#..."
    },
        {
        "id": 33,
        "code": "الإحصاء والإحتمالات/ش4",
        "name": "الإحصاء والإحتمالات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان عاقل",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-11",
        "color": "#bb0b22"
    },
    {
        "id": 34,
        "code": "الإحصاء والإحتمالات/ش5",
        "name": "الإحصاء والإحتمالات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان عاقل",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-11",
        "color": "#b6bffb"
    },
    {
        "id": 35,
        "code": "الإحصاء والإحتمالات/ش6",
        "name": "الإحصاء والإحتمالات/ش6",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان عاقل",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-11",
        "color": "#c8f688"
    },
    {
        "id": 36,
        "code": "معالجة الإشارة الرقمية",
        "name": "معالجة الإشارة الرقمية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-12",
        "color": "#3db4a5"
    },
    {
        "id": 37,
        "code": "الدارات المنطقية/ش1",
        "name": "الدارات المنطقية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. إبراهيم شعيب",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-12",
        "color": "#7e7f48"
    },
    {
        "id": 38,
        "code": "النظم الميكاإلكترونية",
        "name": "النظم الميكاإلكترونية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. إبراهيم شعيب",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-12",
        "color": "#8c999f"
    },
    {
        "id": 39,
        "code": "النمذجة العددية",
        "name": "النمذجة العددية",
        "type": "theory",
        "credits": 0,
        "instructor": "د.إبراهيم شعيب",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-12",
        "color": "#a7800b"
    },
    {
        "id": 40,
        "code": "التصميم بمساعدة الحاسوب/ش1",
        "name": "التصميم بمساعدة الحاسوب/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. سامر حسام الدين",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-13",
        "color": "#ae8c7b"
    },
    {
        "id": 41,
        "code": "المتحكمات المنطقية القابلة للبرمجة",
        "name": "المتحكمات المنطقية القابلة للبرمجة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. سامر حسام الدين",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-13",
        "color": "#b13475"
    },
    {
        "id": 42,
        "code": "الدارات الإلكترونية1/ش1",
        "name": "الدارات الإلكترونية1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-13",
        "color": "#8801c7"
    },
    {
        "id": 43,
        "code": "التصميم بمساعدة الحاسوب/ش2",
        "name": "التصميم بمساعدة الحاسوب/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. سامرحسام الدين",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-13",
        "color": "#3f105b"
    },
    {
        "id": 44,
        "code": "أساسيات أمن الحواسيب/ش1",
        "name": "أساسيات أمن الحواسيب/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. خالد النجار",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-14",
        "color": "#baf7d5"
    },
    {
        "id": 45,
        "code": "أساسيات أمن الحواسيب/ش2",
        "name": "أساسيات أمن الحواسيب/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. خالد النجار",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-14",
        "color": "#615110"
    },
    {
        "id": 46,
        "code": "أمن الشبكات والأمن السيبراني الد النجار",
        "name": "أمن الشبكات والأمن السيبراني الد النجار",
        "type": "theory",
        "credits": 0,
        "instructor": "د.خالد النجار",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-14",
        "color": "#74bdc1"
    },
    {
        "id": 47,
        "code": "الرياضيات الترميمية/ش5",
        "name": "الرياضيات الترميمية/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. رائد الرفاعي",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-14",
        "color": "#3681ce"
    },
    {
        "id": 48,
        "code": "الجبر الخطي ونظرية المصفوفات/ش2",
        "name": "الجبر الخطي ونظرية المصفوفات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-15",
        "color": "#a3e0d1"
    },
    {
        "id": 49,
        "code": "الجبر الخطي ونظرية المصفوفات/قديم ش1",
        "name": "الجبر الخطي ونظرية المصفوفات/قديم ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-15",
        "color": "#b17f75"
    },
    {
        "id": 50,
        "code": "الجبر الخطي ونظرية المصفوفات/ش1",
        "name": "الجبر الخطي ونظرية المصفوفات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-15",
        "color": "#574827"
    },
    {
        "id": 51,
        "code": "شبكات الحاسوب/ش1",
        "name": "شبكات الحاسوب/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسام محمد",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-16",
        "color": "#8a1ac1"
    },
    {
        "id": 52,
        "code": "شبكات الحاسوب/ش2",
        "name": "شبكات الحاسوب/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسام محمد",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-16",
        "color": "#40af89"
    },
    {
        "id": 53,
        "code": "شبكات الحاسوب/ش3",
        "name": "شبكات الحاسوب/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسام محمد",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-16",
        "color": "#d97b84"
    },
    {
        "id": 54,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش1",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-17",
        "color": "#ceccb1"
    },
    {
        "id": 55,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش5",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-17",
        "color": "#6b54f4"
    },
    {
        "id": 56,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش2",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-17",
        "color": "#8d032d"
    },
    {
        "id": 57,
        "code": "مدخل إلى الخوارزميات والبرمجة/قديم",
        "name": "مدخل إلى الخوارزميات والبرمجة/قديم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-17",
        "color": "#48154c"
    },
    {
        "id": 58,
        "code": "نظم التشغيل/2ش1",
        "name": "نظم التشغيل/2ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-18",
        "color": "#340dcd"
    },
    {
        "id": 59,
        "code": "نظم التشغيل1/ش1",
        "name": "نظم التشغيل1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-18",
        "color": "#c3fdc8"
    },
    {
        "id": 60,
        "code": "النظم الموزعة والحوسبة السحابية/ش1",
        "name": "النظم الموزعة والحوسبة السحابية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-18",
        "color": "#54168f"
    },
    {
        "id": 61,
        "code": "برمجة نظم التشغيل (برمجة النظم)",
        "name": "برمجة نظم التشغيل (برمجة النظم)",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-18",
        "color": "#7fefdc"
    },
    {
        "id": 62,
        "code": "الدارات الكهربائية2",
        "name": "الدارات الكهربائية2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-ACN-1",
        "color": "#84bf87"
    },
    {
        "id": 63,
        "code": "الدارات الكهربائية2/عملي",
        "name": "الدارات الكهربائية2/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-ACN-1",
        "color": "#5b26a2"
    },
    {
        "id": 64,
        "code": "الآلات الكهربائية",
        "name": "الآلات الكهربائية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-ACN-1",
        "color": "#..."
    },
        {
        "id": 65,
        "code": "الآلات الكهربائية/عملي",
        "name": "الآلات الكهربائية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-ACN-1",
        "color": "#97d12a"
    },
    {
        "id": 66,
        "code": "لغات البرمجة",
        "name": "لغات البرمجة",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "UR8",
        "color": "#42d81e"
    },
    {
        "id": 67,
        "code": "لغات البرمجة/عملي",
        "name": "لغات البرمجة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "UR8",
        "color": "#7d7f5c"
    },
    {
        "id": 68,
        "code": "تطوير تطبيقات الموبايل",
        "name": "تطوير تطبيقات الموبايل",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "UR8",
        "color": "#749d4c"
    },
    {
        "id": 69,
        "code": "تطبيقات الإنترنت",
        "name": "تطبيقات الإنترنت",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "UR8",
        "color": "#cacc7b"
    },
    {
        "id": 70,
        "code": "بنيان الحواسيب/2ش1",
        "name": "بنيان الحواسيب/2ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "UR9",
        "color": "#ba235e"
    },
    {
        "id": 71,
        "code": "بنيان الحواسيب/2ش2",
        "name": "بنيان الحواسيب/2ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "UR9",
        "color": "#465423"
    },
    {
        "id": 72,
        "code": "بنيان الحواسيب/2ش3",
        "name": "بنيان الحواسيب/2ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "UR9",
        "color": "#c50aca"
    },
    {
        "id": 73,
        "code": "البرمجة3/عملي ف11",
        "name": "البرمجة3/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#3767e3"
    },
    {
        "id": 74,
        "code": "البرمجة3/عملي ف21",
        "name": "البرمجة3/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#c28c28"
    },
    {
        "id": 75,
        "code": "البرمجة3/عملي ف12",
        "name": "البرمجة3/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#699b2f"
    },
    {
        "id": 76,
        "code": "البرمجة3/عملي ف22",
        "name": "البرمجة3/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#4d110e"
    },
    {
        "id": 77,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف11",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#db2cda"
    },
    {
        "id": 78,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف21",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#d48870"
    },
    {
        "id": 79,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف12",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#bfe51a"
    },
    {
        "id": 80,
        "code": "مدخل ! الذكاء الاصطناعي/عملي ف22 د اة صالح/م. رفاه سنجقدار",
        "name": "مدخل ! الذكاء الاصطناعي/عملي ف22 د اة صالح/م. رفاه سنجقدار",
        "type": "lab",
        "credits": 0,
        "instructor": "د.فتاة صالح / م.رفاه سنجقدار",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#378022"
    },
    {
        "id": 81,
        "code": "الإرمجة بلغة بايثون/ عملي ف11",
        "name": "الإرمجة بلغة بايثون/ عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#9cb35a"
    },
    {
        "id": 82,
        "code": "البرمجة بلغة بايثون/ عملي ف21",
        "name": "البرمجة بلغة بايثون/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#ab1c87"
    },
    {
        "id": 83,
        "code": "البرمجة بلغة بايثون/عملي ف12",
        "name": "البرمجة بلغة بايثون/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#c3ed27"
    },
    {
        "id": 84,
        "code": "البرمجة بلغة بايثون/عملي ف22",
        "name": "البرمجة بلغة بايثون/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#cf6aea"
    },
    {
        "id": 85,
        "code": "البرمجة2/عملي ف11",
        "name": "البرمجة2/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#cdce97"
    },
    {
        "id": 86,
        "code": "البرمجة2/عملي ف21",
        "name": "البرمجة2/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#5103ab"
    },
    {
        "id": 87,
        "code": "البرمجة2/عملي ف21",
        "name": "البرمجة2/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#55135b"
    },
    {
        "id": 88,
        "code": "البرمجة2/عملي ف22",
        "name": "البرمجة2/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#d4e3d2"
    },
    {
        "id": 89,
        "code": "نظم التشغيل1/عملي ف11",
        "name": "نظم التشغيل1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#37536f"
    },
    {
        "id": 90,
        "code": "نظم التشغيل1/عملي ف21",
        "name": "نظم التشغيل1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#48ff60"
    },
    {
        "id": 91,
        "code": "نظم التشغيل1/عملي ف12",
        "name": "نظم التشغيل1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#98aab8"
    },
    {
        "id": 92,
        "code": "نظم التشغيل1/عملي ف22",
        "name": "نظم التشغيل1/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#93bd1c"
    },
    {
        "id": 93,
        "code": "أساسيات قواعد البيانات/عملي ف11",
        "name": "أساسيات قواعد البيانات/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#a4d15e"
    },
    {
        "id": 94,
        "code": "أساسيات قواعد البيانات/ عملي ف21",
        "name": "أساسيات قواعد البيانات/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رنان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#51f485"
    },
    {
        "id": 95,
        "code": "أساسيات قواعد البيانات/عملي ف12",
        "name": "أساسيات قواعد البيانات/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#6f723b"
    },
    {
        "id": 96,
        "code": "أساسيات قواعد البيانات/عملي ف22",
        "name": "أساسيات قواعد البيانات/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#af47a6"
    },
    {
        "id": 97,
        "code": "أمن نظم قواعد البيانات/عملي ف11",
        "name": "أمن نظم قواعد البيانات/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#38fce6"
    },
    {
        "id": 98,
        "code": "أمن نظم قواعد البيانات/عملي ف21",
        "name": "أمن نظم قواعد البيانات/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#82d8aa"
    },
    {
        "id": 99,
        "code": "أساسيات أمن الحواسيب/عملي ف11",
        "name": "أساسيات أمن الحواسيب/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#7af244"
    },
    {
        "id": 100,
        "code": "أساسيات أمن الحواسيب/عملي ف21",
        "name": "أساسيات أمن الحواسيب/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#3deda6"
    },
    {
        "id": 101,
        "code": "1 النظم الموزعة والحوسبة السحابية/عملي ف11",
        "name": "1 النظم الموزعة والحوسبة السحابية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#7861e2"
    },
    {
        "id": 102,
        "code": "النظم المورّعة والحوسبة السحابية/عملي ف21",
        "name": "النظم المورّعة والحوسبة السحابية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#345530"
    },
    {
        "id": 103,
        "code": "نظم التشغيل1/عملي ف31",
        "name": "نظم التشغيل1/عملي ف31",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#4d0436"
    },
    {
        "id": 104,
        "code": "إدارة المخاطر والامتثال/عملي",
        "name": "إدارة المخاطر والامتثال/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. نبيل القادري / م. جعفر محفوض",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#b414d7"
    },
    {
        "id": 105,
        "code": "أساسيات قواعد البيانات/عملي ف13",
        "name": "أساسيات قواعد البيانات/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#63f661"
    },
    {
        "id": 106,
        "code": "أساسيات قواعد البيانات/عملي ف23",
        "name": "أساسيات قواعد البيانات/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#ca94e1"
    },
    {
        "id": 107,
        "code": "أساسيات قواعد البيانات/عملي ف14",
        "name": "أساسيات قواعد البيانات/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#50f219"
    },
    {
        "id": 108,
        "code": "أساسيات قواعد البيانات/عملي ف24",
        "name": "أساسيات قواعد البيانات/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزابى اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#b90c76"
    },
    {
        "id": 109,
        "code": "الدارات الكهربائية1/عملي ف11",
        "name": "الدارات الكهربائية1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ELC",
        "color": "#70a636"
    },
    {
        "id": 110,
        "code": "الدارات الكهربائية1/عملي ف21",
        "name": "الدارات الكهربائية1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ELC",
        "color": "#62552f"
    },
    {
        "id": 111,
        "code": "الدارات الكهربائية1/عملي ف12",
        "name": "الدارات الكهربائية1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-ELC",
        "color": "#35f2c4"
    },
    {
        "id": 112,
        "code": "الدارات ف22",
        "name": "الدارات ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-ELC",
        "color": "#4d8b28"
    },
    {
        "id": 113,
        "code": "معالجة الإشارة الرقمية/عملي",
        "name": "معالجة الإشارة الرقمية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#d0041b"
    },
    {
        "id": 114,
        "code": "الدارات الإلكترونية1/عملي ف1",
        "name": "الدارات الإلكترونية1/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-AT",
        "color": "#3fb61f"
    },
    {
        "id": 115,
        "code": "بنيان الحواسيب1/عملي ف11 الله الخضور/ م. محسن سكر",
        "name": "بنيان الحواسيب1/عملي ف11 الله الخضور/ م. محسن سكر",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-CA",
        "color": "#a7070f"
    },
    {
        "id": 116,
        "code": "بنيان الحواسيب1/عملي ف21",
        "name": "بنيان الحواسيب1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر بنيان الحواسيب1 / عملي ف12",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-CA",
        "color": "#ca45bb"
    },
    {
        "id": 117,
        "code": "بنيان الحواسيب1/عملي ف12",
        "name": "بنيان الحواسيب1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-CA",
        "color": "#94f202"
    },
    {
        "id": 118,
        "code": "بنيان الحواسيب1/عملي ف22 لله الخضور/ م. محسن سكر",
        "name": "بنيان الحواسيب1/عملي ف22 لله الخضور/ م. محسن سكر",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-CA",
        "color": "#65c4c6"
    },
    {
        "id": 119,
        "code": "مدخل إلى الروبوتية/عملي ف1",
        "name": "مدخل إلى الروبوتية/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#bd328b"
    },
    {
        "id": 120,
        "code": "مدخل إلى الروبوتية/عملي ف2",
        "name": "مدخل إلى الروبوتية/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#42d7e5"
    },
    {
        "id": 121,
        "code": "الكيمياء الحيوية/عملي",
        "name": "الكيمياء الحيوية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "أيمن هدبة",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#b51953"
    },
    {
        "id": 122,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش4",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-01",
        "color": "#590560"
    },
    {
        "id": 123,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش3",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-01",
        "color": "#a68e0d"
    },
    {
        "id": 124,
        "code": "مدخل إلى تعلم الآلة/ش2",
        "name": "مدخل إلى تعلم الآلة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-01",
        "color": "#c86189"
    },
    {
        "id": 125,
        "code": "هندسة البره ات المتقدمة",
        "name": "هندسة البره ات المتقدمة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-01",
        "color": "#33b4dc"
    },
    {
        "id": 126,
        "code": "مدخل إلى تعلم الآلة/ش1",
        "name": "مدخل إلى تعلم الآلة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-02",
        "color": "#7e78c5"
    },
    {
        "id": 127,
        "code": "جوانب عملية في تعلم الآلة والتعلّم العميق/عملي",
        "name": "جوانب عملية في تعلم الآلة والتعلّم العميق/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#c0a115"
    },
    {
        "id": 128,
        "code": "معالجة اللغات الطبيعية/عملي",
        "name": "معالجة اللغات الطبيعية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#b48b77"
    },
    {
        "id": 129,
        "code": "الذكاء العملي/عملي",
        "name": "الذكاء العملي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#8fd03a"
    },
    {
        "id": 130,
        "code": "معالجة اللغات الطبيعية",
        "name": "معالجة اللغات الطبيعية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبيي",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-03",
        "color": "#c08bb6"
    },
    {
        "id": 131,
        "code": "البرمجة بلغة بايثون/ش4",
        "name": "البرمجة بلغة بايثون/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-03",
        "color": "#d39c8c"
    },
        {
        "id": 132,
        "code": "البرمجة بلغة بايثون/ش5",
        "name": "البرمجة بلغة بايثون/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-03",
        "color": "#dd5b79"
    },
    {
        "id": 133,
        "code": "هندسة البرمجيات",
        "name": "هندسة البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-03",
        "color": "#c28d23"
    },
    {
        "id": 134,
        "code": "نظرية الحوسبة/ش1",
        "name": "نظرية الحوسبة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-04",
        "color": "#cfa9dc"
    },
    {
        "id": 135,
        "code": "مدخل إلى هندسة البرمجيات/ش1",
        "name": "مدخل إلى هندسة البرمجيات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-04",
        "color": "#a22c29"
    },
    {
        "id": 136,
        "code": "مدخل إلى هندسة البرمجيات/ش2",
        "name": "مدخل إلى هندسة البرمجيات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-04",
        "color": "#527f68"
    },
    {
        "id": 137,
        "code": "مدخل إلى الذكاء الصنعي/ش1",
        "name": "مدخل إلى الذكاء الصنعي/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-05",
        "color": "#6b2ba2"
    },
    {
        "id": 138,
        "code": "مدخل إلى الذكاء",
        "name": "مدخل إلى الذكاء",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-05",
        "color": "#bcf662"
    },
    {
        "id": 139,
        "code": "مدخل إلى التعلم العميق/عملي",
        "name": "مدخل إلى التعلم العميق/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#68e55e"
    },
    {
        "id": 140,
        "code": "الاتصالات النقالة واللاسلكية/ش1",
        "name": "الاتصالات النقالة واللاسلكية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-05",
        "color": "#56bf77"
    },
    {
        "id": 141,
        "code": "كشف التطفل وإدارة الاختراقات",
        "name": "كشف التطفل وإدارة الاختراقات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-06",
        "color": "#cf02ce"
    },
    {
        "id": 142,
        "code": "أمن نظم التشغيل/ش1",
        "name": "أمن نظم التشغيل/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-06",
        "color": "#b04b6d"
    },
    {
        "id": 143,
        "code": "برمجة التطبيقات الشبكية/عملي ف1",
        "name": "برمجة التطبيقات الشبكية/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. فواز عفاش",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-06",
        "color": "#5b9a86"
    },
    {
        "id": 144,
        "code": "برمجة التطبيقات الشبكية/عملي ف2",
        "name": "برمجة التطبيقات الشبكية/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. فواز عفاش",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-06",
        "color": "#be438d"
    },
    {
        "id": 145,
        "code": "نظم التشغيل1/ش2",
        "name": "نظم التشغيل1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-07",
        "color": "#a7eeee"
    },
    {
        "id": 146,
        "code": "النظم الموزعة والحوسبة السحابية/ش2",
        "name": "النظم الموزعة والحوسبة السحابية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-07",
        "color": "#a530da"
    },
    {
        "id": 147,
        "code": "نظم التشغيل1/ش 3",
        "name": "نظم التشغيل1/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-07",
        "color": "#a1989d"
    },
    {
        "id": 148,
        "code": "الخوارزميات وبنى المعطيات/ش3",
        "name": "الخوارزميات وبنى المعطيات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. سعيد دياب",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-08",
        "color": "#c98266"
    },
    {
        "id": 149,
        "code": "الخوارزميات وبنى المعطيات/ش4",
        "name": "الخوارزميات وبنى المعطيات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. سعيد دياب",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-08",
        "color": "#781be1"
    },
    {
        "id": 150,
        "code": "الخوارزميات وبنى المعطيات/ش5",
        "name": "الخوارزميات وبنى المعطيات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. سعيد دياب",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#5b77ea"
    },
    {
        "id": 151,
        "code": "المعادلات التفاضلية والتحويلات/ش1",
        "name": "المعادلات التفاضلية والتحويلات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-09",
        "color": "#3ae3df"
    },
    {
        "id": 152,
        "code": "المعادلات التفاضلية والتحويلات/ش2",
        "name": "المعادلات التفاضلية والتحويلات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-09",
        "color": "#86ee1f"
    },
    {
        "id": 153,
        "code": "تراسل البيانات/ش1",
        "name": "تراسل البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#917afe"
    },
    {
        "id": 154,
        "code": "التحليل الرياضي1/ش1",
        "name": "التحليل الرياضي1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-10",
        "color": "#d5281d"
    },
    {
        "id": 155,
        "code": "التحليل الرياضي 1/ش 2",
        "name": "التحليل الرياضي 1/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#c033b5"
    },
    {
        "id": 156,
        "code": "التحليل الرياضي 2/ش2",
        "name": "التحليل الرياضي 2/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#9b0f3d"
    },
    {
        "id": 157,
        "code": "الروبوتية النقالة",
        "name": "الروبوتية النقالة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-11",
        "color": "#be7bf2"
    },
    {
        "id": 158,
        "code": "النظم الروبوتية",
        "name": "النظم الروبوتية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-11",
        "color": "#5a9e74"
    },
    {
        "id": 159,
        "code": "أمن نظم قواعد البيانات/ش1",
        "name": "أمن نظم قواعد البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-11",
        "color": "#37d13f"
    },
    {
        "id": 160,
        "code": "نظم المعلومات الإدارية//ش1",
        "name": "نظم المعلومات الإدارية//ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-11",
        "color": "#6269eb"
    },
    {
        "id": 161,
        "code": "نظم قواعد البيانات/ش1",
        "name": "نظم قواعد البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-12",
        "color": "#37e313"
    },
    {
        "id": 162,
        "code": "نظم قواعد البيانات/ش2",
        "name": "نظم قواعد البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-12",
        "color": "#90aafe"
    },
    {
        "id": 163,
        "code": "أسس نظم الاتصالات",
        "name": "أسس نظم الاتصالات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-12",
        "color": "#a14bec"
    },
    {
        "id": 164,
        "code": "هندسة الأمواج المكروية",
        "name": "هندسة الأمواج المكروية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل / م.يزن أبو رافع",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-12",
        "color": "#570179"
    },
    {
        "id": 165,
        "code": "قواعد البيانات المتقدمة/رش1",
        "name": "قواعد البيانات المتقدمة/رش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-13",
        "color": "#47379f"
    },
    {
        "id": 166,
        "code": "إدارة الشبكات الحاسوبية",
        "name": "إدارة الشبكات الحاسوبية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-13",
        "color": "#9ccce9"
    },
    {
        "id": 167,
        "code": "بروتوكولات الشبكات الحاسوبية",
        "name": "بروتوكولات الشبكات الحاسوبية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-13",
        "color": "#c26082"
    },
    {
        "id": 168,
        "code": "الفيزياء1/ش 2",
        "name": "الفيزياء1/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-14",
        "color": "#5cb77a"
    },
    {
        "id": 169,
        "code": "الإنكليزية للمهندسين/ش1",
        "name": "الإنكليزية للمهندسين/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-14",
        "color": "#d192c0"
    },
    {
        "id": 170,
        "code": "الفيزياء 2/ش 1",
        "name": "الفيزياء 2/ش 1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-14",
        "color": "#92ab71"
    },
    {
        "id": 171,
        "code": "الفيزياء 1/ش 1",
        "name": "الفيزياء 1/ش 1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-14",
        "color": "#399840"
    },
    {
        "id": 172,
        "code": "نماذج نضج البرمجيات",
        "name": "نماذج نضج البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-15",
        "color": "#74a60a"
    },
    {
        "id": 173,
        "code": "البرمجة1/ش1",
        "name": "البرمجة1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية يجب",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-15",
        "color": "#c1644d"
    },
    {
        "id": 174,
        "code": "نظم الزمن الحقيقي",
        "name": "نظم الزمن الحقيقي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-16",
        "color": "#b2a9ab"
    },
    {
        "id": 175,
        "code": "نظم از الحقيقي/عملي",
        "name": "نظم از الحقيقي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. يزن أب رافع",
        "day": "الأحد",
        "time": "09:40 - 10:30",
        "room": "AI-16",
        "color": "#5a6850"
    },
    {
        "id": 176,
        "code": "التحليل الرياضي 2/ش1",
        "name": "التحليل الرياضي 2/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-16",
        "color": "#7ebf99"
    },
    {
        "id": 177,
        "code": "الجبر الخطي ونظرية المصفوفات/ش4",
        "name": "الجبر الخطي ونظرية المصفوفات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-16",
        "color": "#6e4d4a"
    },
    {
        "id": 178,
        "code": "الرياضيات المتقطعة/ش5",
        "name": "الرياضيات المتقطعة/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-17",
        "color": "#7f3e22"
    },
    {
        "id": 179,
        "code": "بنيان الحواسيب 2/ش4",
        "name": "بنيان الحواسيب 2/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-17",
        "color": "#b39c5f"
    },
    {
        "id": 180,
        "code": "الرياضيات (الفيزياء) الترميمية/عملي ف5",
        "name": "الرياضيات (الفيزياء) الترميمية/عملي ف5",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-17",
        "color": "#902129"
    },
        {
        "id": 181,
        "code": "إدارة المشاريع/رش1",
        "name": "إدارة المشاريع/رش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-18",
        "color": "#c652cf"
    },
    {
        "id": 182,
        "code": "أمن الشبكات",
        "name": "أمن الشبكات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-18",
        "color": "#953fa7"
    },
    {
        "id": 183,
        "code": "إدارة المشاريع//ش2",
        "name": "إدارة المشاريع//ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-18",
        "color": "#9153b1"
    },
    {
        "id": 184,
        "code": "نظم الوسائط المتعددة",
        "name": "نظم الوسائط المتعددة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-18",
        "color": "#3bd167"
    },
    {
        "id": 185,
        "code": "تصميم الدارات ذات التكامل الوسيع النطاق",
        "name": "تصميم الدارات ذات التكامل الوسيع النطاق",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-SEC-1",
        "color": "#6b27ac"
    },
    {
        "id": 186,
        "code": "تصميم الدارات ذات التكامل الوسيع النطاق/عملي",
        "name": "تصميم الدارات ذات التكامل الوسيع النطاق/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-SEC-1",
        "color": "#6ede3f"
    },
    {
        "id": 187,
        "code": "نظم التشغيل الموزعة",
        "name": "نظم التشغيل الموزعة",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-SEC-1",
        "color": "#a7f32d"
    },
    {
        "id": 188,
        "code": "تقانات الاتصالات الحديثة",
        "name": "تقانات الاتصالات الحديثة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحماتي",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-SEC-1",
        "color": "#a14e21"
    },
    {
        "id": 189,
        "code": "الميكانيك النظري",
        "name": "الميكانيك النظري",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-ACN-1",
        "color": "#5b8bcb"
    },
    {
        "id": 190,
        "code": "الميكانيك النظري/عملي",
        "name": "الميكانيك النظري/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-ACN-1",
        "color": "#916b38"
    },
    {
        "id": 191,
        "code": "الميكانيك والآلات",
        "name": "الميكانيك والآلات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-ACN-1",
        "color": "#b5ce3f"
    },
    {
        "id": 192,
        "code": "الميكانيك والآلات/عملي",
        "name": "الميكانيك والآلات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-ACN-1",
        "color": "#6eb75a"
    },
    {
        "id": 193,
        "code": "الإرمجة بلغة بايثون/ عملي ف15",
        "name": "الإرمجة بلغة بايثون/ عملي ف15",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#cf1d89"
    },
    {
        "id": 194,
        "code": "البرمجة بلغة بايثون/ عملي ف25",
        "name": "البرمجة بلغة بايثون/ عملي ف25",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#bb98bf"
    },
    {
        "id": 195,
        "code": "تطوير تطبيقات الموبايل/عملي",
        "name": "تطوير تطبيقات الموبايل/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. هديل عسراوي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#616bc8"
    },
    {
        "id": 196,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي قديم ف1",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي قديم ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية رجب / م. هديل عسراوي",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#dcec74"
    },
    {
        "id": 197,
        "code": "البرمجة1/عملي ف11",
        "name": "البرمجة1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هبة ريمان",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#c9d428"
    },
    {
        "id": 198,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف14",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هبة ريمان",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#ccdef1"
    },
    {
        "id": 199,
        "code": "مدخل إلى ات والبرمجة/عملي ف13",
        "name": "مدخل إلى ات والبرمجة/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#a9e1a7"
    },
    {
        "id": 200,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف23",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#57d03c"
    },
    {
        "id": 201,
        "code": "بنيان الحواسيب2/عملي ف11",
        "name": "بنيان الحواسيب2/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#3a386c"
    },
    {
        "id": 202,
        "code": "بنيان الحواسيب2/عملي ف21",
        "name": "بنيان الحواسيب2/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#c44215"
    },
    {
        "id": 203,
        "code": "أمن نظم قواعد البيانات/ عملي ف12",
        "name": "أمن نظم قواعد البيانات/ عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. فرح فارس",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#77b532"
    },
    {
        "id": 204,
        "code": "أمن نظم قواعد البيانات/عملي ف22",
        "name": "أمن نظم قواعد البيانات/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمد الشايطة / م. فرح فارس",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#830cf9"
    },
    {
        "id": 205,
        "code": "شبكات الحاسوب/عملي ف11",
        "name": "شبكات الحاسوب/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فواز عفاش",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#a5677b"
    },
    {
        "id": 206,
        "code": "شبكات الحاسوب/عملي ف21",
        "name": "شبكات الحاسوب/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فواز عفاش",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#8517d6"
    },
    {
        "id": 207,
        "code": "شبكات الحاسوب/عملي ف12",
        "name": "شبكات الحاسوب/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. نغم الأشقر",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#b2f0c3"
    },
    {
        "id": 208,
        "code": "شبكات الحاسوب/عملي ف22",
        "name": "شبكات الحاسوب/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. نغم الأشقر",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#b6b9e1"
    },
    {
        "id": 209,
        "code": "أمن الاتصالات/عملي",
        "name": "أمن الاتصالات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / نغم الأشقر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#44c75a"
    },
    {
        "id": 210,
        "code": "البرمجة1/عملي ف21",
        "name": "البرمجة1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية رجب / م. هديل عسراوي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#94b27d"
    },
    {
        "id": 211,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف13",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#aa8fc0"
    },
    {
        "id": 212,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف23",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#a19fa2"
    },
    {
        "id": 213,
        "code": "قواعد البيانات المتقدمة/عملي ف11",
        "name": "قواعد البيانات المتقدمة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. زينب بغدادي",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#b6be96"
    },
    {
        "id": 214,
        "code": "قواعد البيانات المتقدمة/عملي ف21",
        "name": "قواعد البيانات المتقدمة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. زينب بغدادي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#66272b"
    },
    {
        "id": 215,
        "code": "قواعد البيانات المتقدمة/عملي ف12",
        "name": "قواعد البيانات المتقدمة/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#a86efb"
    },
    {
        "id": 216,
        "code": "قواعد البيانات المتقدمة/عملي ف22",
        "name": "قواعد البيانات المتقدمة/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#3d90b0"
    },
    {
        "id": 217,
        "code": "نظم التشغيل2/عملي ف1",
        "name": "نظم التشغيل2/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. جعفر محفوض",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#7c2b9d"
    },
    {
        "id": 218,
        "code": "نظم التشغيل2/عملي ف2",
        "name": "نظم التشغيل2/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. جعفر محفوض",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#56cfa8"
    },
    {
        "id": 219,
        "code": "التعمية التطبيقية/عمار",
        "name": "التعمية التطبيقية/عمار",
        "type": "lab",
        "credits": 0,
        "instructor": "د. نبيل القادري / م. جعفر محفوض",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#39b460"
    },
    {
        "id": 220,
        "code": "أساسيات أمن الحواسيب/عملي ف12",
        "name": "أساسيات أمن الحواسيب/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#a830ba"
    },
    {
        "id": 221,
        "code": "برمجة نظم التشغيل (برمجة النظم)/عملي ف11",
        "name": "برمجة نظم التشغيل (برمجة النظم)/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#7ade65"
    },
    {
        "id": 222,
        "code": "برمجة نظم التشغيل (برمجة النظم)/عملي ف21",
        "name": "برمجة نظم التشغيل (برمجة النظم)/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#be3f03"
    },
    {
        "id": 223,
        "code": "نظم التشغيل1/عملي ف13",
        "name": "نظم التشغيل1/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. موفق العضل",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#7df37e"
    },
    {
        "id": 224,
        "code": "نظم التشغيل1/عملي ف23",
        "name": "نظم التشغيل1/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. موفق العضل",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#da6395"
    },
    {
        "id": 225,
        "code": "البرمجة بلغة بايثون/عملي ف13",
        "name": "البرمجة بلغة بايثون/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي / م. الحسين طفيلية",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#cae368"
    },
    {
        "id": 226,
        "code": "البرمجة بلغة بايثون/ عملي ف23",
        "name": "البرمجة بلغة بايثون/ عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د. آصف جعفر / م.الحسير ر طفيلية التر مجة بلغة بايثون / عملي ف14",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#dd5d59"
    },
    {
        "id": 227,
        "code": "البرمجة بلغة بايثون/عملي ف14",
        "name": "البرمجة بلغة بايثون/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. زينب بغدادي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#d24509"
    },
    {
        "id": 228,
        "code": "البرمجة بلغة بايثون/عملي ف24",
        "name": "البرمجة بلغة بايثون/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. زينب بغدادي",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#a60a2f"
    },
    {
        "id": 229,
        "code": "الدارات المنطقية/عملي ف11",
        "name": "الدارات المنطقية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ELC",
        "color": "#7dd835"
    },
    {
        "id": 230,
        "code": "الدارات المنطقية/عملي ف21",
        "name": "الدارات المنطقية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ELC",
        "color": "#994d48"
    },
    {
        "id": 231,
        "code": "الدارات المنطقية/عملي ف12",
        "name": "الدارات المنطقية/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م.لجير ر أسعد",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ELC",
        "color": "#612fe3"
    },
    {
        "id": 232,
        "code": "الدارات المنطقية/عملي ف22",
        "name": "الدارات المنطقية/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م.لجير ر أسعد",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ELC",
        "color": "#d1cd14"
    },
    {
        "id": 233,
        "code": "مدخل إلى اإللكتر ونيات/عملي ف1",
        "name": "مدخل إلى اإللكتر ونيات/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-AT",
        "color": "#bc7a2e"
    },
    {
        "id": 234,
        "code": "الدارات اإللكتر ونية1 /عملي ف2",
        "name": "الدارات اإللكتر ونية1 /عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#aeac19"
    },
    {
        "id": 235,
        "code": "مدخل إلى الإلكترونيات/عملي ف2",
        "name": "مدخل إلى الإلكترونيات/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-AT",
        "color": "#76a6cb"
    },
    {
        "id": 236,
        "code": "بنيان الحواسيب1 /عملي ف13",
        "name": "بنيان الحواسيب1 /عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-CA",
        "color": "#3bef5b"
    },
    {
        "id": 237,
        "code": "بنيان الحواسيب1 /عملي ف23",
        "name": "بنيان الحواسيب1 /عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-CA",
        "color": "#bbdd19"
    },
    {
        "id": 238,
        "code": "نظرية التحكم/عملي",
        "name": "نظرية التحكم/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#9c2d14"
    },
    {
        "id": 239,
        "code": "الحساسات والتحسس/عملي",
        "name": "الحساسات والتحسس/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب / م. الحسين طفيلية",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#aad042"
    },
    {
        "id": 240,
        "code": "الحساسات والتحسس/عملي",
        "name": "الحساسات والتحسس/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب / م. الحسين طفيلية",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ROB",
        "color": "#7805ee"
    },
        {
        "id": 241,
        "code": "المتحكمات الصغرية والنظم المضمنة/عملي ف2",
        "name": "المتحكمات الصغرية والنظم المضمنة/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب / م.الحسير ر طفيلية",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ROB",
        "color": "#bab790"
    },
    {
        "id": 242,
        "code": "الفيزياء1 /عملي ف13",
        "name": "الفيزياء1 /عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#65590c"
    },
    {
        "id": 243,
        "code": "الفيزياء1/عملي ف22",
        "name": "الفيزياء1/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "PE-L2",
        "color": "#8cc442"
    },
    {
        "id": 244,
        "code": "الفيزياء1 /عملي ف23 PE-L2الفيزياء1 /عملي ق-ف1",
        "name": "الفيزياء1 /عملي ف23 PE-L2الفيزياء1 /عملي ق-ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "أ.محمد البيطار",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "PE-L2",
        "color": "#b08a23"
    },
    {
        "id": 245,
        "code": "الفيزياء1 /عملي ف22",
        "name": "الفيزياء1 /عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "أ.محمد البيطار",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "PE-L2",
        "color": "#d89411"
    },
    {
        "id": 246,
        "code": "الفيزياء1/عملي ف1",
        "name": "الفيزياء1/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الأحد",
        "time": "14:40 - 16:20",
        "room": "PE-L2",
        "color": "#60f135"
    },
    {
        "id": 247,
        "code": "الخوارزميات وبنى المعطيات1/ش1",
        "name": "الخوارزميات وبنى المعطيات1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-01",
        "color": "#993711"
    },
    {
        "id": 248,
        "code": "نظرية الحوسبة/ش2",
        "name": "نظرية الحوسبة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-01",
        "color": "#441a7f"
    },
    {
        "id": 249,
        "code": "توثيق بنر البرمجيات",
        "name": "توثيق بنر البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-01",
        "color": "#4b63f8"
    },
    {
        "id": 250,
        "code": "إدارة تشكيلة البرمجيات",
        "name": "إدارة تشكيلة البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مهيب النقري",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#6ff549"
    },
    {
        "id": 251,
        "code": "تطوير تطبيقات الويب",
        "name": "تطوير تطبيقات الويب",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#895e1d"
    },
    {
        "id": 252,
        "code": "الاختراق الأخلاقي والدفاع عن الأنظمة",
        "name": "الاختراق الأخلاقي والدفاع عن الأنظمة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#81494e"
    },
    {
        "id": 253,
        "code": "تقانات إحصائية في علوم البيانات/ش1",
        "name": "تقانات إحصائية في علوم البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-03",
        "color": "#c66342"
    },
    {
        "id": 254,
        "code": "تراسل البيانات/ش 2",
        "name": "تراسل البيانات/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-03",
        "color": "#79a86b"
    },
    {
        "id": 255,
        "code": "تقانات إحصائية في علوم البيانات/ش2",
        "name": "تقانات إحصائية في علوم البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-03",
        "color": "#ba8bf8"
    },
    {
        "id": 256,
        "code": "أمن نظم التشغيل/ش 2",
        "name": "أمن نظم التشغيل/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-04",
        "color": "#694c84"
    },
    {
        "id": 257,
        "code": "أمن نظم قواعد البيانات/ش2",
        "name": "أمن نظم قواعد البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-04",
        "color": "#99ada0"
    },
    {
        "id": 258,
        "code": "النظم الموزعة والحوسبة السحابية/ش3",
        "name": "النظم الموزعة والحوسبة السحابية/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-04",
        "color": "#c753da"
    },
    {
        "id": 259,
        "code": "نظم التشغيل1/ش4",
        "name": "نظم التشغيل1/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-04",
        "color": "#6b5ec1"
    },
    {
        "id": 260,
        "code": "نظرية المعلومات/ش1",
        "name": "نظرية المعلومات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-05",
        "color": "#7e0e33"
    },
    {
        "id": 261,
        "code": "برمجة التطبيقات الشبكية/ش1",
        "name": "برمجة التطبيقات الشبكية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#855ea0"
    },
    {
        "id": 262,
        "code": "نظرية المعلومات/ش2",
        "name": "نظرية المعلومات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-05",
        "color": "#49e2f0"
    },
    {
        "id": 263,
        "code": "بنيان الحواسيب2/ش5",
        "name": "بنيان الحواسيب2/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-06",
        "color": "#a30541"
    },
    {
        "id": 264,
        "code": "مدخل إلى هندسة البرمجيات/ش3",
        "name": "مدخل إلى هندسة البرمجيات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-06",
        "color": "#60dd6b"
    },
    {
        "id": 265,
        "code": "مدخل إلى هندسة البرمجيات/ش4",
        "name": "مدخل إلى هندسة البرمجيات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-06",
        "color": "#4d5dd6"
    },
    {
        "id": 266,
        "code": "نظرية التحكم",
        "name": "نظرية التحكم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-07",
        "color": "#490979"
    },
    {
        "id": 267,
        "code": "نظم التحكم الرقمي",
        "name": "نظم التحكم الرقمي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-07",
        "color": "#b265b4"
    },
    {
        "id": 268,
        "code": "إدارة المؤسسات/ش1",
        "name": "إدارة المؤسسات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-07",
        "color": "#74e21c"
    },
    {
        "id": 269,
        "code": "إدارة المؤسسات/ش2",
        "name": "إدارة المؤسسات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-07",
        "color": "#9d8910"
    },
    {
        "id": 270,
        "code": "الدارات الإلكترونية2",
        "name": "الدارات الإلكترونية2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-08",
        "color": "#d57421"
    },
    {
        "id": 271,
        "code": "الدارات المنطقية/ش2",
        "name": "الدارات المنطقية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-08",
        "color": "#668003"
    },
    {
        "id": 272,
        "code": "التعمية التطبيقية",
        "name": "التعمية التطبيقية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-08",
        "color": "#b08995"
    },
    {
        "id": 273,
        "code": "الرياضيات المتقطعة/ ش1",
        "name": "الرياضيات المتقطعة/ ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#514d3a"
    },
    {
        "id": 274,
        "code": "نظم قواعد البيانات/ش3",
        "name": "نظم قواعد البيانات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-09",
        "color": "#4aa902"
    },
    {
        "id": 275,
        "code": "نظم قواعد البيانات/ش4",
        "name": "نظم قواعد البيانات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-09",
        "color": "#ba22da"
    },
    {
        "id": 276,
        "code": "مهارات التواصل/ش1",
        "name": "مهارات التواصل/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-09",
        "color": "#8c0a70"
    },
    {
        "id": 277,
        "code": "نظم المعلومات الإدارية/ش2",
        "name": "نظم المعلومات الإدارية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#76c71b"
    },
    {
        "id": 278,
        "code": "نظرية الألعاب",
        "name": "نظرية الألعاب",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#bd528d"
    },
    {
        "id": 279,
        "code": "النظم الخبيرة",
        "name": "النظم الخبيرة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#b1bf44"
    },
    {
        "id": 280,
        "code": "إدارة الشبكات الحاسوبية وبروتوكولاتها",
        "name": "إدارة الشبكات الحاسوبية وبروتوكولاتها",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-11",
        "color": "#417a7b"
    },
    {
        "id": 281,
        "code": "شبكات الحاسوب/ش4",
        "name": "شبكات الحاسوب/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-11",
        "color": "#9766af"
    },
    {
        "id": 282,
        "code": "الدارات الكهربائية 1/ش 1",
        "name": "الدارات الكهربائية 1/ش 1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحمد",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-11",
        "color": "#91ec8c"
    },
    {
        "id": 283,
        "code": "الإشارات والنظم",
        "name": "الإشارات والنظم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحمد",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-11",
        "color": "#53c083"
    },
    {
        "id": 284,
        "code": "تصميم المترجمات/ش1",
        "name": "تصميم المترجمات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-12",
        "color": "#a5cf16"
    },
    {
        "id": 285,
        "code": "تصميم المترجمات/ش2",
        "name": "تصميم المترجمات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-12",
        "color": "#7a14d2"
    },
    {
        "id": 286,
        "code": "تصميم المترجمات/ش3",
        "name": "تصميم المترجمات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-12",
        "color": "#a391cc"
    },
    {
        "id": 287,
        "code": "الجبر الخطي ونظرية المصفوفات/ش3",
        "name": "الجبر الخطي ونظرية المصفوفات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-13",
        "color": "#67a468"
    },
    {
        "id": 288,
        "code": "الجبر الخطي ونظرية المصفوفات/قديم ش2",
        "name": "الجبر الخطي ونظرية المصفوفات/قديم ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-13",
        "color": "#5b551b"
    },
    {
        "id": 289,
        "code": "المعادلات التفاضلية والتحويلات/ش3",
        "name": "المعادلات التفاضلية والتحويلات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-14",
        "color": "#bd47d2"
    },
    {
        "id": 290,
        "code": "المعادلات التفاضلية والتحويلات/ش4",
        "name": "المعادلات التفاضلية والتحويلات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-14",
        "color": "#498e54"
    },
    {
        "id": 291,
        "code": "التحليل الرياضي 2/ش3",
        "name": "التحليل الرياضي 2/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. زيذب خضر",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-14",
        "color": "#b4ac6d"
    },
    {
        "id": 292,
        "code": "مدخل إلى الإلكترونيات",
        "name": "مدخل إلى الإلكترونيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-15",
        "color": "#b03112"
    },
    {
        "id": 293,
        "code": "الدارات الإلكترونية1/ش2",
        "name": "الدارات الإلكترونية1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-15",
        "color": "#380582"
    },
    {
        "id": 294,
        "code": "الاتصالات الرقمية",
        "name": "الاتصالات الرقمية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-15",
        "color": "#5f3390"
    },
    {
        "id": 295,
        "code": "البرمجة2/ش1",
        "name": "البرمجة2/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية ربجب",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-16",
        "color": "#a8a5ab"
    },
    {
        "id": 296,
        "code": "البرمجة 2 /ش 2",
        "name": "البرمجة 2 /ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية ربجب",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-16",
        "color": "#be11cb"
    },
    {
        "id": 297,
        "code": "الفيزياء 1 4",
        "name": "الفيزياء 1 4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-16",
        "color": "#3de599"
    },
    {
        "id": 298,
        "code": "الفيزياء1/ش 3",
        "name": "الفيزياء1/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-16",
        "color": "#b7eb94"
    },
    {
        "id": 299,
        "code": "بنيان الحواسيب1/ش1",
        "name": "بنيان الحواسيب1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. هبة الله الخضور",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-17",
        "color": "#bf75ec"
    },
    {
        "id": 300,
        "code": "بنيان الحواسيب1/ش2",
        "name": "بنيان الحواسيب1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. هبة الله الخضور",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-17",
        "color": "#aea4c6"
    },
        {
        "id": 301,
        "code": "التحليل الرياضي1/ش4",
        "name": "التحليل الرياضي1/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-18",
        "color": "#7aa679"
    },
    {
        "id": 302,
        "code": "التحليل الرياضي1/ه-ش1",
        "name": "التحليل الرياضي1/ه-ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عبد الرزاق الفاضل",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-18",
        "color": "#4b899f"
    },
    {
        "id": 303,
        "code": "الاتصالات النقالة واللاسلكية/ش2",
        "name": "الاتصالات النقالة واللاسلكية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-18",
        "color": "#4cfeed"
    },
    {
        "id": 304,
        "code": "الاتصالات الضوئية",
        "name": "الاتصالات الضوئية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "الاثنين",
        "time": "09:40 - 12:10",
        "room": "AI-SEC-1",
        "color": "#afc0d5"
    },
    {
        "id": 305,
        "code": "أسس هندسة الرادار",
        "name": "أسس هندسة الرادار",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-ACN-1",
        "color": "#3ba07c"
    },
    {
        "id": 306,
        "code": "الدارات والنظم المكروية",
        "name": "الدارات والنظم المكروية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-ACN-1",
        "color": "#9ddf76"
    },
    {
        "id": 307,
        "code": "نظرية الحقول الكهرطيسية",
        "name": "نظرية الحقول الكهرطيسية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-ACN-1",
        "color": "#5305fb"
    },
    {
        "id": 308,
        "code": "نظم قواعد البيانات/عملي ف11",
        "name": "نظم قواعد البيانات/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م.عبد الرحمن عبد الرحمن / م.فرح فارس نظم قواعد البيانات / عملي ف21",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#90afe0"
    },
    {
        "id": 309,
        "code": "نظم قواعد البيانات/عملي ف21",
        "name": "نظم قواعد البيانات/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م.عبد الرحمن عبد الرحمن / م.فرح فارس",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#396178"
    },
    {
        "id": 310,
        "code": "النظم الموزعة والحوسبة السحابية/عملي ف12",
        "name": "النظم الموزعة والحوسبة السحابية/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#c51e22"
    },
    {
        "id": 311,
        "code": "ل النظم الموزعة والحوسبة السحابية/عملي ف22",
        "name": "ل النظم الموزعة والحوسبة السحابية/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#33d21a"
    },
    {
        "id": 312,
        "code": "معالجة الصور وتحليلها/عملي ف11",
        "name": "معالجة الصور وتحليلها/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#cfa137"
    },
    {
        "id": 313,
        "code": "معالجة الصور وتحليلها/عملي ف21",
        "name": "معالجة الصور وتحليلها/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. بغدادي",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#7ac126"
    },
    {
        "id": 314,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف11",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#72b6d0"
    },
    {
        "id": 315,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف21",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#68af9d"
    },
    {
        "id": 316,
        "code": "بنيان الحواسيب2/عملي ف12",
        "name": "بنيان الحواسيب2/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#bcda8d"
    },
    {
        "id": 317,
        "code": "بنيان الحواسيب2/عملي ف22",
        "name": "بنيان الحواسيب2/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#8416aa"
    },
    {
        "id": 318,
        "code": "بنيان الحواسيب2/عملي ف13",
        "name": "بنيان الحواسيب2/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#8cbb66"
    },
    {
        "id": 319,
        "code": "بنيان الحواسيب2/عملي ف23",
        "name": "بنيان الحواسيب2/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#976d5c"
    },
    {
        "id": 320,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف22",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فواز عفاش",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#a39abb"
    },
    {
        "id": 321,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف21",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فواز عفاش",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#49ddd9"
    },
    {
        "id": 322,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف12",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فرح فارس",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#d231b6"
    },
    {
        "id": 323,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف24",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فرح فارس",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#9a45f8"
    },
    {
        "id": 324,
        "code": "شبكات الحاسوب/عملي ف13",
        "name": "شبكات الحاسوب/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضز",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#7dd12a"
    },
    {
        "id": 325,
        "code": "شبكات الحاسوب/عملي ف23",
        "name": "شبكات الحاسوب/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضل",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#d5c33d"
    },
    {
        "id": 326,
        "code": "شبكات الحاسوب/عملي ف14",
        "name": "شبكات الحاسوب/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضل",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#34d5e2"
    },
    {
        "id": 327,
        "code": "شبكات الحاسوب/عملي ف24",
        "name": "شبكات الحاسوب/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضل",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#472f9c"
    },
    {
        "id": 328,
        "code": "مدخل إلى البيانات الكبيرة/عملي ف11",
        "name": "مدخل إلى البيانات الكبيرة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#410f59"
    },
    {
        "id": 329,
        "code": "مدخل إلى البيانات الكبيرة/عملي ف21",
        "name": "مدخل إلى البيانات الكبيرة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#4bcf71"
    },
    {
        "id": 330,
        "code": "نظم قواعد البيانات/عملي ف12",
        "name": "نظم قواعد البيانات/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#56d3e4"
    },
    {
        "id": 331,
        "code": "نظم قواعد البيانات/عملي ف22",
        "name": "نظم قواعد البيانات/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#b37d77"
    },
    {
        "id": 332,
        "code": "كشف التطفل وإدارة /عملي ف11",
        "name": "كشف التطفل وإدارة /عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#ce4aba"
    },
    {
        "id": 333,
        "code": "كشف التطفل وإدارة الإختراقات/عملي ف21",
        "name": "كشف التطفل وإدارة الإختراقات/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم األشقر",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#db2848"
    },
    {
        "id": 334,
        "code": "أمن الشبكات والأمن السيبراني/ عملي",
        "name": "أمن الشبكات والأمن السيبراني/ عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#54b879"
    },
    {
        "id": 335,
        "code": "أمن الشبكات/عملي",
        "name": "أمن الشبكات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#3e5b91"
    },
    {
        "id": 336,
        "code": "نظم التشغيل1/عملي ف14",
        "name": "نظم التشغيل1/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#62a5f1"
    },
    {
        "id": 337,
        "code": "نظم التشغيل1/عملي ف24",
        "name": "نظم التشغيل1/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#3ccfe2"
    },
    {
        "id": 338,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف14",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#92d3ed"
    },
    {
        "id": 339,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف24",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#701619"
    },
    {
        "id": 340,
        "code": "مدخل إلى تعلم الآلة/عملي ف11",
        "name": "مدخل إلى تعلم الآلة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#658c4f"
    },
    {
        "id": 341,
        "code": "مدخل إلى تعلم الآلة/عملي ف21",
        "name": "مدخل إلى تعلم الآلة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#4d64af"
    },
    {
        "id": 342,
        "code": "مدخل إلى تعلم الآلة/عملي ف12",
        "name": "مدخل إلى تعلم الآلة/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#918d75"
    },
    {
        "id": 343,
        "code": "مدخل إلى تعلم الآلة/عملي ف22",
        "name": "مدخل إلى تعلم الآلة/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#553814"
    },
    {
        "id": 344,
        "code": "الدارات المنطقية/عملي ف13",
        "name": "الدارات المنطقية/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ELC",
        "color": "#7b4993"
    },
    {
        "id": 345,
        "code": "الدارات المنطقية/عملي ف23",
        "name": "الدارات المنطقية/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ELC",
        "color": "#83730a"
    },
    {
        "id": 346,
        "code": "الدارات الإلكترونية2/ف1",
        "name": "الدارات الإلكترونية2/ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#a08307"
    },
    {
        "id": 347,
        "code": "الدارات الإلكترونية2/ف2",
        "name": "الدارات الإلكترونية2/ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-AT",
        "color": "#ba87ad"
    },
    {
        "id": 348,
        "code": "الاتصالات الرقمية/عملي",
        "name": "الاتصالات الرقمية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-AT",
        "color": "#c42279"
    },
    {
        "id": 349,
        "code": "بنيان الحواسيب1/عملي ف14",
        "name": "بنيان الحواسيب1/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-CA",
        "color": "#b0125e"
    },
    {
        "id": 350,
        "code": "بنيان الحواسيب1/عملي ف24 لله الخضور/ م. محسن سكر",
        "name": "بنيان الحواسيب1/عملي ف24 لله الخضور/ م. محسن سكر",
        "type": "lab",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور / م.محسن سكر",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-CA",
        "color": "#4df3ab"
    },
    {
        "id": 351,
        "code": "المتحكمات المنطقية القابلة للبرمجة/عملي",
        "name": "المتحكمات المنطقية القابلة للبرمجة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#50f04a"
    },
    {
        "id": 352,
        "code": "النظم الروبوتية/عملي",
        "name": "النظم الروبوتية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#67405c"
    },
    {
        "id": 353,
        "code": "الروبوتية النقالة/عملي",
        "name": "الروبوتية النقالة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-ROB",
        "color": "#b1bf3f"
    },
    {
        "id": 354,
        "code": "الفيزياء2/عملي ف12",
        "name": "الفيزياء2/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#d94582"
    },
    {
        "id": 355,
        "code": "الفيزياء1/عملي ف11",
        "name": "الفيزياء1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "PE-L2",
        "color": "#8777cb"
    },
    {
        "id": 356,
        "code": "الفيزياء 2/ عملي ف11",
        "name": "الفيزياء 2/ عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "PE-L2",
        "color": "#bb738d"
    },
    {
        "id": 357,
        "code": "الفيزياء1/عملي ف14",
        "name": "الفيزياء1/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "PE-L2",
        "color": "#70e926"
    },
    {
        "id": 358,
        "code": "الفيزياء.1/عملي ق-ف2",
        "name": "الفيزياء.1/عملي ق-ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الاثنين",
        "time": "14:40 - 16:20",
        "room": "PE-L2",
        "color": "#55ff7f"
    },
    {
        "id": 359,
        "code": "إدارة المخاطر والامتثال",
        "name": "إدارة المخاطر والامتثال",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-01",
        "color": "#9e50d3"
    },
    {
        "id": 360,
        "code": "الرياضيات المتقطعة/قديم ش1",
        "name": "الرياضيات المتقطعة/قديم ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الثلاثاء",
        "time": "09:40 - 12:10",
        "room": "AI-01",
        "color": "#7d2ba3"
    },
        {
        "id": 361,
        "code": "الرياضيات المتقطعة/قديم ش2",
        "name": "الرياضيات المتقطعة/قديم ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الثلاثاء",
        "time": "12:10 - 14:40",
        "room": "AI-01",
        "color": "#4e0e49"
    },
    {
        "id": 362,
        "code": "جوانب عملية في تعلم الآلة والتعلّم العميق",
        "name": "جوانب عملية في تعلم الآلة والتعلّم العميق",
        "type": "lab",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-02",
        "color": "#5d0b27"
    },
    {
        "id": 363,
        "code": "الشبكات اللاسلكية",
        "name": "الشبكات اللاسلكية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#39c328"
    },
    {
        "id": 364,
        "code": "الذكاء الصنعي المتقدم",
        "name": "الذكاء الصنعي المتقدم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#696f10"
    },
    {
        "id": 365,
        "code": "الذكاء الصنعي المتقدم/عملي",
        "name": "الذكاء الصنعي المتقدم/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#9bedb3"
    },
    {
        "id": 366,
        "code": "مدخل إلى الروبوتية",
        "name": "مدخل إلى الروبوتية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-03",
        "color": "#c9d51a"
    },
    {
        "id": 367,
        "code": "الفيزياء1/قديم",
        "name": "الفيزياء1/قديم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-03",
        "color": "#ce7dbd"
    },
    {
        "id": 368,
        "code": "المتحكمات الصغرية والنظم المضمنة/ش1",
        "name": "المتحكمات الصغرية والنظم المضمنة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-03",
        "color": "#7ad25d"
    },
    {
        "id": 369,
        "code": "المتحكمات الصغرية والنظم المضمنة/ش2",
        "name": "المتحكمات الصغرية والنظم المضمنة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-03",
        "color": "#d6e66f"
    },
    {
        "id": 370,
        "code": "قواعد البيانات المتقدمة//ش2",
        "name": "قواعد البيانات المتقدمة//ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-04",
        "color": "#6ac277"
    },
    {
        "id": 371,
        "code": "مدخل إلى البيانات الكبيرة‏",
        "name": "مدخل إلى البيانات الكبيرة‏",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-04",
        "color": "#805764"
    },
    {
        "id": 372,
        "code": "أساسيات قواعد البيانات/ش5",
        "name": "أساسيات قواعد البيانات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-04",
        "color": "#35609a"
    },
    {
        "id": 373,
        "code": "أساسيات قواعد البيانات/ش6",
        "name": "أساسيات قواعد البيانات/ش6",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-04",
        "color": "#cfd556"
    },
    {
        "id": 374,
        "code": "برمجة التطبيقات الشبكية/ش2",
        "name": "برمجة التطبيقات الشبكية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-05",
        "color": "#4236f6"
    },
    {
        "id": 375,
        "code": "برمجة التطبيقات الشبكية/ش3",
        "name": "برمجة التطبيقات الشبكية/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-05",
        "color": "#db6f51"
    },
    {
        "id": 376,
        "code": "أمن نظم المعلومات",
        "name": "أمن نظم المعلومات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#540738"
    },
    {
        "id": 377,
        "code": "نظرية المعلومات/ش3",
        "name": "نظرية المعلومات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-05",
        "color": "#6b5915"
    },
    {
        "id": 378,
        "code": "البرمجة3/ش1",
        "name": "البرمجة3/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-06",
        "color": "#b6fa04"
    },
    {
        "id": 379,
        "code": "البرمجة3/ش 2",
        "name": "البرمجة3/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-06",
        "color": "#6e556f"
    },
    {
        "id": 380,
        "code": "البرمجة3/ش3",
        "name": "البرمجة3/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-06",
        "color": "#36a287"
    },
    {
        "id": 381,
        "code": "البرمجة3/ش4",
        "name": "البرمجة3/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-06",
        "color": "#3af8f0"
    },
    {
        "id": 382,
        "code": "ضمان جودة البرمجيات",
        "name": "ضمان جودة البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية ربجب",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-07",
        "color": "#7d417d"
    },
    {
        "id": 383,
        "code": "مدخل إلى هندسة البرمجيات/ش5",
        "name": "مدخل إلى هندسة البرمجيات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-07",
        "color": "#46934f"
    },
    {
        "id": 384,
        "code": "التطوير الرشيق للبرمجيات",
        "name": "التطوير الرشيق للبرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-07",
        "color": "#da2c9e"
    },
    {
        "id": 385,
        "code": "التحليل الرياضي 2/ش 4",
        "name": "التحليل الرياضي 2/ش 4",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-08",
        "color": "#4fa7ca"
    },
    {
        "id": 386,
        "code": "نظرية الحوسبة/ش 3",
        "name": "نظرية الحوسبة/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-08",
        "color": "#393da7"
    },
    {
        "id": 387,
        "code": "التحليل الرياضي 2/ش 5",
        "name": "التحليل الرياضي 2/ش 5",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#84925b"
    },
    {
        "id": 388,
        "code": "الرياضيات المتقطعة/ش3",
        "name": "الرياضيات المتقطعة/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. يحيى قطيش",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-09",
        "color": "#52351c"
    },
    {
        "id": 389,
        "code": "الرياضيات المتقطعة/ ش4",
        "name": "الرياضيات المتقطعة/ ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د.يحنر قطيش",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-09",
        "color": "#3725ba"
    },
    {
        "id": 390,
        "code": "الرياضيات المتقطعة/ ش2",
        "name": "الرياضيات المتقطعة/ ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د.يحنر قطيش",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#7fddfa"
    },
    {
        "id": 391,
        "code": "المعادلات التفاضلية والتحويلات/ش5",
        "name": "المعادلات التفاضلية والتحويلات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. رائد الرفاعي",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-10",
        "color": "#4f47a4"
    },
    {
        "id": 392,
        "code": "التحليل الرياضي 1/ش 3",
        "name": "التحليل الرياضي 1/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#5a6948"
    },
    {
        "id": 393,
        "code": "المعادلات التفاضلية والتحويلات/ش 6",
        "name": "المعادلات التفاضلية والتحويلات/ش 6",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. رائد الرفاعي",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#87ae34"
    },
    {
        "id": 394,
        "code": "نظم التحكم اللإخطي",
        "name": "نظم التحكم اللإخطي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-11",
        "color": "#b25518"
    },
    {
        "id": 395,
        "code": "نظم التحكم الصناعي",
        "name": "نظم التحكم الصناعي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-11",
        "color": "#85a613"
    },
    {
        "id": 396,
        "code": "البرمجة1/ش 2",
        "name": "البرمجة1/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية رجب",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-11",
        "color": "#64f4f0"
    },
    {
        "id": 397,
        "code": "بنيان الحواسيب1/ش3",
        "name": "بنيان الحواسيب1/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. هبة الله الخضور",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-12",
        "color": "#cff8af"
    },
    {
        "id": 398,
        "code": "بنيان الحواسيب1/ش4 الله الخضور",
        "name": "بنيان الحواسيب1/ش4 الله الخضور",
        "type": "theory",
        "credits": 0,
        "instructor": "د.هبة هللا الخضور",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-12",
        "color": "#6020b9"
    },
    {
        "id": 399,
        "code": "الفيزياء2/ش2",
        "name": "الفيزياء2/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-12",
        "color": "#aebe4a"
    },
    {
        "id": 400,
        "code": "الفيزياء3",
        "name": "الفيزياء3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-12",
        "color": "#d44f50"
    },
    {
        "id": 401,
        "code": "معالجة الإشارة",
        "name": "معالجة الإشارة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحم",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-13",
        "color": "#bea44a"
    },
    {
        "id": 402,
        "code": "الدارات الكهريائية1/ش2",
        "name": "الدارات الكهريائية1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحمد",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-13",
        "color": "#c5e06f"
    },
    {
        "id": 403,
        "code": "مدخل إلى الذكاء الصنعي/ش3",
        "name": "مدخل إلى الذكاء الصنعي/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-14",
        "color": "#5c9ec4"
    },
    {
        "id": 404,
        "code": "مدخل إلى الذكاء الصنعي/ش4",
        "name": "مدخل إلى الذكاء الصنعي/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-14",
        "color": "#639879"
    },
    {
        "id": 405,
        "code": "مدخل إلى الذكاء الصنعي/ش 5",
        "name": "مدخل إلى الذكاء الصنعي/ش 5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-14",
        "color": "#6938b2"
    },
    {
        "id": 406,
        "code": "مدخل إلى الذكاء الصنعي/ش 6",
        "name": "مدخل إلى الذكاء الصنعي/ش 6",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-14",
        "color": "#74e0ac"
    },
    {
        "id": 407,
        "code": "الخوارزميات وبنى المعطيات2/ش1",
        "name": "الخوارزميات وبنى المعطيات2/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-15",
        "color": "#4ca8fb"
    },
    {
        "id": 408,
        "code": "الخوارزميات وبنى المعطيات 2 /ش2",
        "name": "الخوارزميات وبنى المعطيات 2 /ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-15",
        "color": "#7ee64d"
    },
    {
        "id": 409,
        "code": "الخوارزميات وبنى المعطيات1 /ش2",
        "name": "الخوارزميات وبنى المعطيات1 /ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضي ركيوان",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-15",
        "color": "#6e22fa"
    },
    {
        "id": 410,
        "code": "تراسل البيانات/ش3 الفقيه",
        "name": "تراسل البيانات/ش3 الفقيه",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-16",
        "color": "#669b74"
    },
    {
        "id": 411,
        "code": "تراسل البيانات/ش4 الفقيه",
        "name": "تراسل البيانات/ش4 الفقيه",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-16",
        "color": "#83be4f"
    },
    {
        "id": 412,
        "code": "التحليل الرياضي1/ه-ش2",
        "name": "التحليل الرياضي1/ه-ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عبد الرزاق الفاضل",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-17",
        "color": "#ddc398"
    },
    {
        "id": 413,
        "code": "الإنكليزية للمهندسين/ش2",
        "name": "الإنكليزية للمهندسين/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-17",
        "color": "#db8dac"
    },
    {
        "id": 414,
        "code": "الهوائيات وانتشار الأمواج الراديوية",
        "name": "الهوائيات وانتشار الأمواج الراديوية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-17",
        "color": "#a373bb"
    },
    {
        "id": 415,
        "code": "الحساسات والتحسس",
        "name": "الحساسات والتحسس",
        "type": "theory",
        "credits": 0,
        "instructor": "د.عادل الكفري",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-18",
        "color": "#4f847d"
    },
    {
        "id": 416,
        "code": "الدارات المنطقية/ش 3",
        "name": "الدارات المنطقية/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-18",
        "color": "#cc25dc"
    },
    {
        "id": 417,
        "code": "مهارات التواصل/ش 2",
        "name": "مهارات التواصل/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-18",
        "color": "#bb20a7"
    },
    {
        "id": 418,
        "code": "اتصالات الأقمار الصناعية",
        "name": "اتصالات الأقمار الصناعية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-SEC-1",
        "color": "#b29094"
    },
    {
        "id": 419,
        "code": "خوارزميات البحث الذكية",
        "name": "خوارزميات البحث الذكية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-SEC-1",
        "color": "#bbab4a"
    },
    {
        "id": 420,
        "code": "ضمان جودة البرمجيات واختبارها",
        "name": "ضمان جودة البرمجيات واختبارها",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-ACN-1",
        "color": "#3f1018"
    },
    {
        "id": 421,
        "code": "نظم التشغيل الموزعة/عملي",
        "name": "نظم التشغيل الموزعة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. موفق العضل",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-ACN-1",
        "color": "#53e048"
    },
    {
        "id": 422,
        "code": "بحوث العمليات",
        "name": "بحوث العمليات",
        "type": "lab",
        "credits": 0,
        "instructor": "د. عبد الرزاق الفاضل",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-ACN-1",
        "color": "#ae2ed6"
    },
    {
        "id": 423,
        "code": "النظم الموزعة والحوسبة السحابية/عملي ف13",
        "name": "النظم الموزعة والحوسبة السحابية/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#a1a12c"
    },
    {
        "id": 424,
        "code": "النظم الموزعة والحوسبة السحابية/عملي ف23",
        "name": "النظم الموزعة والحوسبة السحابية/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#616bb3"
    },
    {
        "id": 425,
        "code": "البرمجة3/عملي ف14",
        "name": "البرمجة3/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#cb5f81"
    },
    {
        "id": 426,
        "code": "البرمجة3/عملي ف24",
        "name": "البرمجة3/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#768cb3"
    },
    {
        "id": 427,
        "code": "بنيان الحواسيب2/عملي ف14",
        "name": "بنيان الحواسيب2/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#9b32b6"
    },
    {
        "id": 428,
        "code": "بنيان الحواسيب2/عملي ف24",
        "name": "بنيان الحواسيب2/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#b38bfe"
    },
    {
        "id": 429,
        "code": "نظم قواعد البيانات/عملي ف13",
        "name": "نظم قواعد البيانات/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. تقى الزعبي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#531c34"
    },
    {
        "id": 430,
        "code": "نظم قواعد البيانات/عملي ف23",
        "name": "نظم قواعد البيانات/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. تقى الزعبي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#88df27"
    },
    {
        "id": 431,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف15",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف15",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#799c5a"
    },
    {
        "id": 432,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف11",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#5e87cb"
    },
    {
        "id": 433,
        "code": "البرمجة1/عملي ف12",
        "name": "البرمجة1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#656377"
    },
    {
        "id": 434,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف25",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف25",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#bec64d"
    },
    {
        "id": 435,
        "code": "أساسيات قواعد البيانات/عملي ف15",
        "name": "أساسيات قواعد البيانات/عملي ف15",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فرح فارس",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#a763ab"
    },
    {
        "id": 436,
        "code": "أساسيات قواعد البيانات/عملي ف25",
        "name": "أساسيات قواعد البيانات/عملي ف25",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فرح فارس",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#958c7c"
    },
    {
        "id": 437,
        "code": "أساسيات قواعد البيانات/عملي ف16",
        "name": "أساسيات قواعد البيانات/عملي ف16",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#45a09a"
    },
    {
        "id": 438,
        "code": "أساسيات قواعد البيانات/عملي ف26",
        "name": "أساسيات قواعد البيانات/عملي ف26",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#bb8a81"
    },
    {
        "id": 439,
        "code": "تطوير تطبيقات الويب/عملي ف1",
        "name": "تطوير تطبيقات الويب/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / هديل عسراوي",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#c24794"
    },
    {
        "id": 440,
        "code": "تطوير تطبيقات الويب/عملي ف2",
        "name": "تطوير تطبيقات الويب/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / هديل عسراوي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#b7d4ff"
    },
        {
        "id": 441,
        "code": "تطوير تطبيقات الويب/عملي ف3",
        "name": "تطوير تطبيقات الويب/عملي ف3",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#436205"
    },
    {
        "id": 442,
        "code": "أمن نظم المعلومات/عملي",
        "name": "أمن نظم المعلومات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمد الشايطة / م. فرح فارس",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#9f4af8"
    },
    {
        "id": 443,
        "code": "معالجة الصور وتحليلها/عملي ف12",
        "name": "معالجة الصور وتحليلها/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#97b27a"
    },
    {
        "id": 444,
        "code": "معالجة الصور وتحليلها/عملي ف22",
        "name": "معالجة الصور وتحليلها/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. بغدادي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#587855"
    },
    {
        "id": 445,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف12",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب ادي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#874a18"
    },
    {
        "id": 446,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف22",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#c934e7"
    },
    {
        "id": 447,
        "code": "أمن نظم التشغيل/عملي ف1",
        "name": "أمن نظم التشغيل/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#466a34"
    },
    {
        "id": 448,
        "code": "أمن نظم التشغيل/عملي ف2",
        "name": "أمن نظم التشغيل/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#65fdf6"
    },
    {
        "id": 449,
        "code": "الاختراق الأخلاق والدفاع عن الأنظمة/عملي",
        "name": "الاختراق الأخلاق والدفاع عن الأنظمة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#8293d8"
    },
    {
        "id": 450,
        "code": "الشبكات اللاسلكية/عملي",
        "name": "الشبكات اللاسلكية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م.",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#4cad4c"
    },
    {
        "id": 451,
        "code": "إدارة الشبكات الحاسوبية/عملي ف11",
        "name": "إدارة الشبكات الحاسوبية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م. يز رافع",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#ce6c1f"
    },
    {
        "id": 452,
        "code": "بروتوكولات الشبكات الحاسوبية/عملي",
        "name": "بروتوكولات الشبكات الحاسوبية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م.يزن أبو رافع",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#5d4eb2"
    },
    {
        "id": 453,
        "code": "إدارة الشبكات الحاسوبية/عملي ف21",
        "name": "إدارة الشبكات الحاسوبية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م. يزن أبو رافع",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#8c2c36"
    },
    {
        "id": 454,
        "code": "إدارة الشبكات الحاسوبية وبروتوكولاتها/عملي",
        "name": "إدارة الشبكات الحاسوبية وبروتوكولاتها/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م.يزن أبو رافع",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#543a9f"
    },
    {
        "id": 455,
        "code": "البرمجة3/عملي ف13",
        "name": "البرمجة3/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. الحسين طفيلية",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#adde77"
    },
    {
        "id": 456,
        "code": "البرمجة3/عملي ف23",
        "name": "البرمجة3/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مض ر كيوان / م. الحسين طفيلية",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#92ba5e"
    },
    {
        "id": 457,
        "code": "نظم قواعد البيانات/عملي ف14",
        "name": "نظم قواعد البيانات/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. كادان الجمعة / م. هديل عسراوي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#9e6521"
    },
    {
        "id": 458,
        "code": "نظم قواعد البيانات/عملي ف24",
        "name": "نظم قواعد البيانات/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "د. كادان الجمعة / م. هديل عسراوي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#3982dd"
    },
    {
        "id": 459,
        "code": "أسس نظم الاتصالات/عملي",
        "name": "أسس نظم الاتصالات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-AT",
        "color": "#d61f96"
    },
    {
        "id": 460,
        "code": "معالجة الإشارة/عملي ف1",
        "name": "معالجة الإشارة/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#b72aad"
    },
    {
        "id": 461,
        "code": "معالجة الإشارة/عملي ف2",
        "name": "معالجة الإشارة/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-AT",
        "color": "#46fd46"
    },
    {
        "id": 462,
        "code": "الإشارات والنظم/عملي ف11",
        "name": "الإشارات والنظم/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-AT",
        "color": "#c91470"
    },
    {
        "id": 463,
        "code": "التصميم بمساعدة الحاسوب/عملي ف1",
        "name": "التصميم بمساعدة الحاسوب/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي / م. محسن سكر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-CA",
        "color": "#a166e6"
    },
    {
        "id": 464,
        "code": "التصميم بمساعدة الحاسوب/عملي ف2",
        "name": "التصميم بمساعدة الحاسوب/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي / م. محسن سكر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-CA",
        "color": "#914f4b"
    },
    {
        "id": 465,
        "code": "نظم التحكم الرقمي/عملي",
        "name": "نظم التحكم الرقمي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#8cec6b"
    },
    {
        "id": 466,
        "code": "نظم التحكم اللإخطي/عملي",
        "name": "نظم التحكم اللإخطي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#6b52eb"
    },
    {
        "id": 467,
        "code": "نظم التحكم الصناعي/عملي ف1",
        "name": "نظم التحكم الصناعي/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-ROB",
        "color": "#47e431"
    },
    {
        "id": 468,
        "code": "النظم الميكاإلكترونية/عملي",
        "name": "النظم الميكاإلكترونية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-ROB",
        "color": "#524abd"
    },
    {
        "id": 469,
        "code": "الفيزياء1/عملي ف22",
        "name": "الفيزياء1/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#5a8cec"
    },
    {
        "id": 470,
        "code": "الفيزياء 2/ عملي ف21",
        "name": "الفيزياء 2/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسة",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "PE-L2",
        "color": "#d992b2"
    },
    {
        "id": 471,
        "code": "الفيزياء1/عملي ف12",
        "name": "الفيزياء1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسة",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "PE-L2",
        "color": "#d09fa5"
    },
    {
        "id": 472,
        "code": "الفيزياء1/ عملي ف21",
        "name": "الفيزياء1/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسة",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "PE-L2",
        "color": "#c9a76b"
    }
];
    





// المتغيرات العامة
let registeredCourses = [];
let timeSlots = [
    "08:00 - 08:50",
    "08:50 - 09:40", 
    "09:40 - 10:30",
    "10:30 - 11:20",
    "11:20 - 12:10",
    "12:10 - 13:00",
    "13:00 - 13:50",
    "13:50 - 14:40",
    "14:40 - 15:30",
    "15:30 - 16:20"
];

// تحويل وقت النص إلى دقائق من بداية اليوم
function timeToMinutes(timeStr) {
    if (!timeStr) return { start: 0, end: 0 };
    
    // تنظيف النص وإزالة المسافات الزائدة
    const cleanTime = timeStr.replace(/\s/g, '');
    
    // البحث عن الأوقات في الصيغ المختلفة
    const timeMatch = cleanTime.match(/(\d{1,2}):(\d{2})\s*[-–]\s*(\d{1,2}):(\d{2})/);
    if (timeMatch) {
        const [, startHour, startMin, endHour, endMin] = timeMatch;
        let start = parseInt(startHour) * 60 + parseInt(startMin);
        let end = parseInt(endHour) * 60 + parseInt(endMin);
        
        // تعديل الأوقات لتتناسب مع النظام الجديد
        if (endMin === 20) end += 10; // 16:20 تصبح 16:30 للتسهيل
        if (endMin === 40) end += 10; // 14:40 تصبح 14:50 للتسهيل
        
        return { start, end };
    }
    
    // محاولة أخرى بصيغ مختلفة
    const parts = cleanTime.split(/[-–]/);
    if (parts.length === 2) {
        const parsePart = (part) => {
            const [hour, min] = part.split(':');
            let result = parseInt(hour || 0) * 60 + parseInt(min || 0);
            
            // تعديل الأوقات لتتناسب مع النظام الجديد
            const minutes = parseInt(min || 0);
            if (minutes === 20) result += 10; // 16:20 تصبح 16:30
            if (minutes === 40) result += 10; // 14:40 تصبح 14:50
            
            return result;
        };
        return { start: parsePart(parts[0]), end: parsePart(parts[1]) };
    }
    
    return { start: 0, end: 0 };
}

// دالة مساعدة للحصول على جميع الأوقات الفرعية للمادة
function getCourseTimeSlots(course) {
    const courseTime = timeToMinutes(course.time);
    const slots = [];
    
    timeSlots.forEach(slot => {
        const slotTime = timeToMinutes(slot);
        // إذا كان وقت الحصة يقع ضمن وقت المادة
        if (slotTime.start >= courseTime.start && slotTime.end <= courseTime.end) {
            slots.push(slot);
        }
    });
    
    return slots;
}

// التحقق من تداخل الأوقات
function checkConflict(newCourse) {
    const newTime = timeToMinutes(newCourse.time);
    if (newTime.start === 0 && newTime.end === 0) return false;
    
    return registeredCourses.some(course => {
        // إذا كان اليوم مختلفاً، لا يوجد تداخل
        if (course.day !== newCourse.day) return false;
        
        const existingTime = timeToMinutes(course.time);
        if (existingTime.start === 0 && existingTime.end === 0) return false;
        
        // التحقق من التداخل
        const timeConflict = (
            (newTime.start < existingTime.end && newTime.end > existingTime.start)
        );
        
        return timeConflict;
    });
}

// الحصول على المادة المتداخلة
function getConflictCourse(newCourse) {
    const newTime = timeToMinutes(newCourse.time);
    if (newTime.start === 0 && newTime.end === 0) return null;
    
    return registeredCourses.find(course => {
        if (course.day !== newCourse.day) return false;
        
        const existingTime = timeToMinutes(course.time);
        if (existingTime.start === 0 && existingTime.end === 0) return false;
        
        const timeConflict = (
            (newTime.start < existingTime.end && newTime.end > existingTime.start)
        );
        
        return timeConflict;
    });
}

// دالة لتهيئة التطبيق
function initApp() {
    // أولاً، عدل أيام الفلترات
    setupDaysFilter();
    
    // ثم عرض كل شيء
    displayAvailableCourses();
    displayRegisteredCourses();
    displayTimetable();
    updateStats();
    setupEventListeners();
}

// إعداد فلتر الأيام (السبت-الثلاثاء فقط)
function setupDaysFilter() {
    const daysOrder = ["السبت", "الأحد", "الاثنين", "الثلاثاء"];
    
    // إزالة الأيام القديمة
    const filterGroup = document.querySelector('.filter-group:last-child');
    filterGroup.innerHTML = '';
    
    // إضافة الأيام الجديدة
    daysOrder.forEach(day => {
        const label = document.createElement('label');
        label.innerHTML = `
            <input type="checkbox" id="filter-${day}" checked> ${day}
        `;
        filterGroup.appendChild(label);
        
        // إضافة مستمع الحدث
        document.getElementById(`filter-${day}`).addEventListener('change', displayAvailableCourses);
    });
}

// عرض المواد المتاحة
function displayAvailableCourses() {
    const container = document.getElementById('available-courses');
    container.innerHTML = '';
    
    const searchTerm = document.getElementById('search').value.toLowerCase();
    const showTheory = document.getElementById('filter-theory').checked;
    const showLab = document.getElementById('filter-lab').checked;
    const daysFilter = getSelectedDays();
    
    const filteredCourses = availableCourses.filter(course => {
        // البحث
        const matchesSearch = course.name.toLowerCase().includes(searchTerm) || 
                             course.code.toLowerCase().includes(searchTerm) ||
                             course.instructor.toLowerCase().includes(searchTerm);
        
        // النوع
        const matchesType = (course.type === 'theory' && showTheory) || 
                           (course.type === 'lab' && showLab);
        
        // اليوم
        const matchesDay = daysFilter.includes(course.day);
        
        // التحقق إذا كانت مسجلة مسبقاً
        const isRegistered = registeredCourses.some(reg => reg.id === course.id);
        
        return matchesSearch && matchesType && matchesDay && !isRegistered;
    });
    
    if (filteredCourses.length === 0) {
        container.innerHTML = '<p class="no-courses">لا توجد مواد مطابقة للبحث</p>';
        return;
    }
    
    filteredCourses.forEach(course => {
        const card = createCourseCard(course, false);
        container.appendChild(card);
    });
}

// الحصول على الأيام المختارة في الفلتر
function getSelectedDays() {
    const days = ['السبت', 'الأحد', 'الاثنين', 'الثلاثاء'];
    const selected = [];
    
    days.forEach(day => {
        const checkbox = document.getElementById(`filter-${day}`);
        if (checkbox && checkbox.checked) {
            selected.push(day);
        }
    });
    
    return selected;
}

// إنشاء بطاقة مادة
function createCourseCard(course, isRegistered) {
    const card = document.createElement('div');
    card.className = `course-card ${isRegistered ? 'registered' : ''}`;
    card.dataset.id = course.id;
    
    // التحقق من التداخل إذا كانت مسجلة
    if (isRegistered) {
        const hasConflict = checkConflict(course);
        if (hasConflict) {
            card.classList.add('conflict');
            const conflictCourse = getConflictCourse(course);
            if (conflictCourse) {
                card.title = `متتداخل مع: ${conflictCourse.name} (${conflictCourse.time})`;
            }
        }
    }
    
    // حساب عدد الحصص
    const courseTime = timeToMinutes(course.time);
    const duration = courseTime.end - courseTime.start;
    const numberOfSlots = Math.ceil(duration / 50);
    
    card.innerHTML = `
        <div class="course-code">${course.code}</div>
        <div class="course-name">${course.name}</div>
        <div class="course-details">
            <span class="course-detail">
                <i class="fas fa-user-tie"></i> ${course.instructor}
            </span>
            <span class="course-detail">
                <i class="fas ${course.type === 'theory' ? 'fa-chalkboard-teacher' : 'fa-flask'}"></i> 
                ${course.type === 'theory' ? 'نظري' : 'عملي'}
            </span>
            <span class="course-detail">
                <i class="fas fa-clock"></i> ${course.time} (${numberOfSlots} حصة)
            </span>
            <span class="course-detail">
                <i class="fas fa-calendar-day"></i> ${course.day}
            </span>
            <span class="course-detail">
                <i class="fas fa-door-open"></i> ${course.room}
            </span>
            <span class="course-detail">
                <i class="fas fa-credit-card"></i> ${course.credits} ساعة
            </span>
        </div>
    `;
    
    card.addEventListener('click', () => {
        if (isRegistered) {
            unregisterCourse(course.id);
        } else {
            registerCourse(course.id);
        }
    });
    
    return card;
}

// تسجيل مادة
function registerCourse(courseId) {
    const course = availableCourses.find(c => c.id === courseId);
    if (!course) return;
    
    // التحقق من التداخل
    const conflictCourse = getConflictCourse(course);
    if (conflictCourse) {
        showAlert('تداخل في الوقت', 
            `هذه المادة تتداخل مع:<br>
            <strong>${conflictCourse.name}</strong><br>
            ${conflictCourse.day} ${conflictCourse.time}<br>
            ${conflictCourse.instructor} - ${conflictCourse.room}`);
        return;
    }
    
    // التحقق من الحد الأقصى للساعات
    const currentCredits = registeredCourses.reduce((sum, c) => sum + c.credits, 0);
    if (currentCredits + course.credits > 18) {
        showAlert('تجاوز الحد الأقصى', 'لا يمكنك تسجيل أكثر من 18 ساعة معتمدة');
        return;
    }
    
    registeredCourses.push(course);
    updateAllDisplays();
    showAlert('تم التسجيل', `تم تسجيل مادة ${course.name} بنجاح!`, 'success');
}

// إلغاء تسجيل مادة
function unregisterCourse(courseId) {
    registeredCourses = registeredCourses.filter(c => c.id !== courseId);
    updateAllDisplays();
}

// عرض المواد المسجلة
function displayRegisteredCourses() {
    const container = document.getElementById('registered-courses');
    container.innerHTML = '';
    
    if (registeredCourses.length === 0) {
        container.innerHTML = '<p class="no-courses">لا توجد مواد مسجلة بعد</p>';
        return;
    }
    
    registeredCourses.forEach(course => {
        const card = createCourseCard(course, true);
        container.appendChild(card);
    });
}

// عرض الجدول الأسبوعي
function displayTimetable() {
    const container = document.getElementById('timetable-body');
    container.innerHTML = '';
    
    // إعادة ترتيب الأيام: السبت، الأحد، الإثنين، الثلاثاء
    const days = ['السبت', 'الأحد', 'الاثنين', 'الثلاثاء'];
    
    // تحديث رأس الجدول
    const timetableHeader = document.querySelector('.timetable-header');
    timetableHeader.innerHTML = `
        <div class="time-slot">الوقت</div>
        <div class=day>السبت</div>
        <div class=day>الأحد</div>
        <div class=day>الإثنين</div>
        <div class=day>الثلاثاء</div>
    `;
    
    // إضافة CSS الخاص بالجدول الجديد
    addTimetableStyles();
    
    // إنشاء جميع الخلايا أولاً
    timeSlots.forEach(time => {
        // خلية الوقت
        const timeCell = document.createElement('div');
        timeCell.className = 'time-cell';
        timeCell.textContent = time;
        container.appendChild(timeCell);
        
        // خلايا الأيام لهذا الوقت
        days.forEach(day => {
            const dayCell = document.createElement('div');
            dayCell.className = 'day-cell';
            dayCell.dataset.day = day;
            dayCell.dataset.time = time;
            dayCell.style.position = 'relative';
            container.appendChild(dayCell);
        });
    });
    
    // الآن إضافة المواد إلى الجدول
    registeredCourses.forEach(course => {
        if (course.day && days.includes(course.day)) {
            const dayIndex = days.indexOf(course.day);
            
            // الحصول على جميع الأوقات الفرعية للمادة
            const courseSlots = getCourseTimeSlots(course);
            
            if (courseSlots.length > 0) {
                const firstSlot = courseSlots[0];
                const firstSlotIndex = timeSlots.indexOf(firstSlot);
                
                if (firstSlotIndex !== -1) {
                    // حساب عدد الخلايا التي تحتاجها المادة
                    const slotsCount = courseSlots.length;
                    
                    // العثور على الخلية الأولى للمادة
                    // كل صف به 5 خلايا (1 للوقت + 4 للأيام)
                    const cellIndex = (firstSlotIndex * (days.length + 1)) + (dayIndex + 1);
                    const firstCell = container.children[cellIndex];
                    
                    if (firstCell) {
                        // إزالة أي محتوى سابق في الخلية
                        firstCell.innerHTML = '';
                        
                        // إنشاء عنصر المادة
                        const courseElement = document.createElement('div');
                        courseElement.className = `course-in-timetable ${course.type}`;
                        courseElement.style.backgroundColor = course.color;
                        courseElement.style.height = `calc(${slotsCount * 60}px - 4px)`;
                        courseElement.innerHTML = `
                            <div class="course-timetable-code">${course.code}</div>
                            <div class="course-timetable-details">
                                ${course.instructor}<br>
                                ${course.room}
                            </div>
                        `;
                        courseElement.addEventListener('click', (e) => {
                            e.stopPropagation();
                            unregisterCourse(course.id);
                        });
                        firstCell.appendChild(courseElement);
                    }
                }
            }
        }
    });
}

// إضافة أنماط CSS للجدول
function addTimetableStyles() {
    const styleId = 'timetable-styles';
    if (document.getElementById(styleId)) {
        document.getElementById(styleId).remove();
    }
    
    const style = document.createElement('style');
    style.id = styleId;
    style.textContent = `
        #timetable-body {
            display: grid;
            grid-template-columns: 100px repeat(4, 1fr);
            grid-auto-rows: 60px;
            gap: 1px;
            background-color: #ddd;
        }
        
        .time-cell, .day-cell {
            background-color: white;
            padding: 5px;
            position: relative;
            border: 1px solid #ddd;
        }
        
        .time-cell {
            font-weight: bold;
            text-align: center;
            display: flex;
            align-items: center;
            justify-content: center;
            background-color: #f8f9fa;
        }
        
        .day-cell {
            min-height: 60px;
        }
        
        .course-in-timetable {
            position: absolute;
            top: 2px;
            left: 2px;
            right: 2px;
            bottom: 2px;
            padding: 5px;
            border-radius: 4px;
            color: white;
            font-size: 11px;
            overflow: hidden;
            cursor: pointer;
            z-index: 1;
            display: flex;
            flex-direction: column;
            justify-content: center;
            align-items: center;
            text-align: center;
            box-shadow: 0 2px 4px rgba(0,0,0,0.1);
            transition: transform 0.2s;
        }
        
        .course-in-timetable:hover {
            transform: scale(1.02);
            box-shadow: 0 4px 8px rgba(0,0,0,0.2);
        }
        
        .course-timetable-code {
            font-weight: bold;
            font-size: 12px;
            margin-bottom: 2px;
        }
        
        .course-timetable-details {
            font-size: 10px;
            line-height: 1.2;
        }
    `;
    document.head.appendChild(style);
}

// تحديث الإحصائيات
function updateStats() {
    const totalHours = registeredCourses.reduce((sum, course) => sum + course.credits, 0);
    const totalCourses = registeredCourses.length;
    
    document.getElementById('total-hours').textContent = totalHours;
    document.getElementById('total-courses').textContent = totalCourses;
}

// تحديث جميع العروض
function updateAllDisplays() {
    displayAvailableCourses();
    displayRegisteredCourses();
    displayTimetable();
    updateStats();
}

// إعداد مستمعي الأحداث
function setupEventListeners() {
    // البحث والتصفية
    document.getElementById('search').addEventListener('input', displayAvailableCourses);
    document.getElementById('filter-theory').addEventListener('change', displayAvailableCourses);
    document.getElementById('filter-lab').addEventListener('change', displayAvailableCourses);
    
    // الأزرار
    document.getElementById('save-btn').addEventListener('click', saveRegistration);
    document.getElementById('clear-btn').addEventListener('click', clearAll);
    document.getElementById('print-btn').addEventListener('click', printTimetable);
    
    // النافذة المنبثقة
    document.querySelector('.close').addEventListener('click', () => {
        document.getElementById('alert-modal').style.display = 'none';
    });
    
    document.getElementById('alert-ok').addEventListener('click', () => {
        document.getElementById('alert-modal').style.display = 'none';
    });
    
    // إضافة أيام الفلتر بعد إنشائها
    setTimeout(() => {
        ['السبت', 'الأحد', 'الاثنين', 'الثلاثاء'].forEach(day => {
            const checkbox = document.getElementById(`filter-${day}`);
            if (checkbox) {
                checkbox.addEventListener('change', displayAvailableCourses);
            }
        });
    }, 100);
}

// حفظ التسجيل
function saveRegistration() {
    if (registeredCourses.length === 0) {
        showAlert('لا توجد مواد', 'لم تقم بتسجيل أي مواد بعد');
        return;
    }
    
    // إنشاء بيانات لحفظها
    const registrationData = {
        student: "طالب SPU",
        semester: "الفصل الثاني 2025-2026",
        date: new Date().toLocaleDateString('ar-SA'),
        courses: registeredCourses,
        totalCredits: registeredCourses.reduce((sum, c) => sum + c.credits, 0)
    };
    
    // حفظ في LocalStorage
    localStorage.setItem('spu_registration', JSON.stringify(registrationData));
    
    // تنزيل كملف JSON
    const dataStr = JSON.stringify(registrationData, null, 2);
    const dataUri = 'data:application/json;charset=utf-8,'+ encodeURIComponent(dataStr);
    
    const exportFileDefaultName = 'تسجيل_المواد_SPU.json';
    
    const linkElement = document.createElement('a');
    linkElement.setAttribute('href', dataUri);
    linkElement.setAttribute('download', exportFileDefaultName);
    linkElement.click();
    
    showAlert('تم الحفظ', 'تم حفظ جدولك بنجاح وتم تنزيل ملف التسجيل!', 'success');
}

// مسح الكل
function clearAll() {
    if (registeredCourses.length === 0) return;
    
    if (confirm('هل أنت متأكد من مسح جميع المواد المسجلة؟')) {
        registeredCourses = [];
        updateAllDisplays();
        showAlert('تم المسح', 'تم مسح جميع المواد المسجلة', 'info');
    }
}

// طباعة الجدول
function printTimetable() {
    if (registeredCourses.length === 0) {
        showAlert('لا يوجد جدول', 'لا يوجد جدول لطباعته');
        return;
    }
    
    // إنشاء نافذة طباعة
    const printWindow = window.open('', '_blank');
    printWindow.document.write(`
        <!DOCTYPE html>
        <html dir="rtl" lang="ar">
        <head>
            <meta charset="UTF-8">
            <title>جدولي الأسبوعي - SPU</title>
            <style>
                body { font-family: Arial, sans-serif; padding: 20px; direction: rtl; }
                h1 { color: #2C3E50; text-align: center; }
                h2 { color: #3498db; }
                .header { text-align: center; margin-bottom: 30px; }
                .timetable { width: 100%; border-collapse: collapse; margin-top: 20px; }
                .timetable th, .timetable td { border: 1px solid #ddd; padding: 8px; text-align: center; vertical-align: top; }
                .timetable th { background-color: #2C3E50; color: white; }
                .course-cell { padding: 5px; border-radius: 4px; color: white; margin: 2px; }
                .course-list { margin-top: 30px; }
                .course-item { padding: 10px; border-bottom: 1px solid #eee; }
                @media print {
                    .no-print { display: none; }
                    body { font-size: 11pt; }
                }
            </style>
        </head>
        <body>
            <div class="header">
                <h1>الجامعة السورية الخاصة</h1>
                <h2>كلية هندسة الذكاء الاصطناعي</h2>
                <h3>الفصل الثاني 2025-2026</h3>
                <p>تاريخ الطباعة: ${new Date().toLocaleDateString('ar-SA')}</p>
            </div>
            
            <h2>الجدول الأسبوعي</h2>
            ${generatePrintableTimetable()}
            
            <div class="course-list">
                <h2>المواد المسجلة</h2>
                ${generatePrintableCoursesList()}
            </div>
            
            <div class="no-print" style="margin-top: 50px; text-align: center;">
                <button onclick="window.print()" style="padding: 10px 20px; background: #3498db; color: white; border: none; border-radius: 5px; cursor: pointer;">
                    طباعة الجدول
                </button>
                <button onclick="window.close()" style="padding: 10px 20px; background: #e74c3c; color: white; border: none; border-radius: 5px; cursor: pointer; margin-right: 10px;">
                    إغلاق
                </button>
            </div>
        </body>
        </html>
    `);
    printWindow.document.close();
}

// توليد جدول للطباعة
function generatePrintableTimetable() {
    const days = ['السبت', 'الأحد', 'الاثنين', 'الثلاثاء'];
    let html = '<table class="timetable">';
    
    // الرأس
    html += '<tr><th>الوقت</th>';
    days.forEach(day => html += `<th>${day}</th>`);
    html += '</tr>';
    
    // إنشاء مصفوفة لتتبع الخلايا المدمجة
    const rowspanTracker = {};
    
    // الصفوف
    timeSlots.forEach((time, timeIndex) => {
        html += `<tr><td style="background-color:#f8f9fa; font-weight:bold;">${time}</td>`;
        
        days.forEach(day => {
            // تحقق إذا كانت هذه الخلية جزء من خلية مدمجة
            if (rowspanTracker[`${day}-${timeIndex}`]) {
                return; // تخطي هذه الخلية
            }
            
            let courseForThisSlot = null;
            let slotsCount = 1;
            
            // البحث عن مادة في هذا اليوم وهذا الوقت
            registeredCourses.forEach(course => {
                if (course.day === day) {
                    const courseTime = timeToMinutes(course.time);
                    const slotTime = timeToMinutes(time);
                    
                    // إذا كان وقت الحصة ضمن وقت المادة
                    if (slotTime.start >= courseTime.start && slotTime.end <= courseTime.end) {
                        const allSlots = getCourseTimeSlots(course);
                        // فقط عرض المادة في أول حصة لها
                        if (time === allSlots[0]) {
                            slotsCount = allSlots.length;
                            courseForThisSlot = course;
                            
                            // تتبع الخلايا المدمجة
                            for (let i = 1; i < slotsCount; i++) {
                                rowspanTracker[`${day}-${timeIndex + i}`] = true;
                            }
                        }
                    }
                }
            });
            
            if (courseForThisSlot) {
                html += `<td rowspan="${slotsCount}" style="background-color:${courseForThisSlot.color}; color:white; vertical-align:middle;">
                    <div style="padding:10px;">
                        <strong style="font-size:14px;">${courseForThisSlot.code}</strong><br>
                        <span style="font-size:12px;">${courseForThisSlot.instructor}</span><br>
                        <span style="font-size:11px;">${courseForThisSlot.room}</span>
                    </div>
                </td>`;
            } else {
                html += '<td></td>';
            }
        });
        html += '</tr>';
    });
    
    html += '</table>';
    return html;
}

// توليد قائمة المواد للطباعة
function generatePrintableCoursesList() {
    let html = '';
    const groupedCourses = {};
    
    registeredCourses.forEach(course => {
        if (!groupedCourses[course.code]) {
            groupedCourses[course.code] = {
                name: course.name,
                credits: course.credits,
                instances: []
            };
        }
        groupedCourses[course.code].instances.push(course);
    });
    
    for (const [code, data] of Object.entries(groupedCourses)) {
        html += `<div class="course-item">
            <h3>${code} - ${data.name} (${data.credits} ساعة)</h3>`;
        
        data.instances.forEach(instance => {
            const courseSlots = getCourseTimeSlots(instance);
            const slotsCount = courseSlots.length;
            
            html += `<p>${instance.day} ${instance.time} (${slotsCount} حصة) - ${instance.room} - ${instance.instructor} - ${instance.type === 'theory' ? 'نظري' : 'عملي'}</p>`;
        });
        
        html += '</div>';
    }
    
    // المجموع
    const totalCredits = registeredCourses.reduce((sum, c) => sum + c.credits, 0);
    html += `<div style="margin-top:20px; padding:15px; background:#f8f9fa; border-radius:5px;">
        <strong>المجموع: ${registeredCourses.length} مادة - ${totalCredits} ساعة معتمدة</strong>
    </div>`;
    
    return html;
}

// عرض التنبيهات
function showAlert(title, message, type = 'warning') {
    document.getElementById('alert-title').textContent = title;
    document.getElementById('alert-message').innerHTML = message;
    
    const modal = document.getElementById('alert-modal');
    modal.style.display = 'block';
    
    // تغيير لون الزر حسب النوع
    const okBtn = document.getElementById('alert-ok');
    if (type === 'success') {
        okBtn.style.background = 'linear-gradient(135deg, #2ecc71, #27ae60)';
    } else if (type === 'info') {
        okBtn.style.background = 'linear-gradient(135deg, #3498db, #2980b9)';
    } else {
        okBtn.style.background = 'linear-gradient(135deg, #e74c3c, #c0392b)';
    }
}

// تهيئة التطبيق عند تحميل الصفحة
document.addEventListener('DOMContentLoaded', initApp);




