// ==================== بيانات المواد ====================
const availableCourses = [
    {
        "id": 1,
        "code": "أساسيات قواعد البيانات/ش1",
        "name": "أساسيات قواعد البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-01",
        "color": "#4bb656"
    },
    {
        "id": 2,
        "code": "أساسيات قواعد البيانات/ش2",
        "name": "أساسيات قواعد البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-01",
        "color": "#d2868f"
    },
    {
        "id": 3,
        "code": "أساسيات قواعد البيانات/ش3",
        "name": "أساسيات قواعد البيانات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-01",
        "color": "#63d9ff"
    },
    {
        "id": 4,
        "code": "أساسيات قواعد البيانات/ش4",
        "name": "أساسيات قواعد البيانات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسيم برهوم",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-01",
        "color": "#6ed863"
    },
    {
        "id": 5,
        "code": "بنيان البرمجيات",
        "name": "بنيان البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-02",
        "color": "#9290fc"
    },
    {
        "id": 6,
        "code": "تصميم نظم البرمجيات",
        "name": "تصميم نظم البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#936b84"
    },
    {
        "id": 7,
        "code": "الذكاء الصنعي العملي",
        "name": "الذكاء الصنعي العملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#9ee73d"
    },
    {
        "id": 8,
        "code": "مدخل إلى التعلم العميق",
        "name": "مدخل إلى التعلم العميق",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رياض سنبل",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#8853b2"
    },
    {
        "id": 9,
        "code": "مدخل إلى الرؤية الحاسوبية/ش1",
        "name": "مدخل إلى الرؤية الحاسوبية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-03",
        "color": "#4044a9"
    },
    {
        "id": 10,
        "code": "مدخل إلى الرؤية الحاسوبية/ش2",
        "name": "مدخل إلى الرؤية الحاسوبية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-03",
        "color": "#90908a"
    },
    {
        "id": 11,
        "code": "معالجة الصور وتحليلها/ش1",
        "name": "معالجة الصور وتحليلها/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-03",
        "color": "#989f83"
    },
    {
        "id": 12,
        "code": "معالجة الصور وتحليلها/ش2",
        "name": "معالجة الصور وتحليلها/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نسرين سليمان",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-03",
        "color": "#68c19b"
    },
    {
        "id": 13,
        "code": "الخوارزميات وبنى المعطيات/ش1",
        "name": "الخوارزميات وبنى المعطيات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد / م.سعيد دياب",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-04",
        "color": "#be132a"
    },
    {
        "id": 14,
        "code": "إدارة المشاريع البرمجية",
        "name": "إدارة المشاريع البرمجية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-04",
        "color": "#559af9"
    },
    {
        "id": 15,
        "code": "الخوارزميات وبنى المعطيات/ش2",
        "name": "الخوارزميات وبنى المعطيات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد / م.سعيد دياب",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-04",
        "color": "#5d3650"
    },
    {
        "id": 16,
        "code": "البرمجة بلغة بايثون/ش1",
        "name": "البرمجة بلغة بايثون/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبكي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-05",
        "color": "#41cef4"
    },
    {
        "id": 17,
        "code": "البرمجة بلغة بايثون/ش2",
        "name": "البرمجة بلغة بايثون/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبكي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-05",
        "color": "#b18d44"
    },
    {
        "id": 18,
        "code": "البرمجة بلغة بايثون/ش3",
        "name": "البرمجة بلغة بايثون/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبكي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#b2ed20"
    },
    {
        "id": 19,
        "code": "الكيمياء الحيوية",
        "name": "الكيمياء الحيوية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. يمن الأتاسي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-05",
        "color": "#5761f9"
    },
    {
        "id": 20,
        "code": "أمن الاتصالات",
        "name": "أمن الاتصالات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نادر خضر",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-07",
        "color": "#9affb8"
    },
    {
        "id": 21,
        "code": "أساسيات أمن الحواسيب/ش3",
        "name": "أساسيات أمن الحواسيب/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نادر خضر",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-07",
        "color": "#b0ee22"
    },
    {
        "id": 22,
        "code": "نمذجة شبكات الاتصالات",
        "name": "نمذجة شبكات الاتصالات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نادر خضر",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-07",
        "color": "#a1374e"
    },
    {
        "id": 23,
        "code": "إدارة تشكيلة البرمجيات/عملي",
        "name": "إدارة تشكيلة البرمجيات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. أنس عبد العزيز",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-08",
        "color": "#52c418"
    },
    {
        "id": 24,
        "code": "بنيان البرمجيات/عملي",
        "name": "بنيان البرمجيات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. أنس عبد العزيز",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-08",
        "color": "#753d8b"
    },
    {
        "id": 25,
        "code": "تصميم نظم البرمجيات/عملي",
        "name": "تصميم نظم البرمجيات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. أنس عبد العزيز",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-08",
        "color": "#486494"
    },
    {
        "id": 26,
        "code": "اختبار البرمجيات",
        "name": "اختبار البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مهيب النقري / م.أنس عبد العزيز",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#833bfd"
    },
    {
        "id": 27,
        "code": "التحليل العددي/ش1",
        "name": "التحليل العددي/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. معاذ عبد المجيد",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-09",
        "color": "#926e2a"
    },
    {
        "id": 28,
        "code": "التحليل العددي/ش2",
        "name": "التحليل العددي/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. معاذ عبد المجيد",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-09",
        "color": "#b9febf"
    },
    {
        "id": 29,
        "code": "التحليل العددي/ش3",
        "name": "التحليل العددي/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. معاذ عبد المجيد",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#69d3a0"
    },
    {
        "id": 30,
        "code": "الإحصاء والإحتمالات/ش1",
        "name": "الإحصاء والإحتمالات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عزات قاسم",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-10",
        "color": "#a8a369"
    },
    {
        "id": 31,
        "code": "الإحصاء والاحتمالات/ش2",
        "name": "الإحصاء والاحتمالات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عزات قاسم",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#68f2ec"
    },
    {
        "id": 32,
        "code": "الإحصاء والإحتمالات/ش3",
        "name": "الإحصاء والإحتمالات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عزات قاسم",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#..."
    },
        {
        "id": 33,
        "code": "الإحصاء والإحتمالات/ش4",
        "name": "الإحصاء والإحتمالات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان عاقل",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-11",
        "color": "#bb0b22"
    },
    {
        "id": 34,
        "code": "الإحصاء والإحتمالات/ش5",
        "name": "الإحصاء والإحتمالات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان عاقل",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-11",
        "color": "#b6bffb"
    },
    {
        "id": 35,
        "code": "الإحصاء والإحتمالات/ش6",
        "name": "الإحصاء والإحتمالات/ش6",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان عاقل",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-11",
        "color": "#c8f688"
    },
    {
        "id": 36,
        "code": "معالجة الإشارة الرقمية",
        "name": "معالجة الإشارة الرقمية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-12",
        "color": "#3db4a5"
    },
    {
        "id": 37,
        "code": "الدارات المنطقية/ش1",
        "name": "الدارات المنطقية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. إبراهيم شعيب",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-12",
        "color": "#7e7f48"
    },
    {
        "id": 38,
        "code": "النظم الميكاإلكترونية",
        "name": "النظم الميكاإلكترونية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. إبراهيم شعيب",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-12",
        "color": "#8c999f"
    },
    {
        "id": 39,
        "code": "النمذجة العددية",
        "name": "النمذجة العددية",
        "type": "theory",
        "credits": 0,
        "instructor": "د.إبراهيم شعيب",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-12",
        "color": "#a7800b"
    },
    {
        "id": 40,
        "code": "التصميم بمساعدة الحاسوب/ش1",
        "name": "التصميم بمساعدة الحاسوب/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. سامر حسام الدين",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-13",
        "color": "#ae8c7b"
    },
    {
        "id": 41,
        "code": "المتحكمات المنطقية القابلة للبرمجة",
        "name": "المتحكمات المنطقية القابلة للبرمجة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. سامر حسام الدين",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-13",
        "color": "#b13475"
    },
    {
        "id": 42,
        "code": "الدارات الإلكترونية1/ش1",
        "name": "الدارات الإلكترونية1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-13",
        "color": "#8801c7"
    },
    {
        "id": 43,
        "code": "التصميم بمساعدة الحاسوب/ش2",
        "name": "التصميم بمساعدة الحاسوب/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. سامرحسام الدين",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-13",
        "color": "#3f105b"
    },
    {
        "id": 44,
        "code": "أساسيات أمن الحواسيب/ش1",
        "name": "أساسيات أمن الحواسيب/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. خالد النجار",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-14",
        "color": "#baf7d5"
    },
    {
        "id": 45,
        "code": "أساسيات أمن الحواسيب/ش2",
        "name": "أساسيات أمن الحواسيب/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. خالد النجار",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-14",
        "color": "#615110"
    },
    {
        "id": 46,
        "code": "أمن الشبكات والأمن السيبراني الد النجار",
        "name": "أمن الشبكات والأمن السيبراني الد النجار",
        "type": "theory",
        "credits": 0,
        "instructor": "د.خالد النجار",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-14",
        "color": "#74bdc1"
    },
    {
        "id": 47,
        "code": "الرياضيات الترميمية/ش5",
        "name": "الرياضيات الترميمية/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. رائد الرفاعي",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-14",
        "color": "#3681ce"
    },
    {
        "id": 48,
        "code": "الجبر الخطي ونظرية المصفوفات/ش2",
        "name": "الجبر الخطي ونظرية المصفوفات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "السبت",
        "time": "08:00 - 10:30",
        "room": "AI-15",
        "color": "#a3e0d1"
    },
    {
        "id": 49,
        "code": "الجبر الخطي ونظرية المصفوفات/قديم ش1",
        "name": "الجبر الخطي ونظرية المصفوفات/قديم ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "السبت",
        "time": "10:30 - 13:00",
        "room": "AI-15",
        "color": "#b17f75"
    },
    {
        "id": 50,
        "code": "الجبر الخطي ونظرية المصفوفات/ش1",
        "name": "الجبر الخطي ونظرية المصفوفات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "AI-15",
        "color": "#574827"
    },
    {
        "id": 51,
        "code": "شبكات الحاسوب/ش1",
        "name": "شبكات الحاسوب/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسام محمد",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-16",
        "color": "#8a1ac1"
    },
    {
        "id": 52,
        "code": "شبكات الحاسوب/ش2",
        "name": "شبكات الحاسوب/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسام محمد",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-16",
        "color": "#40af89"
    },
    {
        "id": 53,
        "code": "شبكات الحاسوب/ش3",
        "name": "شبكات الحاسوب/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بسام محمد",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-16",
        "color": "#d97b84"
    },
    {
        "id": 54,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش1",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-17",
        "color": "#ceccb1"
    },
    {
        "id": 55,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش5",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-17",
        "color": "#6b54f4"
    },
    {
        "id": 56,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش2",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-17",
        "color": "#8d032d"
    },
    {
        "id": 57,
        "code": "مدخل إلى الخوارزميات والبرمجة/قديم",
        "name": "مدخل إلى الخوارزميات والبرمجة/قديم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فادي إبراهيم",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-17",
        "color": "#48154c"
    },
    {
        "id": 58,
        "code": "نظم التشغيل/2ش1",
        "name": "نظم التشغيل/2ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-18",
        "color": "#340dcd"
    },
    {
        "id": 59,
        "code": "نظم التشغيل1/ش1",
        "name": "نظم التشغيل1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-18",
        "color": "#c3fdc8"
    },
    {
        "id": 60,
        "code": "النظم الموزعة والحوسبة السحابية/ش1",
        "name": "النظم الموزعة والحوسبة السحابية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-18",
        "color": "#54168f"
    },
    {
        "id": 61,
        "code": "برمجة نظم التشغيل (برمجة النظم)",
        "name": "برمجة نظم التشغيل (برمجة النظم)",
        "type": "theory",
        "credits": 0,
        "instructor": "م. روان كردي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-18",
        "color": "#7fefdc"
    },
    {
        "id": 62,
        "code": "الدارات الكهربائية2",
        "name": "الدارات الكهربائية2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-ACN-1",
        "color": "#84bf87"
    },
    {
        "id": 63,
        "code": "الدارات الكهربائية2/عملي",
        "name": "الدارات الكهربائية2/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-ACN-1",
        "color": "#5b26a2"
    },
    {
        "id": 64,
        "code": "الآلات الكهربائية",
        "name": "الآلات الكهربائية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-ACN-1",
        "color": "#..."
    },
        {
        "id": 65,
        "code": "الآلات الكهربائية/عملي",
        "name": "الآلات الكهربائية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمود عبد اللطيف",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-ACN-1",
        "color": "#97d12a"
    },
    {
        "id": 66,
        "code": "لغات البرمجة",
        "name": "لغات البرمجة",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "UR8",
        "color": "#42d81e"
    },
    {
        "id": 67,
        "code": "لغات البرمجة/عملي",
        "name": "لغات البرمجة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "UR8",
        "color": "#7d7f5c"
    },
    {
        "id": 68,
        "code": "تطوير تطبيقات الموبايل",
        "name": "تطوير تطبيقات الموبايل",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "UR8",
        "color": "#749d4c"
    },
    {
        "id": 69,
        "code": "تطبيقات الإنترنت",
        "name": "تطبيقات الإنترنت",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ماهر صارم",
        "day": "السبت",
        "time": "13:00 - 15:30",
        "room": "UR8",
        "color": "#cacc7b"
    },
    {
        "id": 70,
        "code": "بنيان الحواسيب/2ش1",
        "name": "بنيان الحواسيب/2ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "UR9",
        "color": "#ba235e"
    },
    {
        "id": 71,
        "code": "بنيان الحواسيب/2ش2",
        "name": "بنيان الحواسيب/2ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "UR9",
        "color": "#465423"
    },
    {
        "id": 72,
        "code": "بنيان الحواسيب/2ش3",
        "name": "بنيان الحواسيب/2ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "UR9",
        "color": "#c50aca"
    },
    {
        "id": 73,
        "code": "البرمجة3/عملي ف11",
        "name": "البرمجة3/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#3767e3"
    },
    {
        "id": 74,
        "code": "البرمجة3/عملي ف21",
        "name": "البرمجة3/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#c28c28"
    },
    {
        "id": 75,
        "code": "البرمجة3/عملي ف12",
        "name": "البرمجة3/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#699b2f"
    },
    {
        "id": 76,
        "code": "البرمجة3/عملي ف22",
        "name": "البرمجة3/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. الحسين طفيلية",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#4d110e"
    },
    {
        "id": 77,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف11",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#db2cda"
    },
    {
        "id": 78,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف21",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#d48870"
    },
    {
        "id": 79,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف12",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#bfe51a"
    },
    {
        "id": 80,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف22 د اة صالح/م. رفاه سنجقدار",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف22 د اة صالح/م. رفاه سنجقدار",
        "type": "lab",
        "credits": 0,
        "instructor": "د.فتاة صالح / م.رفاه سنجقدار",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#378022"
    },
    {
        "id": 81,
        "code": "البرمجة بلغة بايثون/ عملي ف11",
        "name": "البرمجة بلغة بايثون/ عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#9cb35a"
    },
    {
        "id": 82,
        "code": "البرمجة بلغة بايثون/ عملي ف21",
        "name": "البرمجة بلغة بايثون/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#ab1c87"
    },
    {
        "id": 83,
        "code": "البرمجة بلغة بايثون/عملي ف12",
        "name": "البرمجة بلغة بايثون/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#c3ed27"
    },
    {
        "id": 84,
        "code": "البرمجة بلغة بايثون/عملي ف22",
        "name": "البرمجة بلغة بايثون/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. تقى الزعبي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#cf6aea"
    },
    {
        "id": 85,
        "code": "البرمجة2/عملي ف11",
        "name": "البرمجة2/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#cdce97"
    },
    {
        "id": 86,
        "code": "البرمجة2/عملي ف21",
        "name": "البرمجة2/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#5103ab"
    },
    {
        "id": 87,
        "code": "البرمجة2/عملي ف21",
        "name": "البرمجة2/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#55135b"
    },
    {
        "id": 88,
        "code": "البرمجة2/عملي ف22",
        "name": "البرمجة2/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هديل عسراوي",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#d4e3d2"
    },
    {
        "id": 89,
        "code": "نظم التشغيل1/عملي ف11",
        "name": "نظم التشغيل1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#37536f"
    },
    {
        "id": 90,
        "code": "نظم التشغيل1/عملي ف21",
        "name": "نظم التشغيل1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#48ff60"
    },
    {
        "id": 91,
        "code": "نظم التشغيل1/عملي ف12",
        "name": "نظم التشغيل1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#98aab8"
    },
    {
        "id": 92,
        "code": "نظم التشغيل1/عملي ف22",
        "name": "نظم التشغيل1/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. فراس ختر بك / م.موفق العضل",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#93bd1c"
    },
    {
        "id": 93,
        "code": "أساسيات قواعد البيانات/عملي ف11",
        "name": "أساسيات قواعد البيانات/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#a4d15e"
    },
    {
        "id": 94,
        "code": "أساسيات قواعد البيانات/ عملي ف21",
        "name": "أساسيات قواعد البيانات/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رنان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#51f485"
    },
    {
        "id": 95,
        "code": "أساسيات قواعد البيانات/عملي ف12",
        "name": "أساسيات قواعد البيانات/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#6f723b"
    },
    {
        "id": 96,
        "code": "أساسيات قواعد البيانات/عملي ف22",
        "name": "أساسيات قواعد البيانات/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#af47a6"
    },
    {
        "id": 97,
        "code": "أمن نظم قواعد البيانات/عملي ف11",
        "name": "أمن نظم قواعد البيانات/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#38fce6"
    },
    {
        "id": 98,
        "code": "أمن نظم قواعد البيانات/عملي ف21",
        "name": "أمن نظم قواعد البيانات/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#82d8aa"
    },
    {
        "id": 99,
        "code": "أساسيات أمن الحواسيب/عملي ف11",
        "name": "أساسيات أمن الحواسيب/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#7af244"
    },
    {
        "id": 100,
        "code": "أساسيات أمن الحواسيب/عملي ف21",
        "name": "أساسيات أمن الحواسيب/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.أحمد شيخه",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#3deda6"
    },
    {
        "id": 101,
        "code": "1 النظم الموزعة والحوسبة السحابية/عملي ف11",
        "name": "1 النظم الموزعة والحوسبة السحابية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#7861e2"
    },
    {
        "id": 102,
        "code": "النظم المورّعة والحوسبة السحابية/عملي ف21",
        "name": "النظم المورّعة والحوسبة السحابية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#345530"
    },
    {
        "id": 103,
        "code": "نظم التشغيل1/عملي ف31",
        "name": "نظم التشغيل1/عملي ف31",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#4d0436"
    },
    {
        "id": 104,
        "code": "إدارة المخاطر والامتثال/عملي",
        "name": "إدارة المخاطر والامتثال/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. نبيل القادري / م. جعفر محفوض",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#b414d7"
    },
    {
        "id": 105,
        "code": "أساسيات قواعد البيانات/عملي ف13",
        "name": "أساسيات قواعد البيانات/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#63f661"
    },
    {
        "id": 106,
        "code": "أساسيات قواعد البيانات/عملي ف23",
        "name": "أساسيات قواعد البيانات/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#ca94e1"
    },
    {
        "id": 107,
        "code": "أساسيات قواعد البيانات/عملي ف14",
        "name": "أساسيات قواعد البيانات/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#50f219"
    },
    {
        "id": 108,
        "code": "أساسيات قواعد البيانات/عملي ف24",
        "name": "أساسيات قواعد البيانات/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزابى اليوسف / م. فرح فارس",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#b90c76"
    },
    {
        "id": 109,
        "code": "الدارات الكهربائية1/عملي ف11",
        "name": "الدارات الكهربائية1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ELC",
        "color": "#70a636"
    },
    {
        "id": 110,
        "code": "الدارات الكهربائية1/عملي ف21",
        "name": "الدارات الكهربائية1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ELC",
        "color": "#62552f"
    },
    {
        "id": 111,
        "code": "الدارات الكهربائية1/عملي ف12",
        "name": "الدارات الكهربائية1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-ELC",
        "color": "#35f2c4"
    },
    {
        "id": 112,
        "code": "الدارات ف22",
        "name": "الدارات ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-ELC",
        "color": "#4d8b28"
    },
    {
        "id": 113,
        "code": "معالجة الإشارة الرقمية/عملي",
        "name": "معالجة الإشارة الرقمية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#d0041b"
    },
    {
        "id": 114,
        "code": "الدارات الإلكترونية1/عملي ف1",
        "name": "الدارات الإلكترونية1/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "د. ولاء سفور",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-AT",
        "color": "#3fb61f"
    },
    {
        "id": 115,
        "code": "بنيان الحواسيب1/عملي ف11 د. هبة الله الخضور/ م. محسن سكر",
        "name": "بنيان الحواسيب1/عملي ف11 د. هبة الله الخضور/ م. محسن سكر",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-CA",
        "color": "#a7070f"
    },
    {
        "id": 116,
        "code": "بنيان الحواسيب1/عملي ف21",
        "name": "بنيان الحواسيب1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر بنيان الحواسيب1 / عملي ف12",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-CA",
        "color": "#ca45bb"
    },
    {
        "id": 117,
        "code": "بنيان الحواسيب1/عملي ف12",
        "name": "بنيان الحواسيب1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر",
        "day": "السبت",
        "time": "11:20 - 13:00",
        "room": "AI-L-CA",
        "color": "#94f202"
    },
    {
        "id": 118,
        "code": "بنيان الحواسيب1/عملي ف22 د. هبة الله الخضور/ م. محسن سكر",
        "name": "بنيان الحواسيب1/عملي ف22 د. هبة الله الخضور/ م. محسن سكر",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر",
        "day": "السبت",
        "time": "13:00 - 14:40",
        "room": "AI-L-CA",
        "color": "#65c4c6"
    },
    {
        "id": 119,
        "code": "مدخل إلى الروبوتية/عملي ف1",
        "name": "مدخل إلى الروبوتية/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#bd328b"
    },
    {
        "id": 120,
        "code": "مدخل إلى الروبوتية/عملي ف2",
        "name": "مدخل إلى الروبوتية/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "السبت",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#42d7e5"
    },
    {
        "id": 121,
        "code": "الكيمياء الحيوية/عملي",
        "name": "الكيمياء الحيوية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "أيمن هدبة",
        "day": "السبت",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#b51953"
    },
    {
        "id": 122,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش4",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-01",
        "color": "#590560"
    },
    {
        "id": 123,
        "code": "مدخل إلى الخوارزميات والبرمجة/ش3",
        "name": "مدخل إلى الخوارزميات والبرمجة/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-01",
        "color": "#a68e0d"
    },
    {
        "id": 124,
        "code": "مدخل إلى تعلم الآلة/ش2",
        "name": "مدخل إلى تعلم الآلة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-01",
        "color": "#c86189"
    },
    {
        "id": 125,
        "code": "هندسة البرمجيات المتقدمة",
        "name": "هندسة البرمجيات المتقدمة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-01",
        "color": "#33b4dc"
    },
    {
        "id": 126,
        "code": "مدخل إلى تعلم الآلة/ش1",
        "name": "مدخل إلى تعلم الآلة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-02",
        "color": "#7e78c5"
    },
    {
        "id": 127,
        "code": "جوانب عملية في تعلم الآلة والتعلّم العميق/عملي",
        "name": "جوانب عملية في تعلم الآلة والتعلّم العميق/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#c0a115"
    },
    {
        "id": 128,
        "code": "معالجة اللغات الطبيعية/عملي",
        "name": "معالجة اللغات الطبيعية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#b48b77"
    },
    {
        "id": 129,
        "code": "الذكاء العملي/عملي",
        "name": "الذكاء العملي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#8fd03a"
    },
    {
        "id": 130,
        "code": "معالجة اللغات الطبيعية",
        "name": "معالجة اللغات الطبيعية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبكيي",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-03",
        "color": "#c08bb6"
    },
    {
        "id": 131,
        "code": "البرمجة بلغة بايثون/ش4",
        "name": "البرمجة بلغة بايثون/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبكي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-03",
        "color": "#d39c8c"
    },
        {
        "id": 132,
        "code": "البرمجة بلغة بايثون/ش5",
        "name": "البرمجة بلغة بايثون/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام النبكي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-03",
        "color": "#dd5b79"
    },
    {
        "id": 133,
        "code": "هندسة البرمجيات",
        "name": "هندسة البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-03",
        "color": "#c28d23"
    },
    {
        "id": 134,
        "code": "نظرية الحوسبة/ش1",
        "name": "نظرية الحوسبة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-04",
        "color": "#cfa9dc"
    },
    {
        "id": 135,
        "code": "مدخل إلى هندسة البرمجيات/ش1",
        "name": "مدخل إلى هندسة البرمجيات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-04",
        "color": "#a22c29"
    },
    {
        "id": 136,
        "code": "مدخل إلى هندسة البرمجيات/ش2",
        "name": "مدخل إلى هندسة البرمجيات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-04",
        "color": "#527f68"
    },
    {
        "id": 137,
        "code": "مدخل إلى الذكاء الصنعي/ش1",
        "name": "مدخل إلى الذكاء الصنعي/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-05",
        "color": "#6b2ba2"
    },
    {
        "id": 138,
        "code": "مدخل إلى الذكاء الصنعي/ش2",
        "name": "مدخل إلى الذكاء الصنعي/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-05",
        "color": "#bcf662"
    },
    {
        "id": 139,
        "code": "مدخل إلى التعلم العميق/عملي",
        "name": "مدخل إلى التعلم العميق/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#68e55e"
    },
    {
        "id": 140,
        "code": "الاتصالات النقالة واللاسلكية/ش1",
        "name": "الاتصالات النقالة واللاسلكية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-05",
        "color": "#56bf77"
    },
    {
        "id": 141,
        "code": "كشف التطفل وإدارة الاختراقات",
        "name": "كشف التطفل وإدارة الاختراقات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-06",
        "color": "#cf02ce"
    },
    {
        "id": 142,
        "code": "أمن نظم التشغيل/ش1",
        "name": "أمن نظم التشغيل/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-06",
        "color": "#b04b6d"
    },
    {
        "id": 143,
        "code": "برمجة التطبيقات الشبكية/عملي ف1",
        "name": "برمجة التطبيقات الشبكية/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. فواز عفاش",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-06",
        "color": "#5b9a86"
    },
    {
        "id": 144,
        "code": "برمجة التطبيقات الشبكية/عملي ف2",
        "name": "برمجة التطبيقات الشبكية/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. فواز عفاش",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-06",
        "color": "#be438d"
    },
    {
        "id": 145,
        "code": "نظم التشغيل1/ش2",
        "name": "نظم التشغيل1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-07",
        "color": "#a7eeee"
    },
    {
        "id": 146,
        "code": "النظم الموزعة والحوسبة السحابية/ش2",
        "name": "النظم الموزعة والحوسبة السحابية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-07",
        "color": "#a530da"
    },
    {
        "id": 147,
        "code": "نظم التشغيل1/ش 3",
        "name": "نظم التشغيل1/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-07",
        "color": "#a1989d"
    },
    {
        "id": 148,
        "code": "الخوارزميات وبنى المعطيات/ش3",
        "name": "الخوارزميات وبنى المعطيات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. سعيد دياب",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-08",
        "color": "#c98266"
    },
    {
        "id": 149,
        "code": "الخوارزميات وبنى المعطيات/ش4",
        "name": "الخوارزميات وبنى المعطيات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. سعيد دياب",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-08",
        "color": "#781be1"
    },
    {
        "id": 150,
        "code": "الخوارزميات وبنى المعطيات/ش5",
        "name": "الخوارزميات وبنى المعطيات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. سعيد دياب",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#5b77ea"
    },
    {
        "id": 151,
        "code": "المعادلات التفاضلية والتحويلات/ش1",
        "name": "المعادلات التفاضلية والتحويلات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-09",
        "color": "#3ae3df"
    },
    {
        "id": 152,
        "code": "المعادلات التفاضلية والتحويلات/ش2",
        "name": "المعادلات التفاضلية والتحويلات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-09",
        "color": "#86ee1f"
    },
    {
        "id": 153,
        "code": "تراسل البيانات/ش1",
        "name": "تراسل البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#917afe"
    },
    {
        "id": 154,
        "code": "التحليل الرياضي1/ش1",
        "name": "التحليل الرياضي1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-10",
        "color": "#d5281d"
    },
    {
        "id": 155,
        "code": "التحليل الرياضي 1/ش 2",
        "name": "التحليل الرياضي 1/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#c033b5"
    },
    {
        "id": 156,
        "code": "التحليل الرياضي 2/ش2",
        "name": "التحليل الرياضي 2/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#9b0f3d"
    },
    {
        "id": 157,
        "code": "الروبوتية النقالة",
        "name": "الروبوتية النقالة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-11",
        "color": "#be7bf2"
    },
    {
        "id": 158,
        "code": "النظم الروبوتية",
        "name": "النظم الروبوتية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-11",
        "color": "#5a9e74"
    },
    {
        "id": 159,
        "code": "أمن نظم قواعد البيانات/ش1",
        "name": "أمن نظم قواعد البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-11",
        "color": "#37d13f"
    },
    {
        "id": 160,
        "code": "نظم المعلومات الإدارية//ش1",
        "name": "نظم المعلومات الإدارية//ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-11",
        "color": "#6269eb"
    },
    {
        "id": 161,
        "code": "نظم قواعد البيانات/ش1",
        "name": "نظم قواعد البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-12",
        "color": "#37e313"
    },
    {
        "id": 162,
        "code": "نظم قواعد البيانات/ش2",
        "name": "نظم قواعد البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-12",
        "color": "#90aafe"
    },
    {
        "id": 163,
        "code": "أسس نظم الاتصالات",
        "name": "أسس نظم الاتصالات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-12",
        "color": "#a14bec"
    },
    {
        "id": 164,
        "code": "هندسة الأمواج المكروية",
        "name": "هندسة الأمواج المكروية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل / م.يزن أبو رافع",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-12",
        "color": "#570179"
    },
    {
        "id": 165,
        "code": "قواعد البيانات المتقدمة/رش1",
        "name": "قواعد البيانات المتقدمة/رش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-13",
        "color": "#47379f"
    },
    {
        "id": 166,
        "code": "إدارة الشبكات الحاسوبية",
        "name": "إدارة الشبكات الحاسوبية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-13",
        "color": "#9ccce9"
    },
    {
        "id": 167,
        "code": "بروتوكولات الشبكات الحاسوبية",
        "name": "بروتوكولات الشبكات الحاسوبية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-13",
        "color": "#c26082"
    },
    {
        "id": 168,
        "code": "الفيزياء1/ش 2",
        "name": "الفيزياء1/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-14",
        "color": "#5cb77a"
    },
    {
        "id": 169,
        "code": "الإنكليزية للمهندسين/ش1",
        "name": "الإنكليزية للمهندسين/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-14",
        "color": "#d192c0"
    },
    {
        "id": 170,
        "code": "الفيزياء 2/ش 1",
        "name": "الفيزياء 2/ش 1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-14",
        "color": "#92ab71"
    },
    {
        "id": 171,
        "code": "الفيزياء 1/ش 1",
        "name": "الفيزياء 1/ش 1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-14",
        "color": "#399840"
    },
    {
        "id": 172,
        "code": "نماذج نضج البرمجيات",
        "name": "نماذج نضج البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-15",
        "color": "#74a60a"
    },
    {
        "id": 173,
        "code": "البرمجة1/ش1",
        "name": "البرمجة1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية يجب",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-15",
        "color": "#c1644d"
    },
    {
        "id": 174,
        "code": "نظم الزمن الحقيقي",
        "name": "نظم الزمن الحقيقي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-16",
        "color": "#b2a9ab"
    },
    {
        "id": 175,
        "code": "نظم الزمن الحقيقي/عملي",
        "name": "نظم الزمن الحقيقي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. يزن أب رافع",
        "day": "الأحد",
        "time": "09:40 - 10:30",
        "room": "AI-16",
        "color": "#5a6850"
    },
    {
        "id": 176,
        "code": "التحليل الرياضي 2/ش1",
        "name": "التحليل الرياضي 2/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الأحد",
        "time": "10:30 - 13:00",
        "room": "AI-16",
        "color": "#7ebf99"
    },
    {
        "id": 177,
        "code": "الجبر الخطي ونظرية المصفوفات/ش4",
        "name": "الجبر الخطي ونظرية المصفوفات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-16",
        "color": "#6e4d4a"
    },
    {
        "id": 178,
        "code": "الرياضيات المتقطعة/ش5",
        "name": "الرياضيات المتقطعة/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الأحد",
        "time": "08:00 - 10:30",
        "room": "AI-17",
        "color": "#7f3e22"
    },
    {
        "id": 179,
        "code": "بنيان الحواسيب 2/ش4",
        "name": "بنيان الحواسيب 2/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-17",
        "color": "#b39c5f"
    },
    {
        "id": 180,
        "code": "الرياضيات (الفيزياء) الترميمية/عملي ف5",
        "name": "الرياضيات (الفيزياء) الترميمية/عملي ف5",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-17",
        "color": "#902129"
    },
        {
        "id": 181,
        "code": "إدارة المشاريع/رش1",
        "name": "إدارة المشاريع/رش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-18",
        "color": "#c652cf"
    },
    {
        "id": 182,
        "code": "أمن الشبكات",
        "name": "أمن الشبكات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-18",
        "color": "#953fa7"
    },
    {
        "id": 183,
        "code": "إدارة المشاريع//ش2",
        "name": "إدارة المشاريع//ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-18",
        "color": "#9153b1"
    },
    {
        "id": 184,
        "code": "نظم الوسائط المتعددة",
        "name": "نظم الوسائط المتعددة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-18",
        "color": "#3bd167"
    },
    {
        "id": 185,
        "code": "تصميم الدارات ذات التكامل الوسيع النطاق",
        "name": "تصميم الدارات ذات التكامل الوسيع النطاق",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-SEC-1",
        "color": "#6b27ac"
    },
    {
        "id": 186,
        "code": "تصميم الدارات ذات التكامل الوسيع النطاق/عملي",
        "name": "تصميم الدارات ذات التكامل الوسيع النطاق/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-SEC-1",
        "color": "#6ede3f"
    },
    {
        "id": 187,
        "code": "نظم التشغيل الموزعة",
        "name": "نظم التشغيل الموزعة",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-SEC-1",
        "color": "#a7f32d"
    },
    {
        "id": 188,
        "code": "تقانات الاتصالات الحديثة",
        "name": "تقانات الاتصالات الحديثة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحماتي",
        "day": "الأحد",
        "time": "13:00 - 15:30",
        "room": "AI-SEC-1",
        "color": "#a14e21"
    },
    {
        "id": 189,
        "code": "الميكانيك النظري",
        "name": "الميكانيك النظري",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-ACN-1",
        "color": "#5b8bcb"
    },
    {
        "id": 190,
        "code": "الميكانيك النظري/عملي",
        "name": "الميكانيك النظري/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-ACN-1",
        "color": "#916b38"
    },
    {
        "id": 191,
        "code": "الميكانيك والآلات",
        "name": "الميكانيك والآلات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-ACN-1",
        "color": "#b5ce3f"
    },
    {
        "id": 192,
        "code": "الميكانيك والآلات/عملي",
        "name": "الميكانيك والآلات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. حسين تينه",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-ACN-1",
        "color": "#6eb75a"
    },
    {
        "id": 193,
        "code": "الإرمجة بلغة بايثون/ عملي ف15",
        "name": "الإرمجة بلغة بايثون/ عملي ف15",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#cf1d89"
    },
    {
        "id": 194,
        "code": "البرمجة بلغة بايثون/ عملي ف25",
        "name": "البرمجة بلغة بايثون/ عملي ف25",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#bb98bf"
    },
    {
        "id": 195,
        "code": "تطوير تطبيقات الموبايل/عملي",
        "name": "تطوير تطبيقات الموبايل/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي بليدي / م. هديل عسراوي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#616bc8"
    },
    {
        "id": 196,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي قديم ف1",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي قديم ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية رجب / م. هديل عسراوي",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#dcec74"
    },
    {
        "id": 197,
        "code": "البرمجة1/عملي ف11",
        "name": "البرمجة1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هبة ريمان",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#c9d428"
    },
    {
        "id": 198,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف14",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. هبة ريمان",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#ccdef1"
    },
    {
        "id": 199,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف13",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#a9e1a7"
    },
    {
        "id": 200,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف23",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#57d03c"
    },
    {
        "id": 201,
        "code": "بنيان الحواسيب2/عملي ف11",
        "name": "بنيان الحواسيب2/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#3a386c"
    },
    {
        "id": 202,
        "code": "بنيان الحواسيب2/عملي ف21",
        "name": "بنيان الحواسيب2/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#c44215"
    },
    {
        "id": 203,
        "code": "أمن نظم قواعد البيانات/ عملي ف12",
        "name": "أمن نظم قواعد البيانات/ عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. فرح فارس",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#77b532"
    },
    {
        "id": 204,
        "code": "أمن نظم قواعد البيانات/عملي ف22",
        "name": "أمن نظم قواعد البيانات/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمد الشايطة / م. فرح فارس",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#830cf9"
    },
    {
        "id": 205,
        "code": "شبكات الحاسوب/عملي ف11",
        "name": "شبكات الحاسوب/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فواز عفاش",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#a5677b"
    },
    {
        "id": 206,
        "code": "شبكات الحاسوب/عملي ف21",
        "name": "شبكات الحاسوب/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فواز عفاش",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#8517d6"
    },
    {
        "id": 207,
        "code": "شبكات الحاسوب/عملي ف12",
        "name": "شبكات الحاسوب/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. نغم الأشقر",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#b2f0c3"
    },
    {
        "id": 208,
        "code": "شبكات الحاسوب/عملي ف22",
        "name": "شبكات الحاسوب/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. نغم الأشقر",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#b6b9e1"
    },
    {
        "id": 209,
        "code": "أمن الاتصالات/عملي",
        "name": "أمن الاتصالات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / نغم الأشقر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#44c75a"
    },
    {
        "id": 210,
        "code": "البرمجة1/عملي ف21",
        "name": "البرمجة1/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية رجب / م. هديل عسراوي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#94b27d"
    },
    {
        "id": 211,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف13",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#aa8fc0"
    },
    {
        "id": 212,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف23",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د. فتاة صالح / م. رفاه سنجقدار",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#a19fa2"
    },
    {
        "id": 213,
        "code": "قواعد البيانات المتقدمة/عملي ف11",
        "name": "قواعد البيانات المتقدمة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. زينب بغدادي",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#b6be96"
    },
    {
        "id": 214,
        "code": "قواعد البيانات المتقدمة/عملي ف21",
        "name": "قواعد البيانات المتقدمة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. زينب بغدادي",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#66272b"
    },
    {
        "id": 215,
        "code": "قواعد البيانات المتقدمة/عملي ف12",
        "name": "قواعد البيانات المتقدمة/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#a86efb"
    },
    {
        "id": 216,
        "code": "قواعد البيانات المتقدمة/عملي ف22",
        "name": "قواعد البيانات المتقدمة/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#3d90b0"
    },
    {
        "id": 217,
        "code": "نظم التشغيل2/عملي ف1",
        "name": "نظم التشغيل2/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. جعفر محفوض",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#7c2b9d"
    },
    {
        "id": 218,
        "code": "نظم التشغيل2/عملي ف2",
        "name": "نظم التشغيل2/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسام الخطيب / م. جعفر محفوض",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#56cfa8"
    },
    {
        "id": 219,
        "code": "التعمية التطبيقية/عمار",
        "name": "التعمية التطبيقية/عمار",
        "type": "lab",
        "credits": 0,
        "instructor": "د. نبيل القادري / م. جعفر محفوض",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#39b460"
    },
    {
        "id": 220,
        "code": "أساسيات أمن الحواسيب/عملي ف12",
        "name": "أساسيات أمن الحواسيب/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي / م. جعفر محفوض",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#a830ba"
    },
    {
        "id": 221,
        "code": "برمجة نظم التشغيل (برمجة النظم)/عملي ف11",
        "name": "برمجة نظم التشغيل (برمجة النظم)/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#7ade65"
    },
    {
        "id": 222,
        "code": "برمجة نظم التشغيل (برمجة النظم)/عملي ف21",
        "name": "برمجة نظم التشغيل (برمجة النظم)/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#be3f03"
    },
    {
        "id": 223,
        "code": "نظم التشغيل1/عملي ف13",
        "name": "نظم التشغيل1/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. موفق العضل",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#7df37e"
    },
    {
        "id": 224,
        "code": "نظم التشغيل1/عملي ف23",
        "name": "نظم التشغيل1/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. موفق العضل",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#da6395"
    },
    {
        "id": 225,
        "code": "البرمجة بلغة بايثون/عملي ف13",
        "name": "البرمجة بلغة بايثون/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي / م. الحسين طفيلية",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#cae368"
    },
    {
        "id": 226,
        "code": "البرمجة بلغة بايثون/ عملي ف23",
        "name": "البرمجة بلغة بايثون/ عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د. آصف جعفر / م. الحسين طفيلية / عملي ف14",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#dd5d59"
    },
    {
        "id": 227,
        "code": "البرمجة بلغة بايثون/عملي ف14",
        "name": "البرمجة بلغة بايثون/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. زينب بغدادي",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#d24509"
    },
    {
        "id": 228,
        "code": "البرمجة بلغة بايثون/عملي ف24",
        "name": "البرمجة بلغة بايثون/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. زينب بغدادي",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#a60a2f"
    },
    {
        "id": 229,
        "code": "الدارات المنطقية/عملي ف11",
        "name": "الدارات المنطقية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ELC",
        "color": "#7dd835"
    },
    {
        "id": 230,
        "code": "الدارات المنطقية/عملي ف21",
        "name": "الدارات المنطقية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ELC",
        "color": "#994d48"
    },
    {
        "id": 231,
        "code": "الدارات المنطقية/عملي ف12",
        "name": "الدارات المنطقية/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م.لجين أسعد",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ELC",
        "color": "#612fe3"
    },
    {
        "id": 232,
        "code": "الدارات المنطقية/عملي ف22",
        "name": "الدارات المنطقية/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م.لجين أسعد",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ELC",
        "color": "#d1cd14"
    },
    {
        "id": 233,
        "code": "مدخل إلى الإلكترونيات/عملي ف1",
        "name": "مدخل إلى الإلكترونيات/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-AT",
        "color": "#bc7a2e"
    },
    {
        "id": 234,
        "code": "الدارات الإلكترونية1/عملي ف2",
        "name": "الدارات الإلكترونية1/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#aeac19"
    },
    {
        "id": 235,
        "code": "مدخل إلى الإلكترونيات/عملي ف2",
        "name": "مدخل إلى الإلكترونيات/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-AT",
        "color": "#76a6cb"
    },
    {
        "id": 236,
        "code": "بنيان الحواسيب1 /عملي ف13",
        "name": "بنيان الحواسيب1 /عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-CA",
        "color": "#3bef5b"
    },
    {
        "id": 237,
        "code": "بنيان الحواسيب1 /عملي ف23",
        "name": "بنيان الحواسيب1 /عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-CA",
        "color": "#bbdd19"
    },
    {
        "id": 238,
        "code": "نظرية التحكم/عملي",
        "name": "نظرية التحكم/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#9c2d14"
    },
    {
        "id": 239,
        "code": "الحساسات والتحسس/عملي",
        "name": "الحساسات والتحسس/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب / م. الحسين طفيلية",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#aad042"
    },
    {
        "id": 240,
        "code": "الحساسات والتحسس/عملي",
        "name": "الحساسات والتحسس/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب / م. الحسين طفيلية",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "AI-L-ROB",
        "color": "#7805ee"
    },
        {
        "id": 241,
        "code": "المتحكمات الصغرية والنظم المضمنة/عملي ف2",
        "name": "المتحكمات الصغرية والنظم المضمنة/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب / م. الحسين طفيلية",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "AI-L-ROB",
        "color": "#bab790"
    },
    {
        "id": 242,
        "code": "الفيزياء1 /عملي ف13",
        "name": "الفيزياء1 /عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الأحد",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#65590c"
    },
    {
        "id": 243,
        "code": "الفيزياء1/عملي ف22",
        "name": "الفيزياء1/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الأحد",
        "time": "09:40 - 11:20",
        "room": "PE-L2",
        "color": "#8cc442"
    },
    {
        "id": 244,
        "code": "الفيزياء1 /عملي ف23 PE-L2الفيزياء1 /عملي ق-ف1",
        "name": "الفيزياء1 /عملي ف23 PE-L2الفيزياء1 /عملي ق-ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "أ.محمد البيطار",
        "day": "الأحد",
        "time": "11:20 - 13:00",
        "room": "PE-L2",
        "color": "#b08a23"
    },
    {
        "id": 245,
        "code": "الفيزياء1 /عملي ف22",
        "name": "الفيزياء1 /عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "أ.محمد البيطار",
        "day": "الأحد",
        "time": "13:00 - 14:40",
        "room": "PE-L2",
        "color": "#d89411"
    },
    {
        "id": 246,
        "code": "الفيزياء1/عملي ف1",
        "name": "الفيزياء1/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الأحد",
        "time": "14:40 - 16:20",
        "room": "PE-L2",
        "color": "#60f135"
    },
    {
        "id": 247,
        "code": "الخوارزميات وبنى المعطيات1/ش1",
        "name": "الخوارزميات وبنى المعطيات1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-01",
        "color": "#993711"
    },
    {
        "id": 248,
        "code": "نظرية الحوسبة/ش2",
        "name": "نظرية الحوسبة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-01",
        "color": "#441a7f"
    },
    {
        "id": 249,
        "code": "توثيق بنى البرمجيات",
        "name": "توثيق بنى البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-01",
        "color": "#4b63f8"
    },
    {
        "id": 250,
        "code": "إدارة تشكيلة البرمجيات",
        "name": "إدارة تشكيلة البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مهيب النقري",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#6ff549"
    },
    {
        "id": 251,
        "code": "تطوير تطبيقات الويب",
        "name": "تطوير تطبيقات الويب",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#895e1d"
    },
    {
        "id": 252,
        "code": "الاختراق الأخلاقي والدفاع عن الأنظمة",
        "name": "الاختراق الأخلاقي والدفاع عن الأنظمة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#81494e"
    },
    {
        "id": 253,
        "code": "تقانات إحصائية في علوم البيانات/ش1",
        "name": "تقانات إحصائية في علوم البيانات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-03",
        "color": "#c66342"
    },
    {
        "id": 254,
        "code": "تراسل البيانات/ش 2",
        "name": "تراسل البيانات/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-03",
        "color": "#79a86b"
    },
    {
        "id": 255,
        "code": "تقانات إحصائية في علوم البيانات/ش2",
        "name": "تقانات إحصائية في علوم البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-03",
        "color": "#ba8bf8"
    },
    {
        "id": 256,
        "code": "أمن نظم التشغيل/ش 2",
        "name": "أمن نظم التشغيل/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسيم الجنيدي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-04",
        "color": "#694c84"
    },
    {
        "id": 257,
        "code": "أمن نظم قواعد البيانات/ش2",
        "name": "أمن نظم قواعد البيانات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-04",
        "color": "#99ada0"
    },
    {
        "id": 258,
        "code": "النظم الموزعة والحوسبة السحابية/ش3",
        "name": "النظم الموزعة والحوسبة السحابية/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-04",
        "color": "#c753da"
    },
    {
        "id": 259,
        "code": "نظم التشغيل1/ش4",
        "name": "نظم التشغيل1/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "م. فراس خير بك",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-04",
        "color": "#6b5ec1"
    },
    {
        "id": 260,
        "code": "نظرية المعلومات/ش1",
        "name": "نظرية المعلومات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-05",
        "color": "#7e0e33"
    },
    {
        "id": 261,
        "code": "برمجة التطبيقات الشبكية/ش1",
        "name": "برمجة التطبيقات الشبكية/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#855ea0"
    },
    {
        "id": 262,
        "code": "نظرية المعلومات/ش2",
        "name": "نظرية المعلومات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-05",
        "color": "#49e2f0"
    },
    {
        "id": 263,
        "code": "بنيان الحواسيب2/ش5",
        "name": "بنيان الحواسيب2/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-06",
        "color": "#a30541"
    },
    {
        "id": 264,
        "code": "مدخل إلى هندسة البرمجيات/ش3",
        "name": "مدخل إلى هندسة البرمجيات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-06",
        "color": "#60dd6b"
    },
    {
        "id": 265,
        "code": "مدخل إلى هندسة البرمجيات/ش4",
        "name": "مدخل إلى هندسة البرمجيات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-06",
        "color": "#4d5dd6"
    },
    {
        "id": 266,
        "code": "نظرية التحكم",
        "name": "نظرية التحكم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-07",
        "color": "#490979"
    },
    {
        "id": 267,
        "code": "نظم التحكم الرقمي",
        "name": "نظم التحكم الرقمي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-07",
        "color": "#b265b4"
    },
    {
        "id": 268,
        "code": "إدارة المؤسسات/ش1",
        "name": "إدارة المؤسسات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-07",
        "color": "#74e21c"
    },
    {
        "id": 269,
        "code": "إدارة المؤسسات/ش2",
        "name": "إدارة المؤسسات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عماد عيسى",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-07",
        "color": "#9d8910"
    },
    {
        "id": 270,
        "code": "الدارات الإلكترونية2",
        "name": "الدارات الإلكترونية2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-08",
        "color": "#d57421"
    },
    {
        "id": 271,
        "code": "الدارات المنطقية/ش2",
        "name": "الدارات المنطقية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-08",
        "color": "#668003"
    },
    {
        "id": 272,
        "code": "التعمية التطبيقية",
        "name": "التعمية التطبيقية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-08",
        "color": "#b08995"
    },
    {
        "id": 273,
        "code": "الرياضيات المتقطعة/ ش1",
        "name": "الرياضيات المتقطعة/ ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#514d3a"
    },
    {
        "id": 274,
        "code": "نظم قواعد البيانات/ش3",
        "name": "نظم قواعد البيانات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-09",
        "color": "#4aa902"
    },
    {
        "id": 275,
        "code": "نظم قواعد البيانات/ش4",
        "name": "نظم قواعد البيانات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مدين عبد الحميد",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-09",
        "color": "#ba22da"
    },
    {
        "id": 276,
        "code": "مهارات التواصل/ش1",
        "name": "مهارات التواصل/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-09",
        "color": "#8c0a70"
    },
    {
        "id": 277,
        "code": "نظم المعلومات الإدارية/ش2",
        "name": "نظم المعلومات الإدارية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#76c71b"
    },
    {
        "id": 278,
        "code": "نظرية الألعاب",
        "name": "نظرية الألعاب",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#bd528d"
    },
    {
        "id": 279,
        "code": "النظم الخبيرة",
        "name": "النظم الخبيرة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#b1bf44"
    },
    {
        "id": 280,
        "code": "إدارة الشبكات الحاسوبية وبروتوكولاتها",
        "name": "إدارة الشبكات الحاسوبية وبروتوكولاتها",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-11",
        "color": "#417a7b"
    },
    {
        "id": 281,
        "code": "شبكات الحاسوب/ش4",
        "name": "شبكات الحاسوب/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. طلال حمود",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-11",
        "color": "#9766af"
    },
    {
        "id": 282,
        "code": "الدارات الكهربائية 1/ش 1",
        "name": "الدارات الكهربائية 1/ش 1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحمد",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-11",
        "color": "#91ec8c"
    },
    {
        "id": 283,
        "code": "الإشارات والنظم",
        "name": "الإشارات والنظم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحمد",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-11",
        "color": "#53c083"
    },
    {
        "id": 284,
        "code": "تصميم المترجمات/ش1",
        "name": "تصميم المترجمات/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-12",
        "color": "#a5cf16"
    },
    {
        "id": 285,
        "code": "تصميم المترجمات/ش2",
        "name": "تصميم المترجمات/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-12",
        "color": "#7a14d2"
    },
    {
        "id": 286,
        "code": "تصميم المترجمات/ش3",
        "name": "تصميم المترجمات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-12",
        "color": "#a391cc"
    },
    {
        "id": 287,
        "code": "الجبر الخطي ونظرية المصفوفات/ش3",
        "name": "الجبر الخطي ونظرية المصفوفات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-13",
        "color": "#67a468"
    },
    {
        "id": 288,
        "code": "الجبر الخطي ونظرية المصفوفات/قديم ش2",
        "name": "الجبر الخطي ونظرية المصفوفات/قديم ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. ندى الطحان",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-13",
        "color": "#5b551b"
    },
    {
        "id": 289,
        "code": "المعادلات التفاضلية والتحويلات/ش3",
        "name": "المعادلات التفاضلية والتحويلات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-14",
        "color": "#bd47d2"
    },
    {
        "id": 290,
        "code": "المعادلات التفاضلية والتحويلات/ش4",
        "name": "المعادلات التفاضلية والتحويلات/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. علي سليمان",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-14",
        "color": "#498e54"
    },
    {
        "id": 291,
        "code": "التحليل الرياضي 2/ش3",
        "name": "التحليل الرياضي 2/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. زيذب خضر",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-14",
        "color": "#b4ac6d"
    },
    {
        "id": 292,
        "code": "مدخل إلى الإلكترونيات",
        "name": "مدخل إلى الإلكترونيات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-15",
        "color": "#b03112"
    },
    {
        "id": 293,
        "code": "الدارات الإلكترونية1/ش2",
        "name": "الدارات الإلكترونية1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-15",
        "color": "#380582"
    },
    {
        "id": 294,
        "code": "الاتصالات الرقمية",
        "name": "الاتصالات الرقمية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نضال زيدان",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-15",
        "color": "#5f3390"
    },
    {
        "id": 295,
        "code": "البرمجة2/ش1",
        "name": "البرمجة2/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية رجب",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-16",
        "color": "#a8a5ab"
    },
    {
        "id": 296,
        "code": "البرمجة 2 /ش 2",
        "name": "البرمجة 2 /ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية رجب",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-16",
        "color": "#be11cb"
    },
    {
        "id": 297,
        "code": "الفيزياء 1 4",
        "name": "الفيزياء 1 4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-16",
        "color": "#3de599"
    },
    {
        "id": 298,
        "code": "الفيزياء1/ش 3",
        "name": "الفيزياء1/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-16",
        "color": "#b7eb94"
    },
    {
        "id": 299,
        "code": "بنيان الحواسيب1/ش1",
        "name": "بنيان الحواسيب1/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. هبة الله الخضور",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-17",
        "color": "#bf75ec"
    },
    {
        "id": 300,
        "code": "بنيان الحواسيب1/ش2",
        "name": "بنيان الحواسيب1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. هبة الله الخضور",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-17",
        "color": "#aea4c6"
    },
        {
        "id": 301,
        "code": "التحليل الرياضي1/ش4",
        "name": "التحليل الرياضي1/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-18",
        "color": "#7aa679"
    },
    {
        "id": 302,
        "code": "التحليل الرياضي1/ه-ش1",
        "name": "التحليل الرياضي1/ه-ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عبد الرزاق الفاضل",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-18",
        "color": "#4b899f"
    },
    {
        "id": 303,
        "code": "الاتصالات النقالة واللاسلكية/ش2",
        "name": "الاتصالات النقالة واللاسلكية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-18",
        "color": "#4cfeed"
    },
    {
        "id": 304,
        "code": "الاتصالات الضوئية",
        "name": "الاتصالات الضوئية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الحمامي",
        "day": "الاثنين",
        "time": "09:40 - 12:10",
        "room": "AI-SEC-1",
        "color": "#afc0d5"
    },
    {
        "id": 305,
        "code": "أسس هندسة الرادار",
        "name": "أسس هندسة الرادار",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الاثنين",
        "time": "08:00 - 10:30",
        "room": "AI-ACN-1",
        "color": "#3ba07c"
    },
    {
        "id": 306,
        "code": "الدارات والنظم المكروية",
        "name": "الدارات والنظم المكروية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الاثنين",
        "time": "10:30 - 13:00",
        "room": "AI-ACN-1",
        "color": "#9ddf76"
    },
    {
        "id": 307,
        "code": "نظرية الحقول الكهرطيسية",
        "name": "نظرية الحقول الكهرطيسية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الاثنين",
        "time": "13:00 - 15:30",
        "room": "AI-ACN-1",
        "color": "#5305fb"
    },
    {
        "id": 308,
        "code": "نظم قواعد البيانات/عملي ف11",
        "name": "نظم قواعد البيانات/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م.عبد الرحمن عبد الرحمن / م.فرح فارس نظم قواعد البيانات / عملي ف21",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#90afe0"
    },
    {
        "id": 309,
        "code": "نظم قواعد البيانات/عملي ف21",
        "name": "نظم قواعد البيانات/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م.عبد الرحمن عبد الرحمن / م.فرح فارس",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#396178"
    },
    {
        "id": 310,
        "code": "النظم الموزعة والحوسبة السحابية/عملي ف12",
        "name": "النظم الموزعة والحوسبة السحابية/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#c51e22"
    },
    {
        "id": 311,
        "code": "النظم الموزعة والحوسبة السحابية/عملي ف22",
        "name": "النظم الموزعة والحوسبة السحابية/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#33d21a"
    },
    {
        "id": 312,
        "code": "معالجة الصور وتحليلها/عملي ف11",
        "name": "معالجة الصور وتحليلها/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#cfa137"
    },
    {
        "id": 313,
        "code": "معالجة الصور وتحليلها/عملي ف21",
        "name": "معالجة الصور وتحليلها/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. بغدادي",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#7ac126"
    },
    {
        "id": 314,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف11",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#72b6d0"
    },
    {
        "id": 315,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف21",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#68af9d"
    },
    {
        "id": 316,
        "code": "بنيان الحواسيب2/عملي ف12",
        "name": "بنيان الحواسيب2/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#bcda8d"
    },
    {
        "id": 317,
        "code": "بنيان الحواسيب2/عملي ف22",
        "name": "بنيان الحواسيب2/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#8416aa"
    },
    {
        "id": 318,
        "code": "بنيان الحواسيب2/عملي ف13",
        "name": "بنيان الحواسيب2/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#8cbb66"
    },
    {
        "id": 319,
        "code": "بنيان الحواسيب2/عملي ف23",
        "name": "بنيان الحواسيب2/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#976d5c"
    },
    {
        "id": 320,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف22",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فواز عفاش",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#a39abb"
    },
    {
        "id": 321,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف21",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فواز عفاش",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#49ddd9"
    },
    {
        "id": 322,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف12",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فرح فارس",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#d231b6"
    },
    {
        "id": 323,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف24",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م. فرح فارس",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#9a45f8"
    },
    {
        "id": 324,
        "code": "شبكات الحاسوب/عملي ف13",
        "name": "شبكات الحاسوب/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضل",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#7dd12a"
    },
    {
        "id": 325,
        "code": "شبكات الحاسوب/عملي ف23",
        "name": "شبكات الحاسوب/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضل",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#d5c33d"
    },
    {
        "id": 326,
        "code": "شبكات الحاسوب/عملي ف14",
        "name": "شبكات الحاسوب/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضل",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#34d5e2"
    },
    {
        "id": 327,
        "code": "شبكات الحاسوب/عملي ف24",
        "name": "شبكات الحاسوب/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م. موفق العضل",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#472f9c"
    },
    {
        "id": 328,
        "code": "مدخل إلى البيانات الكبيرة/عملي ف11",
        "name": "مدخل إلى البيانات الكبيرة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#410f59"
    },
    {
        "id": 329,
        "code": "مدخل إلى البيانات الكبيرة/عملي ف21",
        "name": "مدخل إلى البيانات الكبيرة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#4bcf71"
    },
    {
        "id": 330,
        "code": "نظم قواعد البيانات/عملي ف12",
        "name": "نظم قواعد البيانات/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#56d3e4"
    },
    {
        "id": 331,
        "code": "نظم قواعد البيانات/عملي ف22",
        "name": "نظم قواعد البيانات/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. هبة ريمان",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#b37d77"
    },
    {
        "id": 332,
        "code": "كشف التطفل وإدارة الاختراقات/عملي ف11",
        "name": "كشف التطفل وإدارة الاختراقات/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#ce4aba"
    },
    {
        "id": 333,
        "code": "كشف التطفل وإدارة الإختراقات/عملي ف21",
        "name": "كشف التطفل وإدارة الإختراقات/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م. نغم الأشقر",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#db2848"
    },
    {
        "id": 334,
        "code": "أمن الشبكات والأمن السيبراني/ عملي",
        "name": "أمن الشبكات والأمن السيبراني/ عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#54b879"
    },
    {
        "id": 335,
        "code": "أمن الشبكات/عملي",
        "name": "أمن الشبكات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#3e5b91"
    },
    {
        "id": 336,
        "code": "نظم التشغيل1/عملي ف14",
        "name": "نظم التشغيل1/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#62a5f1"
    },
    {
        "id": 337,
        "code": "نظم التشغيل1/عملي ف24",
        "name": "نظم التشغيل1/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م.عبد الرحمن عرار",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#3ccfe2"
    },
    {
        "id": 338,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف14",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#92d3ed"
    },
    {
        "id": 339,
        "code": "مدخل إلى الذكاء الاصطناعي/عملي ف24",
        "name": "مدخل إلى الذكاء الاصطناعي/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مجدي سكر / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#701619"
    },
    {
        "id": 340,
        "code": "مدخل إلى تعلم الآلة/عملي ف11",
        "name": "مدخل إلى تعلم الآلة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#658c4f"
    },
    {
        "id": 341,
        "code": "مدخل إلى تعلم الآلة/عملي ف21",
        "name": "مدخل إلى تعلم الآلة/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي / م. تقى الزعبي",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#4d64af"
    },
    {
        "id": 342,
        "code": "مدخل إلى تعلم الآلة/عملي ف12",
        "name": "مدخل إلى تعلم الآلة/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#918d75"
    },
    {
        "id": 343,
        "code": "مدخل إلى تعلم الآلة/عملي ف22",
        "name": "مدخل إلى تعلم الآلة/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. وسام السحلي",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#553814"
    },
    {
        "id": 344,
        "code": "الدارات المنطقية/عملي ف13",
        "name": "الدارات المنطقية/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ELC",
        "color": "#7b4993"
    },
    {
        "id": 345,
        "code": "الدارات المنطقية/عملي ف23",
        "name": "الدارات المنطقية/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. عدي عباس",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ELC",
        "color": "#83730a"
    },
    {
        "id": 346,
        "code": "الدارات الإلكترونية2/ف1",
        "name": "الدارات الإلكترونية2/ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#a08307"
    },
    {
        "id": 347,
        "code": "الدارات الإلكترونية2/ف2",
        "name": "الدارات الإلكترونية2/ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-AT",
        "color": "#ba87ad"
    },
    {
        "id": 348,
        "code": "الاتصالات الرقمية/عملي",
        "name": "الاتصالات الرقمية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-AT",
        "color": "#c42279"
    },
    {
        "id": 349,
        "code": "بنيان الحواسيب1/عملي ف14",
        "name": "بنيان الحواسيب1/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-CA",
        "color": "#b0125e"
    },
    {
        "id": 350,
        "code": "بنيان الحواسيب1/عملي ف24",
        "name": "بنيان الحواسيب1/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "د. هبة الله الخضور / م.محسن سكر",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "AI-L-CA",
        "color": "#4df3ab"
    },
    {
        "id": 351,
        "code": "المتحكمات المنطقية القابلة للبرمجة/عملي",
        "name": "المتحكمات المنطقية القابلة للبرمجة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#50f04a"
    },
    {
        "id": 352,
        "code": "النظم الروبوتية/عملي",
        "name": "النظم الروبوتية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#67405c"
    },
    {
        "id": 353,
        "code": "الروبوتية النقالة/عملي",
        "name": "الروبوتية النقالة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "AI-L-ROB",
        "color": "#b1bf3f"
    },
    {
        "id": 354,
        "code": "الفيزياء2/عملي ف12",
        "name": "الفيزياء2/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الاثنين",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#d94582"
    },
    {
        "id": 355,
        "code": "الفيزياء1/عملي ف11",
        "name": "الفيزياء1/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الاثنين",
        "time": "09:40 - 11:20",
        "room": "PE-L2",
        "color": "#8777cb"
    },
    {
        "id": 356,
        "code": "الفيزياء 2/ عملي ف11",
        "name": "الفيزياء 2/ عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الاثنين",
        "time": "11:20 - 13:00",
        "room": "PE-L2",
        "color": "#bb738d"
    },
    {
        "id": 357,
        "code": "الفيزياء1/عملي ف14",
        "name": "الفيزياء1/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الاثنين",
        "time": "13:00 - 14:40",
        "room": "PE-L2",
        "color": "#70e926"
    },
    {
        "id": 358,
        "code": "الفيزياء.1/عملي ق-ف2",
        "name": "الفيزياء.1/عملي ق-ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. محمد البيطار",
        "day": "الاثنين",
        "time": "14:40 - 16:20",
        "room": "PE-L2",
        "color": "#55ff7f"
    },
    {
        "id": 359,
        "code": "إدارة المخاطر والامتثال",
        "name": "إدارة المخاطر والامتثال",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-01",
        "color": "#9e50d3"
    },
    {
        "id": 360,
        "code": "الرياضيات المتقطعة/قديم ش1",
        "name": "الرياضيات المتقطعة/قديم ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الثلاثاء",
        "time": "09:40 - 12:10",
        "room": "AI-01",
        "color": "#7d2ba3"
    },
        {
        "id": 361,
        "code": "الرياضيات المتقطعة/قديم ش2",
        "name": "الرياضيات المتقطعة/قديم ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل القادري",
        "day": "الثلاثاء",
        "time": "12:10 - 14:40",
        "room": "AI-01",
        "color": "#4e0e49"
    },
    {
        "id": 362,
        "code": "جوانب عملية في تعلم الآلة والتعلّم العميق",
        "name": "جوانب عملية في تعلم الآلة والتعلّم العميق",
        "type": "lab",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-02",
        "color": "#5d0b27"
    },
    {
        "id": 363,
        "code": "الشبكات اللاسلكية",
        "name": "الشبكات اللاسلكية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-02",
        "color": "#39c328"
    },
    {
        "id": 364,
        "code": "الذكاء الصنعي المتقدم",
        "name": "الذكاء الصنعي المتقدم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. آصف جعفر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-02",
        "color": "#696f10"
    },
    {
        "id": 365,
        "code": "الذكاء الصنعي المتقدم/عملي",
        "name": "الذكاء الصنعي المتقدم/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-02",
        "color": "#9bedb3"
    },
    {
        "id": 366,
        "code": "مدخل إلى الروبوتية",
        "name": "مدخل إلى الروبوتية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-03",
        "color": "#c9d51a"
    },
    {
        "id": 367,
        "code": "الفيزياء1/قديم",
        "name": "الفيزياء1/قديم",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-03",
        "color": "#ce7dbd"
    },
    {
        "id": 368,
        "code": "المتحكمات الصغرية والنظم المضمنة/ش1",
        "name": "المتحكمات الصغرية والنظم المضمنة/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-03",
        "color": "#7ad25d"
    },
    {
        "id": 369,
        "code": "المتحكمات الصغرية والنظم المضمنة/ش2",
        "name": "المتحكمات الصغرية والنظم المضمنة/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. بشار محمد",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-03",
        "color": "#d6e66f"
    },
    {
        "id": 370,
        "code": "قواعد البيانات المتقدمة//ش2",
        "name": "قواعد البيانات المتقدمة//ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-04",
        "color": "#6ac277"
    },
    {
        "id": 371,
        "code": "مدخل إلى البيانات الكبيرة‏",
        "name": "مدخل إلى البيانات الكبيرة‏",
        "type": "theory",
        "credits": 0,
        "instructor": "د. كادان الجمعة",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-04",
        "color": "#805764"
    },
    {
        "id": 372,
        "code": "أساسيات قواعد البيانات/ش5",
        "name": "أساسيات قواعد البيانات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-04",
        "color": "#35609a"
    },
    {
        "id": 373,
        "code": "أساسيات قواعد البيانات/ش6",
        "name": "أساسيات قواعد البيانات/ش6",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-04",
        "color": "#cfd556"
    },
    {
        "id": 374,
        "code": "برمجة التطبيقات الشبكية/ش2",
        "name": "برمجة التطبيقات الشبكية/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-05",
        "color": "#4236f6"
    },
    {
        "id": 375,
        "code": "برمجة التطبيقات الشبكية/ش3",
        "name": "برمجة التطبيقات الشبكية/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-05",
        "color": "#db6f51"
    },
    {
        "id": 376,
        "code": "أمن نظم المعلومات",
        "name": "أمن نظم المعلومات",
        "type": "theory",
        "credits": 0,
        "instructor": "د. محمد الشايطة",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-05",
        "color": "#540738"
    },
    {
        "id": 377,
        "code": "نظرية المعلومات/ش3",
        "name": "نظرية المعلومات/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. وسام الخطيب",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-05",
        "color": "#6b5915"
    },
    {
        "id": 378,
        "code": "البرمجة3/ش1",
        "name": "البرمجة3/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-06",
        "color": "#b6fa04"
    },
    {
        "id": 379,
        "code": "البرمجة3/ش 2",
        "name": "البرمجة3/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-06",
        "color": "#6e556f"
    },
    {
        "id": 380,
        "code": "البرمجة3/ش3",
        "name": "البرمجة3/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-06",
        "color": "#36a287"
    },
    {
        "id": 381,
        "code": "البرمجة3/ش4",
        "name": "البرمجة3/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "م. شادي بليدي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-06",
        "color": "#3af8f0"
    },
    {
        "id": 382,
        "code": "ضمان جودة البرمجيات",
        "name": "ضمان جودة البرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية رجب",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-07",
        "color": "#7d417d"
    },
    {
        "id": 383,
        "code": "مدخل إلى هندسة البرمجيات/ش5",
        "name": "مدخل إلى هندسة البرمجيات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-07",
        "color": "#46934f"
    },
    {
        "id": 384,
        "code": "التطوير الرشيق للبرمجيات",
        "name": "التطوير الرشيق للبرمجيات",
        "type": "theory",
        "credits": 0,
        "instructor": "م. ثراء أصلان",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-07",
        "color": "#da2c9e"
    },
    {
        "id": 385,
        "code": "التحليل الرياضي 2/ش 4",
        "name": "التحليل الرياضي 2/ش 4",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-08",
        "color": "#4fa7ca"
    },
    {
        "id": 386,
        "code": "نظرية الحوسبة/ش 3",
        "name": "نظرية الحوسبة/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-08",
        "color": "#393da7"
    },
    {
        "id": 387,
        "code": "التحليل الرياضي 2/ش 5",
        "name": "التحليل الرياضي 2/ش 5",
        "type": "theory",
        "credits": 0,
        "instructor": "أ.زينب خضر",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-08",
        "color": "#84925b"
    },
    {
        "id": 388,
        "code": "الرياضيات المتقطعة/ش3",
        "name": "الرياضيات المتقطعة/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. يحيى قطيش",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-09",
        "color": "#52351c"
    },
    {
        "id": 389,
        "code": "الرياضيات المتقطعة/ ش4",
        "name": "الرياضيات المتقطعة/ ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د.يحيى قطيش",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-09",
        "color": "#3725ba"
    },
    {
        "id": 390,
        "code": "الرياضيات المتقطعة/ ش2",
        "name": "الرياضيات المتقطعة/ ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د.يحيى قطيش",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-09",
        "color": "#7fddfa"
    },
    {
        "id": 391,
        "code": "المعادلات التفاضلية والتحويلات/ش5",
        "name": "المعادلات التفاضلية والتحويلات/ش5",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. رائد الرفاعي",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-10",
        "color": "#4f47a4"
    },
    {
        "id": 392,
        "code": "التحليل الرياضي 1/ش 3",
        "name": "التحليل الرياضي 1/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ياسر نصر",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-10",
        "color": "#5a6948"
    },
    {
        "id": 393,
        "code": "المعادلات التفاضلية والتحويلات/ش 6",
        "name": "المعادلات التفاضلية والتحويلات/ش 6",
        "type": "theory",
        "credits": 0,
        "instructor": "أ. رائد الرفاعي",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-10",
        "color": "#87ae34"
    },
    {
        "id": 394,
        "code": "نظم التحكم اللإخطي",
        "name": "نظم التحكم اللإخطي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-11",
        "color": "#b25518"
    },
    {
        "id": 395,
        "code": "نظم التحكم الصناعي",
        "name": "نظم التحكم الصناعي",
        "type": "theory",
        "credits": 0,
        "instructor": "د. لؤي صالح",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-11",
        "color": "#85a613"
    },
    {
        "id": 396,
        "code": "البرمجة1/ش 2",
        "name": "البرمجة1/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "م. رانية رجب",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-11",
        "color": "#64f4f0"
    },
    {
        "id": 397,
        "code": "بنيان الحواسيب1/ش3",
        "name": "بنيان الحواسيب1/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. هبة الله الخضور",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-12",
        "color": "#cff8af"
    },
    {
        "id": 398,
        "code": "بنيان الحواسيب1/ش4",
        "name": "بنيان الحواسيب1/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. هبة الله الخضور",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-12",
        "color": "#6020b9"
    },
    {
        "id": 399,
        "code": "الفيزياء2/ش2",
        "name": "الفيزياء2/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-12",
        "color": "#aebe4a"
    },
    {
        "id": 400,
        "code": "الفيزياء 2 /ش3",
        "name": "الفيزياء 2 /ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. روز محمد",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-12",
        "color": "#d44f50"
    },
    {
        "id": 401,
        "code": "معالجة الإشارة",
        "name": "معالجة الإشارة",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحمد",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-13",
        "color": "#bea44a"
    },
    {
        "id": 402,
        "code": "الدارات الكهربائية1/ش2",
        "name": "الدارات الكهربائية1/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. حسان أحمد",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-13",
        "color": "#c5e06f"
    },
    {
        "id": 403,
        "code": "مدخل إلى الذكاء الصنعي/ش3",
        "name": "مدخل إلى الذكاء الصنعي/ش3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-14",
        "color": "#5c9ec4"
    },
    {
        "id": 404,
        "code": "مدخل إلى الذكاء الصنعي/ش4",
        "name": "مدخل إلى الذكاء الصنعي/ش4",
        "type": "theory",
        "credits": 0,
        "instructor": "د. فتاة صالح",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-14",
        "color": "#639879"
    },
    {
        "id": 405,
        "code": "مدخل إلى الذكاء الصنعي/ش 5",
        "name": "مدخل إلى الذكاء الصنعي/ش 5",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-14",
        "color": "#6938b2"
    },
    {
        "id": 406,
        "code": "مدخل إلى الذكاء الصنعي/ش 6",
        "name": "مدخل إلى الذكاء الصنعي/ش 6",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مجدي سكر",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-14",
        "color": "#74e0ac"
    },
    {
        "id": 407,
        "code": "الخوارزميات وبنى المعطيات2/ش1",
        "name": "الخوارزميات وبنى المعطيات2/ش1",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-15",
        "color": "#4ca8fb"
    },
    {
        "id": 408,
        "code": "الخوارزميات وبنى المعطيات 2 /ش2",
        "name": "الخوارزميات وبنى المعطيات 2 /ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. ماجدة البكور",
        "day": "الثلاثاء",
        "time": "10:30 - 13:00",
        "room": "AI-15",
        "color": "#7ee64d"
    },
    {
        "id": 409,
        "code": "الخوارزميات وبنى المعطيات1 /ش2",
        "name": "الخوارزميات وبنى المعطيات1 /ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. مضر كيوان",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-15",
        "color": "#6e22fa"
    },
    {
        "id": 410,
        "code": "تراسل البيانات/ش3 الفقيه",
        "name": "تراسل البيانات/ش3 الفقيه",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-16",
        "color": "#669b74"
    },
    {
        "id": 411,
        "code": "تراسل البيانات/ش4 الفقيه",
        "name": "تراسل البيانات/ش4 الفقيه",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نبيل الفقيه",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-16",
        "color": "#83be4f"
    },
    {
        "id": 412,
        "code": "التحليل الرياضي1/ه-ش2",
        "name": "التحليل الرياضي1/ه-ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عبد الرزاق الفاضل",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-17",
        "color": "#ddc398"
    },
    {
        "id": 413,
        "code": "الإنكليزية للمهندسين/ش2",
        "name": "الإنكليزية للمهندسين/ش2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-17",
        "color": "#db8dac"
    },
    {
        "id": 414,
        "code": "الهوائيات وانتشار الأمواج الراديوية",
        "name": "الهوائيات وانتشار الأمواج الراديوية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. نواف الطويل",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-17",
        "color": "#a373bb"
    },
    {
        "id": 415,
        "code": "الحساسات والتحسس",
        "name": "الحساسات والتحسس",
        "type": "theory",
        "credits": 0,
        "instructor": "د.عادل الكفري",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-18",
        "color": "#4f847d"
    },
    {
        "id": 416,
        "code": "الدارات المنطقية/ش 3",
        "name": "الدارات المنطقية/ش 3",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-18",
        "color": "#cc25dc"
    },
    {
        "id": 417,
        "code": "مهارات التواصل/ش 2",
        "name": "مهارات التواصل/ش 2",
        "type": "theory",
        "credits": 0,
        "instructor": "د. عادل الكفري",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-18",
        "color": "#bb20a7"
    },
    {
        "id": 418,
        "code": "اتصالات الأقمار الصناعية",
        "name": "اتصالات الأقمار الصناعية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. رواد ملحم",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-SEC-1",
        "color": "#b29094"
    },
    {
        "id": 419,
        "code": "خوارزميات البحث الذكية",
        "name": "خوارزميات البحث الذكية",
        "type": "theory",
        "credits": 0,
        "instructor": "د. أكرم مسوح",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-SEC-1",
        "color": "#bbab4a"
    },
    {
        "id": 420,
        "code": "ضمان جودة البرمجيات واختبارها",
        "name": "ضمان جودة البرمجيات واختبارها",
        "type": "theory",
        "credits": 0,
        "instructor": "م. عبد الرحمن عبد الرحمن",
        "day": "الثلاثاء",
        "time": "08:00 - 10:30",
        "room": "AI-ACN-1",
        "color": "#3f1018"
    },
    {
        "id": 421,
        "code": "نظم التشغيل الموزعة/عملي",
        "name": "نظم التشغيل الموزعة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. موفق العضل",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-ACN-1",
        "color": "#53e048"
    },
    {
        "id": 422,
        "code": "بحوث العمليات",
        "name": "بحوث العمليات",
        "type": "lab",
        "credits": 0,
        "instructor": "د. عبد الرزاق الفاضل",
        "day": "الثلاثاء",
        "time": "13:00 - 15:30",
        "room": "AI-ACN-1",
        "color": "#ae2ed6"
    },
    {
        "id": 423,
        "code": "النظم الموزعة والحوسبة السحابية/عملي ف13",
        "name": "النظم الموزعة والحوسبة السحابية/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C1",
        "color": "#a1a12c"
    },
    {
        "id": 424,
        "code": "النظم الموزعة والحوسبة السحابية/عملي ف23",
        "name": "النظم الموزعة والحوسبة السحابية/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C1",
        "color": "#616bb3"
    },
    {
        "id": 425,
        "code": "البرمجة3/عملي ف14",
        "name": "البرمجة3/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C1",
        "color": "#cb5f81"
    },
    {
        "id": 426,
        "code": "البرمجة3/عملي ف24",
        "name": "البرمجة3/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. بشار خدوج / م. فواز عفاش",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C1",
        "color": "#768cb3"
    },
    {
        "id": 427,
        "code": "بنيان الحواسيب2/عملي ف14",
        "name": "بنيان الحواسيب2/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C2",
        "color": "#9b32b6"
    },
    {
        "id": 428,
        "code": "بنيان الحواسيب2/عملي ف24",
        "name": "بنيان الحواسيب2/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "م. سارة حمدان / م. حوراء الخضر",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C2",
        "color": "#b38bfe"
    },
    {
        "id": 429,
        "code": "نظم قواعد البيانات/عملي ف13",
        "name": "نظم قواعد البيانات/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزائى اليوسف / م. تقى الزعبي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C2",
        "color": "#531c34"
    },
    {
        "id": 430,
        "code": "نظم قواعد البيانات/عملي ف23",
        "name": "نظم قواعد البيانات/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "م. خزاى اليوسف / م. تقى الزعبي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C2",
        "color": "#88df27"
    },
    {
        "id": 431,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف15",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف15",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C3",
        "color": "#799c5a"
    },
    {
        "id": 432,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف11",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C3",
        "color": "#5e87cb"
    },
    {
        "id": 433,
        "code": "البرمجة1/عملي ف12",
        "name": "البرمجة1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C3",
        "color": "#656377"
    },
    {
        "id": 434,
        "code": "مدخل إلى الخوارزميات والبرمجة/عملي ف25",
        "name": "مدخل إلى الخوارزميات والبرمجة/عملي ف25",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد عثمان / م.عبد الرحمن عرار",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C3",
        "color": "#bec64d"
    },
    {
        "id": 435,
        "code": "أساسيات قواعد البيانات/عملي ف15",
        "name": "أساسيات قواعد البيانات/عملي ف15",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فرح فارس",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C4",
        "color": "#a763ab"
    },
    {
        "id": 436,
        "code": "أساسيات قواعد البيانات/عملي ف25",
        "name": "أساسيات قواعد البيانات/عملي ف25",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. فرح فارس",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C4",
        "color": "#958c7c"
    },
    {
        "id": 437,
        "code": "أساسيات قواعد البيانات/عملي ف16",
        "name": "أساسيات قواعد البيانات/عملي ف16",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C4",
        "color": "#45a09a"
    },
    {
        "id": 438,
        "code": "أساسيات قواعد البيانات/عملي ف26",
        "name": "أساسيات قواعد البيانات/عملي ف26",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رزان رزق / م. هبة ريمان",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C4",
        "color": "#bb8a81"
    },
    {
        "id": 439,
        "code": "تطوير تطبيقات الويب/عملي ف1",
        "name": "تطوير تطبيقات الويب/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / هديل عسراوي",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-C5",
        "color": "#c24794"
    },
    {
        "id": 440,
        "code": "تطوير تطبيقات الويب/عملي ف2",
        "name": "تطوير تطبيقات الويب/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / هديل عسراوي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-C5",
        "color": "#b7d4ff"
    },
        {
        "id": 441,
        "code": "تطوير تطبيقات الويب/عملي ف3",
        "name": "تطوير تطبيقات الويب/عملي ف3",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-C5",
        "color": "#436205"
    },
    {
        "id": 442,
        "code": "أمن نظم المعلومات/عملي",
        "name": "أمن نظم المعلومات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. محمد الشايطة / م. فرح فارس",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-C5",
        "color": "#9f4af8"
    },
    {
        "id": 443,
        "code": "معالجة الصور وتحليلها/عملي ف12",
        "name": "معالجة الصور وتحليلها/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-ADB",
        "color": "#97b27a"
    },
    {
        "id": 444,
        "code": "معالجة الصور وتحليلها/عملي ف22",
        "name": "معالجة الصور وتحليلها/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. بغدادي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-ADB",
        "color": "#587855"
    },
    {
        "id": 445,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف12",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب ادي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-ADB",
        "color": "#874a18"
    },
    {
        "id": 446,
        "code": "مدخل إلى الرؤية الحاسوبية/عملي ف22",
        "name": "مدخل إلى الرؤية الحاسوبية/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "م. إسراء سهلي / م. زينب بغدادي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-ADB",
        "color": "#c934e7"
    },
    {
        "id": 447,
        "code": "أمن نظم التشغيل/عملي ف1",
        "name": "أمن نظم التشغيل/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-SEC",
        "color": "#466a34"
    },
    {
        "id": 448,
        "code": "أمن نظم التشغيل/عملي ف2",
        "name": "أمن نظم التشغيل/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-SEC",
        "color": "#65fdf6"
    },
    {
        "id": 449,
        "code": "الاختراق الأخلاقي والدفاع عن الأنظمة/عملي",
        "name": "الاختراق الأخلاقي والدفاع عن الأنظمة/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. محمد يامن الحالق / م.نغم أشقر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-SEC",
        "color": "#8293d8"
    },
    {
        "id": 450,
        "code": "الشبكات اللاسلكية/عملي",
        "name": "الشبكات اللاسلكية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. لجين أسعد / م.",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-SEC",
        "color": "#4cad4c"
    },
    {
        "id": 451,
        "code": "إدارة الشبكات الحاسوبية/عملي ف11",
        "name": "إدارة الشبكات الحاسوبية/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م. يز رافع",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-ACN",
        "color": "#ce6c1f"
    },
    {
        "id": 452,
        "code": "بروتوكولات الشبكات الحاسوبية/عملي",
        "name": "بروتوكولات الشبكات الحاسوبية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م.يزن أبو رافع",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-ACN",
        "color": "#5d4eb2"
    },
    {
        "id": 453,
        "code": "إدارة الشبكات الحاسوبية/عملي ف21",
        "name": "إدارة الشبكات الحاسوبية/عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م. يزن أبو رافع",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-ACN",
        "color": "#8c2c36"
    },
    {
        "id": 454,
        "code": "إدارة الشبكات الحاسوبية وبروتوكولاتها/عملي",
        "name": "إدارة الشبكات الحاسوبية وبروتوكولاتها/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "د. طلال حمود / م.يزن أبو رافع",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-ACN",
        "color": "#543a9f"
    },
    {
        "id": 455,
        "code": "البرمجة3/عملي ف13",
        "name": "البرمجة3/عملي ف13",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مضر كيوان / م. الحسين طفيلية",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "M-L07",
        "color": "#adde77"
    },
    {
        "id": 456,
        "code": "البرمجة3/عملي ف23",
        "name": "البرمجة3/عملي ف23",
        "type": "lab",
        "credits": 0,
        "instructor": "د. مض ر كيوان / م. الحسين طفيلية",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "M-L07",
        "color": "#92ba5e"
    },
    {
        "id": 457,
        "code": "نظم قواعد البيانات/عملي ف14",
        "name": "نظم قواعد البيانات/عملي ف14",
        "type": "lab",
        "credits": 0,
        "instructor": "د. كادان الجمعة / م. هديل عسراوي",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "M-L07",
        "color": "#9e6521"
    },
    {
        "id": 458,
        "code": "نظم قواعد البيانات/عملي ف24",
        "name": "نظم قواعد البيانات/عملي ف24",
        "type": "lab",
        "credits": 0,
        "instructor": "د. كادان الجمعة / م. هديل عسراوي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "M-L07",
        "color": "#3982dd"
    },
    {
        "id": 459,
        "code": "أسس نظم الاتصالات/عملي",
        "name": "أسس نظم الاتصالات/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-AT",
        "color": "#d61f96"
    },
    {
        "id": 460,
        "code": "معالجة الإشارة/عملي ف1",
        "name": "معالجة الإشارة/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-AT",
        "color": "#b72aad"
    },
    {
        "id": 461,
        "code": "معالجة الإشارة/عملي ف2",
        "name": "معالجة الإشارة/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-AT",
        "color": "#46fd46"
    },
    {
        "id": 462,
        "code": "الإشارات والنظم/عملي ف11",
        "name": "الإشارات والنظم/عملي ف11",
        "type": "lab",
        "credits": 0,
        "instructor": "م. رانية صندوق",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-AT",
        "color": "#c91470"
    },
    {
        "id": 463,
        "code": "التصميم بمساعدة الحاسوب/عملي ف1",
        "name": "التصميم بمساعدة الحاسوب/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي / م. محسن سكر",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-CA",
        "color": "#a166e6"
    },
    {
        "id": 464,
        "code": "التصميم بمساعدة الحاسوب/عملي ف2",
        "name": "التصميم بمساعدة الحاسوب/عملي ف2",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي / م. محسن سكر",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-CA",
        "color": "#914f4b"
    },
    {
        "id": 465,
        "code": "نظم التحكم الرقمي/عملي",
        "name": "نظم التحكم الرقمي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "AI-L-ROB",
        "color": "#8cec6b"
    },
    {
        "id": 466,
        "code": "نظم التحكم اللإخطي/عملي",
        "name": "نظم التحكم اللإخطي/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "AI-L-ROB",
        "color": "#6b52eb"
    },
    {
        "id": 467,
        "code": "نظم التحكم الصناعي/عملي ف1",
        "name": "نظم التحكم الصناعي/عملي ف1",
        "type": "lab",
        "credits": 0,
        "instructor": "م. شادي صعب",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "AI-L-ROB",
        "color": "#47e431"
    },
    {
        "id": 468,
        "code": "النظم الميكاإلكترونية/عملي",
        "name": "النظم الميكاإلكترونية/عملي",
        "type": "lab",
        "credits": 0,
        "instructor": "م. مروة الصفدي",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "AI-L-ROB",
        "color": "#524abd"
    },
    {
        "id": 469,
        "code": "الفيزياء1/عملي ف22",
        "name": "الفيزياء1/عملي ف22",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الثلاثاء",
        "time": "08:00 - 09:40",
        "room": "PE-L2",
        "color": "#5a8cec"
    },
    {
        "id": 470,
        "code": "الفيزياء 2/ عملي ف21",
        "name": "الفيزياء 2/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الثلاثاء",
        "time": "09:40 - 11:20",
        "room": "PE-L2",
        "color": "#d992b2"
    },
    {
        "id": 471,
        "code": "الفيزياء1/عملي ف12",
        "name": "الفيزياء1/عملي ف12",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الثلاثاء",
        "time": "11:20 - 13:00",
        "room": "PE-L2",
        "color": "#d09fa5"
    },
    {
        "id": 472,
        "code": "الفيزياء1/ عملي ف21",
        "name": "الفيزياء1/ عملي ف21",
        "type": "lab",
        "credits": 0,
        "instructor": "أ. عمر يوسف",
        "day": "الثلاثاء",
        "time": "13:00 - 14:40",
        "room": "PE-L2",
        "color": "#c9a76b"
    }
];

// ==================== المتغيرات ====================
let registeredCourses = [];
let compactMode = localStorage.getItem('spu_compact') === 'true';
const DAYS = ["السبت", "الأحد", "الاثنين", "الثلاثاء"];

const timeSlots = [
    "08:00 - 08:50", "08:50 - 09:40",
    "09:40 - 10:30", "10:30 - 11:20",
    "11:20 - 12:10", "12:10 - 13:00",
    "13:00 - 13:50", "13:50 - 14:40",
    "14:40 - 15:30", "15:30 - 16:20"
];

// ==================== الوضع الليلي ====================
function initTheme() {
    const saved = localStorage.getItem('spu_theme') || 
        (window.matchMedia('(prefers-color-scheme: dark)').matches ? 'dark' : 'light');
    document.documentElement.setAttribute('data-theme', saved);
    updateThemeIcon(saved);
}

function toggleTheme() {
    const current = document.documentElement.getAttribute('data-theme');
    const next = current === 'dark' ? 'light' : 'dark';
    document.documentElement.setAttribute('data-theme', next);
    localStorage.setItem('spu_theme', next);
    updateThemeIcon(next);
}

function updateThemeIcon(theme) {
    const btn = document.getElementById('theme-toggle');
    if (btn) {
        btn.innerHTML = theme === 'dark'
            ? '<i class="fas fa-sun"></i>'
            : '<i class="fas fa-moon"></i>';
    }
    const meta = document.querySelector('meta[name="theme-color"]');
    if (meta) meta.content = theme === 'dark' ? '#0a0e1a' : '#f4f6fb';
}

// ==================== البحث الذكي (نسخة نظيفة وموثوقة) ====================

/**
 * تطبيع النص العربي — توحيد كل الاختلافات الإملائية
 */
function normalizeText(text) {
    if (!text) return '';
    return String(text)
        .trim()
        .toLowerCase()
        .replace(/[\u064B-\u065F\u0670]/g, '')
        .replace(/[أإآٱ]/g, 'ا')
        .replace(/ى/g, 'ي')
        .replace(/ة/g, 'ه')
        .replace(/ؤ/g, 'و')
        .replace(/ئ/g, 'ي')
        .replace(/[^\u0600-\u06FF0-9a-z\s]/g, ' ')
        .replace(/\s+/g, ' ')
        .trim();
}

/**
 * حذف كل المسافات — للمقارنة الملتصقة
 */
function squash(text) {
    return text.replace(/\s+/g, '');
}

/**
 * مسافة Levenshtein
 */
function editDistance(a, b) {
    if (a === b) return 0;
    if (!a.length) return b.length;
    if (!b.length) return a.length;
    
    let prev = Array.from({ length: a.length + 1 }, (_, i) => i);
    let curr = new Array(a.length + 1);
    
    for (let i = 1; i <= b.length; i++) {
        curr[0] = i;
        for (let j = 1; j <= a.length; j++) {
            const cost = a[j - 1] === b[i - 1] ? 0 : 1;
            curr[j] = Math.min(
                prev[j] + 1,
                curr[j - 1] + 1,
                prev[j - 1] + cost
            );
        }
        [prev, curr] = [curr, prev];
    }
    
    return prev[a.length];
}

/**
 * ⭐ الدالة الأساسية للبحث
 */
function courseMatches(course, searchTerm) {
    if (!searchTerm || !searchTerm.trim()) return true;
    
    const query = normalizeText(searchTerm);
    if (!query) return true;
    
    const fields = [
        { raw: course.code || '' },
        { raw: course.name || '' },
        { raw: course.instructor || '' },
        { raw: course.room || '' }
    ].map(f => ({
        normalized: normalizeText(f.raw),
        squashed: squash(normalizeText(f.raw))
    }));
    
    // ───── المستوى 1: مطابقة النص الكامل الملتصق ─────
    const querySquashed = squash(query);
    
    if (querySquashed.length >= 3) {
        for (const f of fields) {
            if (!f.squashed) continue;
            if (f.squashed.includes(querySquashed)) return true;
            if (f.squashed.startsWith(querySquashed)) return true;
        }
    }
    
    // ───── المستوى 2: مطابقة كلمة بكلمة ─────
    const queryWords = query.split(' ').filter(w => w.length >= 2);
    if (queryWords.length === 0) {
        return fields.some(f => f.normalized.includes(query));
    }
    
    const courseWords = new Set();
    for (const f of fields) {
        if (!f.normalized) continue;
        const words = f.normalized.split(' ').filter(w => w.length >= 2);
        for (const w of words) courseWords.add(w);
    }
    
    for (const qWord of queryWords) {
        let matched = false;
        
        for (const cWord of courseWords) {
            // مطابقة تامة
            if (qWord === cWord) {
                matched = true;
                break;
            }
            
            // البادئة
            if (cWord.startsWith(qWord)) {
                if (qWord.length >= 3 && qWord.length / cWord.length >= 0.5) {
                    matched = true;
                    break;
                }
            }
            
            // العكس
            if (qWord.startsWith(cWord)) {
                if (cWord.length >= 3 && cWord.length / qWord.length >= 0.5) {
                    matched = true;
                    break;
                }
            }
            
            // خطأ إملائي واحد
            if (qWord.length >= 4 && cWord.length >= 4) {
                const lenDiff = Math.abs(qWord.length - cWord.length);
                if (lenDiff <= 1) {
                    const dist = editDistance(qWord, cWord);
                    if (dist === 1) {
                        matched = true;
                        break;
                    }
                }
            }
        }
        
        if (!matched) return false;
    }
    
    return true;
}

// ==================== أدوات الوقت ====================
function timeToMinutes(timeStr) {
    if (!timeStr) return { start: 0, end: 0 };
    const clean = timeStr.replace(/\s/g, '');
    const m = clean.match(/(\d{1,2}):(\d{2})[-–](\d{1,2}):(\d{2})/);
    if (m) {
        return {
            start: parseInt(m[1]) * 60 + parseInt(m[2]),
            end: parseInt(m[3]) * 60 + parseInt(m[4])
        };
    }
    return { start: 0, end: 0 };
}

function getCourseTimeSlots(course) {
    const ct = timeToMinutes(course.time);
    return timeSlots.filter(slot => {
        const st = timeToMinutes(slot);
        return st.start >= ct.start && st.end <= ct.end;
    });
}

// ==================== التداخل ====================
function getConflictCourse(newCourse) {
    const nt = timeToMinutes(newCourse.time);
    if (nt.start === 0 && nt.end === 0) return null;
    return registeredCourses.find(c => {
        if (c.day !== newCourse.day) return false;
        if (c.id === newCourse.id) return false;
        const et = timeToMinutes(c.time);
        if (et.start === 0 && et.end === 0) return false;
        return nt.start < et.end && nt.end > et.start;
    });
}

// ==================== نظام التنقل بالتمرير (Scroll-Spy) ====================
let isScrollingProgrammatically = false;

function initTabs() {
    document.querySelectorAll('.tab').forEach(tab => {
        tab.addEventListener('click', () => {
            const targetId = tab.dataset.scroll;
            const target = document.getElementById(targetId);
            if (!target) return;
            
            setActiveTab(tab.dataset.scroll.replace('section-', ''));
            
            isScrollingProgrammatically = true;
            
            const headerEl = document.querySelector('.app-header');
            const headerHeight = headerEl ? headerEl.offsetHeight : 140;
            const targetTop = target.getBoundingClientRect().top + window.pageYOffset - headerHeight - 10;
            
            window.scrollTo({ top: targetTop, behavior: 'smooth' });
            
            clearTimeout(window.__scrollEndTimer);
            window.__scrollEndTimer = setTimeout(() => {
                isScrollingProgrammatically = false;
            }, 800);
        });
    });
}

function setActiveTab(sectionName) {
    document.querySelectorAll('.tab').forEach(t => {
        const isActive = t.dataset.scroll === `section-${sectionName}`;
        t.classList.toggle('active', isActive);
        
        if (isActive) {
            t.scrollIntoView({ behavior: 'smooth', block: 'nearest', inline: 'center' });
        }
    });
}

function initScrollSpy() {
    const sections = document.querySelectorAll('.content-section');
    if (!sections.length) return;
    
    const handleScroll = debounce(() => {
        if (isScrollingProgrammatically) return;
        
        const headerEl = document.querySelector('.app-header');
        const headerHeight = (headerEl ? headerEl.offsetHeight : 140) + 40;
        
        let currentSection = null;
        let closestDistance = Infinity;
        
        sections.forEach(section => {
            const rect = section.getBoundingClientRect();
            const distance = Math.abs(rect.top - headerHeight);
            
            if (rect.top <= headerHeight + 100 && distance < closestDistance) {
                closestDistance = distance;
                currentSection = section;
            }
        });
        
        if (!currentSection && sections.length) {
            const firstRect = sections[0].getBoundingClientRect();
            if (firstRect.top >= 0 && firstRect.top < window.innerHeight / 2) {
                currentSection = sections[0];
            }
        }
        
        if (currentSection) {
            setActiveTab(currentSection.dataset.section);
        }
    }, 100);
    
    window.addEventListener('scroll', handleScroll, { passive: true });
    handleScroll();
}

// ==================== وضع العرض المصغّر ====================
function applyCompactMode() {
    const grids = document.querySelectorAll('.courses-grid');
    grids.forEach(g => g.classList.toggle('compact', compactMode));
    
    const btn = document.getElementById('compact-toggle');
    if (btn) {
        btn.classList.toggle('active', compactMode);
        btn.innerHTML = compactMode
            ? '<i class="fas fa-expand-alt"></i>'
            : '<i class="fas fa-compress-alt"></i>';
        btn.title = compactMode ? 'تكبير البطاقات' : 'تصغير البطاقات';
    }
}

function toggleCompactMode() {
    compactMode = !compactMode;
    localStorage.setItem('spu_compact', compactMode);
    applyCompactMode();
}

// ==================== فلتر الأيام ====================
function setupDaysFilter() {
    const container = document.getElementById('days-filter');
    if (!container) return;
    container.innerHTML = '';
    DAYS.forEach(day => {
        const chip = document.createElement('button');
        chip.className = 'chip active';
        chip.dataset.day = day;
        chip.innerHTML = `<i class="fas fa-calendar-day"></i> ${day}`;
        chip.addEventListener('click', () => {
            chip.classList.toggle('active');
            displayAvailableCourses();
        });
        container.appendChild(chip);
    });
}

function getSelectedDays() {
    const chips = document.querySelectorAll('#days-filter .chip.active');
    return Array.from(chips).map(c => c.dataset.day);
}

// ==================== التهيئة ====================
function initApp() {
    initTheme();
    initTabs();
    initScrollSpy();
    setupDaysFilter();
    displayAvailableCourses();
    displayRegisteredCourses();
    displayTimetable();
    updateStats();
    updateBadges();
    setupEventListeners();
    applyCompactMode();
    
    document.getElementById('year').textContent = new Date().getFullYear();
}

// ==================== عرض المواد المتاحة ====================
function displayAvailableCourses() {
    const container = document.getElementById('available-courses');
    if (!container) return;
    container.innerHTML = '';
    
    const searchTerm = document.getElementById('search')?.value || '';
    const theoryActive = document.querySelector('.chip[data-filter="theory"]')?.classList.contains('active') ?? true;
    const labActive = document.querySelector('.chip[data-filter="lab"]')?.classList.contains('active') ?? true;
    const daysFilter = getSelectedDays();
    
    const filtered = availableCourses.filter(c => {
        if (!courseMatches(c, searchTerm)) return false;
        if (c.type === 'theory' && !theoryActive) return false;
        if (c.type === 'lab' && !labActive) return false;
        if (!daysFilter.includes(c.day)) return false;
        if (registeredCourses.some(r => r.id === c.id)) return false;
        return true;
    });
    
    const clearBtn = document.getElementById('clear-search');
    if (clearBtn) clearBtn.classList.toggle('visible', searchTerm.trim().length > 0);
    
    const badge = document.getElementById('badge-available');
    if (badge) {
        badge.textContent = filtered.length;
        badge.dataset.count = filtered.length;
    }
    
    const pill = document.getElementById('available-pill');
    if (pill) pill.textContent = `${filtered.length} مادة`;
    
    if (filtered.length === 0) {
        const msg = searchTerm.trim()
            ? `<strong>لا توجد نتائج</strong>لم يتم العثور على مواد تطابق "${searchTerm}"`
            : `<strong>لا توجد مواد</strong>جرّب تغيير الفلاتر`;
        container.innerHTML = `<div class="no-courses">${msg}</div>`;
        applyCompactMode();
        return;
    }
    
    filtered.forEach(c => container.appendChild(createCourseCard(c, false)));
    applyCompactMode();
}

// ==================== بطاقة مادة ====================
function createCourseCard(course, isRegistered) {
    const card = document.createElement('div');
    card.className = 'course-card';
    card.dataset.id = course.id;
    
    if (isRegistered) {
        card.classList.add('registered');
        const conflict = getConflictCourse(course);
        if (conflict) {
            card.classList.add('conflict');
            card.title = `متداخل مع: ${conflict.name}`;
        }
    }
    
    const typeLabel = course.type === 'theory' ? 'نظري' : 'عملي';
    const typeIcon = course.type === 'theory' ? 'fa-chalkboard-teacher' : 'fa-flask';
    const conflict = isRegistered ? getConflictCourse(course) : null;
    
    card.innerHTML = `
        <div class="course-head">
            <div class="course-title-group">
                <div class="course-code">
                    <i class="fas fa-hashtag"></i>${course.code}
                </div>
                <div class="course-name">${course.name}</div>
            </div>
            <span class="course-type-pill ${course.type}">
                <i class="fas ${typeIcon}"></i> ${typeLabel}
            </span>
        </div>
        <div class="course-meta">
            <span class="meta-item"><i class="fas fa-user-tie"></i> ${course.instructor}</span>
            <span class="meta-item"><i class="fas fa-clock"></i> ${course.time}</span>
            <span class="meta-item"><i class="fas fa-calendar-day"></i> ${course.day}</span>
            <span class="meta-item"><i class="fas fa-door-open"></i> ${course.room}</span>
        </div>
        ${conflict ? `<div><span class="conflict-badge"><i class="fas fa-exclamation-triangle"></i> متداخل مع ${conflict.name}</span></div>` : ''}
    `;
    
    card.addEventListener('click', () => {
        if (isRegistered) {
            if (confirm(`هل تريد إلغاء تسجيل "${course.name}"؟`)) {
                unregisterCourse(course.id);
            }
        } else {
            registerCourse(course.id);
        }
    });
    
    return card;
}

// ==================== تسجيل/إلغاء ====================
function registerCourse(courseId) {
    const course = availableCourses.find(c => c.id === courseId);
    if (!course) return;
    
    const conflict = getConflictCourse(course);
    if (conflict) {
        showAlert(
            'تداخل في الوقت',
            `المادة <strong>${course.name}</strong> تتداخل مع <strong>${conflict.name}</strong><br><small>${conflict.day} — ${conflict.time}</small>`,
            'warning'
        );
        return;
    }
    
    registeredCourses.push({ ...course });
    updateAllDisplays();
    showAlert('تم التسجيل', `تم تسجيل <strong>${course.name}</strong> بنجاح`, 'success');
}

function unregisterCourse(courseId) {
    registeredCourses = registeredCourses.filter(c => c.id !== courseId);
    updateAllDisplays();
}

// ==================== عرض المسجلة ====================
function displayRegisteredCourses() {
    const container = document.getElementById('registered-courses');
    if (!container) return;
    container.innerHTML = '';
    
    const pill = document.getElementById('registered-pill');
    if (pill) pill.textContent = `${registeredCourses.length} مادة`;
    
    if (registeredCourses.length === 0) {
        container.innerHTML = `<div class="no-courses"><strong>لا توجد مواد مسجلة</strong>ابدأ بإضافة مواد من قسم "المواد"</div>`;
        applyCompactMode();
        return;
    }
    
    registeredCourses.forEach(c => container.appendChild(createCourseCard(c, true)));
    applyCompactMode();
}

// ==================== الجدول ====================
function displayTimetable() {
    const header = document.getElementById('timetable-header');
    const body = document.getElementById('timetable-body');
    if (!header || !body) return;
    
    header.innerHTML = `
        <div class="time-slot">الوقت</div>
        ${DAYS.map(d => `<div>${d}</div>`).join('')}
    `;
    
    body.innerHTML = '';
    timeSlots.forEach(time => {
        const tCell = document.createElement('div');
        tCell.className = 'time-cell';
        tCell.textContent = time;
        body.appendChild(tCell);
        
        DAYS.forEach(day => {
            const dCell = document.createElement('div');
            dCell.className = 'day-cell';
            dCell.dataset.day = day;
            dCell.dataset.time = time;
            body.appendChild(dCell);
        });
    });
    
    registeredCourses.forEach(course => {
        if (!course.day || !DAYS.includes(course.day)) return;
        const dayIdx = DAYS.indexOf(course.day);
        const cSlots = getCourseTimeSlots(course);
        if (!cSlots.length) return;
        const firstIdx = timeSlots.indexOf(cSlots[0]);
        if (firstIdx === -1) return;
        
        const cellIdx = firstIdx * (DAYS.length + 1) + (dayIdx + 1);
        const cell = body.children[cellIdx];
        if (!cell) return;
        
        const el = document.createElement('div');
        el.className = `course-in-timetable ${course.type}`;
        el.style.backgroundColor = course.color;
        el.style.height = `calc(${cSlots.length * 60}px - 4px)`;
        el.innerHTML = `
            <div class="course-timetable-code">${course.code}</div>
            <div class="course-timetable-details">${course.room}</div>
        `;
        el.addEventListener('click', (e) => {
            e.stopPropagation();
            if (confirm(`إلغاء تسجيل "${course.name}"؟`)) {
                unregisterCourse(course.id);
            }
        });
        cell.appendChild(el);
    });
}

// ==================== الإحصائيات ====================
function updateStats() {
    const totalHours = registeredCourses.reduce((s, c) => s + (c.credits || 0), 0);
    const totalCourses = registeredCourses.length;
    const uniqueDays = new Set(registeredCourses.map(c => c.day)).size;
    const theoryCount = registeredCourses.filter(c => c.type === 'theory').length;
    
    setText('stat-courses', totalCourses);
    setText('stat-hours', totalHours);
    setText('stat-days', uniqueDays);
    setText('stat-theory', theoryCount);
    
    const breakdown = document.getElementById('breakdown');
    if (breakdown) {
        if (registeredCourses.length === 0) {
            breakdown.innerHTML = `<div class="empty-breakdown">لا توجد بيانات لعرضها</div>`;
        } else {
            let html = `<div class="breakdown-title"><i class="fas fa-calendar-week"></i> توزيع المواد على الأيام</div>`;
            DAYS.forEach(day => {
                const courses = registeredCourses.filter(c => c.day === day);
                if (courses.length > 0) {
                    const hours = courses.reduce((s, c) => s + (c.credits || 0), 0);
                    html += `
                        <div class="day-breakdown-item">
                            <span class="day-name"><span class="day-dot"></span>${day}</span>
                            <span class="day-count">${courses.length} مادة${hours > 0 ? ` • ${hours} ساعة` : ''}</span>
                        </div>
                    `;
                }
            });
            breakdown.innerHTML = html;
        }
    }
}

function setText(id, val) {
    const el = document.getElementById(id);
    if (el) el.textContent = val;
}

function updateBadges() {
    const b = document.getElementById('badge-registered');
    if (b) {
        b.textContent = registeredCourses.length;
        b.dataset.count = registeredCourses.length;
    }
}

function updateAllDisplays() {
    displayAvailableCourses();
    displayRegisteredCourses();
    displayTimetable();
    updateStats();
    updateBadges();
    applyCompactMode();
}

// ==================== مستمعي الأحداث ====================
function setupEventListeners() {
    const search = document.getElementById('search');
    if (search) {
        search.addEventListener('input', debounce(displayAvailableCourses, 120));
        search.addEventListener('keydown', (e) => {
            if (e.key === 'Escape') {
                search.value = '';
                displayAvailableCourses();
            }
        });
    }
    
    document.getElementById('clear-search')?.addEventListener('click', () => {
        if (search) {
            search.value = '';
            displayAvailableCourses();
            search.focus();
        }
    });
    
    document.querySelectorAll('.chip[data-filter]').forEach(chip => {
        chip.addEventListener('click', () => {
            chip.classList.toggle('active');
            displayAvailableCourses();
        });
    });
    
    const toggleBtn = document.getElementById('toggle-filters');
    const filtersPanel = document.getElementById('filters-panel');
    toggleBtn?.addEventListener('click', () => {
        toggleBtn.classList.toggle('open');
        filtersPanel?.classList.toggle('open');
    });
    
    document.getElementById('theme-toggle')?.addEventListener('click', toggleTheme);
    document.getElementById('compact-toggle')?.addEventListener('click', toggleCompactMode);
    
    document.getElementById('save-btn')?.addEventListener('click', saveRegistration);
    document.getElementById('clear-btn')?.addEventListener('click', clearAll);
    document.getElementById('print-btn')?.addEventListener('click', printTimetable);
    
    document.getElementById('alert-ok')?.addEventListener('click', closeAlert);
    document.getElementById('alert-modal')?.addEventListener('click', (e) => {
        if (e.target.id === 'alert-modal') closeAlert();
    });
    document.addEventListener('keydown', (e) => {
        if (e.key === 'Escape') closeAlert();
    });
    
    const scrollBtn = document.getElementById('scroll-top');
    window.addEventListener('scroll', () => {
        scrollBtn?.classList.toggle('visible', window.scrollY > 400);
    }, { passive: true });
    scrollBtn?.addEventListener('click', () => {
        window.scrollTo({ top: 0, behavior: 'smooth' });
    });
}

function debounce(fn, delay) {
    let t;
    return function(...args) {
        clearTimeout(t);
        t = setTimeout(() => fn.apply(this, args), delay);
    };
}

// ==================== حفظ/مسح/طباعة ====================
function saveRegistration() {
    if (registeredCourses.length === 0) {
        showAlert('لا توجد مواد', 'لم تقم بتسجيل أي مواد بعد', 'info');
        return;
    }
    
    const data = {
        student: "طالب SPU",
        semester: "الفصل الثاني 2025-2026",
        date: new Date().toLocaleDateString('ar-SA'),
        courses: registeredCourses,
        totalCredits: registeredCourses.reduce((s, c) => s + (c.credits || 0), 0),
        totalCourses: registeredCourses.length
    };
    
    try { localStorage.setItem('spu_registration', JSON.stringify(data)); } catch (e) {}
    
    const dataStr = JSON.stringify(data, null, 2);
    const uri = 'data:application/json;charset=utf-8,' + encodeURIComponent(dataStr);
    const link = document.createElement('a');
    link.href = uri;
    link.download = 'تسجيل_المواد_SPU.json';
    link.click();
    
    showAlert('تم الحفظ', 'تم حفظ جدولك وتنزيل الملف بنجاح', 'success');
}

function clearAll() {
    if (registeredCourses.length === 0) return;
    if (confirm('هل أنت متأكد من مسح جميع المواد المسجلة؟')) {
        registeredCourses = [];
        updateAllDisplays();
        showAlert('تم المسح', 'تم مسح جميع المواد', 'info');
    }
}

function printTimetable() {
    if (registeredCourses.length === 0) {
        showAlert('لا يوجد جدول', 'لا يوجد جدول لطباعته', 'info');
        return;
    }
    
    const w = window.open('', '_blank');
    w.document.write(`
        <!DOCTYPE html>
        <html dir="rtl" lang="ar">
        <head>
            <meta charset="UTF-8">
            <title>جدولي الأسبوعي - SPU</title>
            <link href="https://fonts.googleapis.com/css2?family=Tajawal:wght@400;600;700;800&display=swap" rel="stylesheet">
            <style>
                * { box-sizing: border-box; }
                body { font-family: 'Tajawal', Arial, sans-serif; padding: 20px; direction: rtl; color: #0f172a; }
                .header { text-align: center; margin-bottom: 30px; border-bottom: 3px solid #6366f1; padding-bottom: 15px; }
                h1 { color: #0f172a; margin-bottom: 5px; font-size: 22px; }
                h2 { color: #6366f1; margin-top: 30px; font-size: 17px; }
                .sub { color: #475569; font-size: 14px; }
                .timetable { width: 100%; border-collapse: collapse; margin-top: 15px; border-radius: 12px; overflow: hidden; }
                .timetable th, .timetable td { border: 1px solid #e2e8f0; padding: 10px; text-align: center; vertical-align: middle; font-size: 13px; }
                .timetable th { background: #6366f1; color: white; font-weight: 700; }
                .course-item { padding: 12px; border-bottom: 1px solid #f1f5f9; }
                .total { margin-top: 20px; padding: 15px; background: #f4f6fb; border-right: 4px solid #6366f1; border-radius: 8px; font-weight: 700; }
                .no-print { margin-top: 30px; text-align: center; }
                .btn { padding: 12px 25px; border: none; border-radius: 10px; cursor: pointer; font-size: 14px; font-weight: 700; font-family: inherit; margin: 0 5px; }
                .btn-print { background: #6366f1; color: white; }
                .btn-close { background: #ef4444; color: white; }
                @media print { .no-print { display: none; } }
            </style>
        </head>
        <body>
            <div class="header">
                <h1>الجامعة السورية الخاصة</h1>
                <p class="sub">كلية هندسة الذكاء الاصطناعي</p>
                <p class="sub">الفصل الثاني 2025-2026 — ${new Date().toLocaleDateString('ar-SA')}</p>
            </div>
            <h2>الجدول الأسبوعي</h2>
            ${generatePrintableTimetable()}
            <h2>المواد المسجلة</h2>
            ${generatePrintableCoursesList()}
            <div class="no-print">
                <button class="btn btn-print" onclick="window.print()">طباعة</button>
                <button class="btn btn-close" onclick="window.close()">إغلاق</button>
            </div>
        </body>
        </html>
    `);
    w.document.close();
}

function generatePrintableTimetable() {
    let html = '<table class="timetable"><tr><th>الوقت</th>';
    DAYS.forEach(d => html += `<th>${d}</th>`);
    html += '</tr>';
    
    const tracker = {};
    timeSlots.forEach((time, idx) => {
        html += `<tr><td style="background:#f8fafc;font-weight:700;">${time}</td>`;
        DAYS.forEach(day => {
            if (tracker[`${day}-${idx}`]) return;
            let course = null, count = 1;
            for (const c of registeredCourses) {
                if (c.day !== day) continue;
                const slots = getCourseTimeSlots(c);
                if (slots[0] === time) {
                    course = c;
                    count = slots.length;
                    for (let i = 1; i < count; i++) tracker[`${day}-${idx + i}`] = true;
                    break;
                }
            }
            if (course) {
                html += `<td rowspan="${count}" style="background:${course.color};color:white;vertical-align:middle;">
                    <strong>${course.code}</strong><br><small>${course.room}</small>
                </td>`;
            } else {
                html += '<td></td>';
            }
        });
        html += '</tr>';
    });
    html += '</table>';
    return html;
}

function generatePrintableCoursesList() {
    let html = '';
    registeredCourses.forEach(c => {
        html += `<div class="course-item">
            <strong>${c.code}</strong> — ${c.name}<br>
            <small style="color:#475569;">${c.day} • ${c.time} • ${c.room} • ${c.instructor} • ${c.type === 'theory' ? 'نظري' : 'عملي'}</small>
        </div>`;
    });
    const total = registeredCourses.reduce((s, c) => s + (c.credits || 0), 0);
    html += `<div class="total">المجموع: ${registeredCourses.length} مادة — ${total} ساعة معتمدة</div>`;
    return html;
}

// ==================== التنبيهات ====================
function showAlert(title, message, type = 'warning') {
    const modal = document.getElementById('alert-modal');
    const icon = document.getElementById('alert-icon');
    const titleEl = document.getElementById('alert-title');
    const msgEl = document.getElementById('alert-message');
    const okBtn = document.getElementById('alert-ok');
    if (!modal) return;
    
    titleEl.textContent = title;
    msgEl.innerHTML = message;
    
    if (type === 'success') {
        icon.style.background = 'rgba(16, 185, 129, 0.12)';
        icon.style.color = '#10b981';
        icon.innerHTML = '<i class="fas fa-check-circle"></i>';
    } else if (type === 'info') {
        icon.style.background = 'rgba(99, 102, 241, 0.12)';
        icon.style.color = '#6366f1';
        icon.innerHTML = '<i class="fas fa-info-circle"></i>';
    } else {
        icon.style.background = 'rgba(239, 68, 68, 0.12)';
        icon.style.color = '#ef4444';
        icon.innerHTML = '<i class="fas fa-exclamation-triangle"></i>';
    }
    
    modal.style.display = 'block';
}

function closeAlert() {
    const modal = document.getElementById('alert-modal');
    if (modal) modal.style.display = 'none';
}

// ==================== بدء ====================
document.addEventListener('DOMContentLoaded', initApp);
